{
  "processing_results": {
    "total_batches": 2,
    "timestamp": "2025-08-17T18:20:01.661276",
    "directory": "D:\\AI\\New folder\\Brunel",
    "batches": [
      {
        "batch_number": 1,
        "timestamp": "2025-08-17T18:20:01.661276",
        "files": [
          "001_BUL-POL-6.1.1-Brunel-ISMS-Roles-and-Responsibilities-v1.1.pdf",
          "002_BUL-POL-6.2.1-Information-Security-Remote-Working-Policy-v1.1.pdf",
          "003_BUL-POL-8.1-ISMS-Asset-owners-Roles-and-Responsibilities-v1.0.pdf",
          "004_BUL-POL-10.1-Cryptographic-Policy-v1.1.pdf",
          "005_POL-IT-Acceptable-Usage-Policy-v1.0.pdf",
          "006_BUL-POL-IRM02-Information-Risk-Management-Methodology-v1.1.pdf",
          "007_POL-05.1-POLICY-Information-Security-Policy.pdf"
        ],
        "total_pages": 94,
        "extracted_content": {
          "001_BUL-POL-6.1.1-Brunel-ISMS-Roles-and-Responsibilities-v1.1.pdf": {
            "pages": 15,
            "text_length": 27350,
            "content": "Document Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 1 of 15\nInformation Security\nRoles and Responsibilities\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 1 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 2 of 15\nDocument History\nVersion Author Comments Date\nV 0.1 Andrew Clarke Initial Draft 09/12/2016\nV 0.2 Mick Jenkins Re-Org Draft 09/08/2017\nV1.0 Mick Jenkins First release for approvals 11/10/2017\nV1.1 Mick Jenkins Approved Exec 26/01/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as...",
            "full_content": "Document Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 1 of 15\nInformation Security\nRoles and Responsibilities\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 1 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 2 of 15\nDocument History\nVersion Author Comments Date\nV 0.1 Andrew Clarke Initial Draft 09/12/2016\nV 0.2 Mick Jenkins Re-Org Draft 09/08/2017\nV1.0 Mick Jenkins First release for approvals 11/10/2017\nV1.1 Mick Jenkins Approved Exec 26/01/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG Jenkins\nDocument Owner: Michael Jenkins Document Approver: Pekka Kahkipuro\nChief Information Security Officer Chief Information Officer\nDocument Distribution\nName Title Version Date of Issue\nAll Directors for Cascade\nDCO’s / DRO\nCOO\nCIO\nCFO\nUniversity secretary\nPROTECT Page 2 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 3 of 15\nContents\nContents ............................................................................................................................... 3\n1. Purpose of Document .................................................................................................... 4\n3. Principles ....................................................................................................................... 4\n4. Committees and Governance......................................................................................... 5\n5. Roles and Responsibilities ............................................................................................. 6\nPROTECT Page 3 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 4 of 15\n1. Purpose of Document\nThe purpose of this document is to define roles and responsibilities that are essential to the\nimplementation of the University’s Information Security Management System (ISMS) and\nInformation Security (INFOSEC) Policy.\nPlease refer to Brunel University London ISMS Document BUL-GLOS-000 - SyOPs Glossary of\nTerms for the glossary of terms, acronyms and their definitions for the suite of Brunel\nUniversity (BUL) London ISMS documentations.\nThe University’s Information Security Policy states that:\n“Brunel University London will maintain an Information Security Management\nSystem (ISMS) to preserve its competitive edge, educational excellence, cash-flow,\ndata protection, customer confidence and reputational image.\nBrunel University will ensure that the individuals, roles, bodies and governing\nframeworks are in place to maintain security ownership and responsibilities.”\nThis document formally establishes these governing bodies and roles and responsibilities for\nthe University Information Security management and the ISMS framework. An\norganisational schematic is at Annex A.\n2. ISO 27001 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control SOA – Number A.6 – Organisation of Information Security\nNumber\nISO 27001:2013 Information Classification Objective\nConformance Control A.6.1.1 Information Security Roles and Responsibilities\n3. Principles\nFrom ISO 27001 & ISO 270141, the principles of information security governance are to:\n Establish an organisational wide information security policy.\n Adopt a risk based approach.\n Set the direction of investment for INFOSEC.\n Ensure conformance with security requirements.\n Foster a security-positive environment.\n Review performance in relation to business outcomes.\n1 Information Security Governance\nPROTECT Page 4 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 5 of 15\n The organisation should define accountabilities and responsibilities at a high level,\nmaking top management explicitly accountable for information security but ensuring\nthat personal roles and responsibilities are also defined.\nWithin BUL, information security governance has been approached holistically and covers\npeople, processes and technology – it is not an IT issue. The security controls that form part\nof the ISMS take account of human, environmental and physical factors and cover information\nin all its forms including paper records. The BUL information security governance framework\nencompasses policies, processes, procedures, tools and training that are all joined up and\ndesigned in relation to each other in order to achieve BUL information security objectives.\n4. Committees and Governance\nCouncil\nCouncil has ultimate accountability for information security activities within the University.\nMore specifically, it protects institutional reputation by being assured that clear regulations,\npolicies and procedures that adhere to legislative and regulatory requirements are in place,\nethical in nature, and followed. Council needs to be assured that there are effective systems\nof control and risk management, and that governance structures and processes are fit for\npurpose by referencing them against recognised standards of good practice.\nExecutive Board\nThe University Executive Board is responsible via the Vice-Chancellor to Council for:\n Leading and fostering a culture that values, protects and uses information for the\nsuccess of the University and benefit of its members.\n Defining the University’s information security risk appetite in the context of the\nprevailing legal, political, socio-economic and technological environment and external\nstandards.\n Ensuring that a fit for purpose and adequately resourced information security\nframework is in place including this policy document as a reference document.\nThe Executive Board is ultimately accountable for information security governance and\nINFOSEC risk as a whole. The management and control of information security risks is an\nintegral part of Executive Board governance. The Executive Board provides overall strategic\ndirection by approving and mandating the information security principles and axioms but\ndelegates operational responsibilities for physical and information security to the COO, CIO\nand CISO.\nPROTECT Page 5 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 6 of 15\nThe Executive Board is responsible for achieving the Cyber & INFOSEC vision set out in the\nStrategy paper2 and ensuring the appropriate levels of investment are made to meet the\ndesired goals of the Cyber & INFOSEC Strategy.\nInfrastructure Strategy Committee\nThe Infrastructure Strategy Committee (ISC) is a forum for operational and executive\nconsideration of University-wide digital and information services strategy. This and its\ninformation subcommittee have specific oversight responsibilities related to\nimplementation of the Information Security Policy and ISMS security controls including the\nfollowing:\n Approving and reviewing the Cyber & INFOSEC strategy to ensure the implementation of\nthe Information Security Policy and associated ISMS.\n Analysing the business impact of proposed Cyber & INFOSEC strategies on the\nUniversity.\n Approving proposed policies of the ISMS.\n Serving as the executive champion for accepted strategies and policies within respective\nbusiness units and colleges.\nCyber and Information Security and Applications Steering Group (CISA)\nThe Cyber, Information Security and Applications Steering Group purpose is to drive the\nprogramme of Cyber & INFOSEC strategic projects forward and deliver the capability\ndevelopment outcomes and benefits as set out in the Cyber & INFOSEC strategy paper. It\nhas the following responsibilities:\n Confirming the scope and mandate for each cyber security project.\n Recommending investment decisions for Cyber & INFOSEC capability development.\n Providing visible leadership and commitment, championing and supporting the\nprogrammes of cyber security development.\n Promoting awareness of security initiatives within colleges and business units.\n Considering security risks, ideas, policies and procedures and how they may impact the\norganisation.\n Ensuring that cyber and information security is considered and built into systems and\napplications development life cycles.\n5. Roles and Responsibilities\nChief Information Officer (CIO) & SIRO\n2 A 5 year University Strategy published in June 2017 – see cyber 365 webpages\nhttps://intra.brunel.ac.uk/s/cc/security/Pages/default.aspx\nPROTECT Page 6 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 7 of 15\nThe CIO undertakes the role of Senior Information Risk Owner (SIRO) for the organisation.\nThe role of the SIRO is to take ownership of the organisation's information risk, act as an\nadvocate for information risk on the Executive Board, and provide advice to the board and\nCouncil on the Information risk governance and risk exposure. The SIRO’s responsibilities\ncan be summarised as:\n Leading and fostering a culture that values, protects and uses information for the\nsuccess of the organisation and benefit of its clients and stakeholders.\n Owning the organisation’s overall information risk policy and risk assessment processes\nensuring they are implemented consistently.\n Advising the VC & COO or relevant accounting officer on the information risk aspects of\ninternal controls.\nInformation Asset Owners\nInformation Asset Owners (IAOs) are Directors and Heads of Departments held accountable\nfor the protection of particular Information Assets3. IAOs may delegate information security\ntasks to managers or other individuals but remain accountable for the proper\nimplementation of the tasks. IAOs are responsible for:\n Ensuring compliance with BUL ISMS policies and all regulatory requirements as they\nrelate to the information assets.\n The appropriate classification and protection of the information assets.\n Ensuring all staff managing information assets are appropriately trained in INFOSEC.\n Determining appropriate criteria for obtaining access to information assets4.\n Authorising access to information assets in accordance with the classification and\nbusiness need.\n Undertaking or commissioning information security risk assessments to ensure that the\ninformation security requirements are properly defined and documented.\n Monitoring compliance with protection requirements affecting their assets.\nA number of senior staff will have de facto responsibility for the information assets under\ntheir control. For example, the HR Director will have responsibility for all the personnel\ninformation held within the organisation and will, in part, be responsible for determining\nhow it is used, accessed and stored. The responsibility may be implicit, for example the post\nholder will be the senior business owner of processes relating to the given asset.\nAlternatively, it may be explicitly outlined, for example in the terms and conditions\nassociated with research grant awards and information management.\nSecretary to Council and University Secretary\n3 The named asset owners are aligned to the ISMS information asset registers that have been completed within\nBUL.\n4 A Data Owner is accountable for who has access to information assets within their functional areas\nPROTECT Page 7 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 8 of 15\nThe Secretary to Council and University Secretary is a legal and governance role responsible\nfor reporting issues of concern to Council and the Executive and:\n Oversee reviews of legal effectiveness of policy and contractual documents used as\ninformation security safeguards and controls.\n Provide legal information and counsel to executive officers and council related to\ninformation security breaches, incidents and risk management.\nChief Information Security Officer (CISO)\nThe Chief Information Security Officer is a security leadership role with a core responsibility\nto drive and deliver the University’s Cyber & Information Security Strategy and implement\nthe Information Security Management System (ISMS). Responsibilities are summarised as:\n Developing and implementing a University-wide cyber and information security\nprogramme.\n Documenting and disseminating information security policies and procedures.\n Coordinating the development and implementation of a University-wide information\nsecurity training and awareness programme.\n Coordinating a response to actual or suspected breaches in the confidentiality, integrity\nor availability of University Data.\n Supporting and advising information asset owners on security matters and information\nsecurity risk.\nData Protection Officer (DPO)\nThe Data Protection Officer (DPO) is a leadership role required by the General Data\nProtection Regulations (GDPR)5. The Data Protection Officer is responsible for overseeing\nthe data protection strategy and its implementation to ensure compliance with GDPR. As\noutlined in the GDPR Article 39, the DPO’s responsibilities include, but are not limited to,\nthe following:\n Educating the University and employees on important compliance requirements.\n Training staff involved in data processing.\n Conducting audits to ensure compliance and address potential issues proactively.\n Serving as the point of contact between the university and GDPR Supervisory\nAuthorities.\n Monitoring performance and providing advice on the impact of data protection\nefforts.\n Maintaining comprehensive records of all data processing activities conducted by the\nUniversity, including the purpose of all processing activities, which must be made\npublic on request.\n5 GDPR legislation comes into force in May 18\nPROTECT Page 8 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 9 of 15\nCyber & Information Security Manager\nThe Cyber & Information Security Manager is an operational role responsible for day to day\ncyber and information security incident reporting, investigations, due diligence and\nintelligence collection. The role includes but is not restricted to:\n The project management and delivery of the University Cyber and Information\nSecurity ‘action plan’.\n Delivery of projects associated with the strategic aim of achieving Cyber Essentials\naccreditation and alignment to ISO 27001 controls.\n Leading on cyber and information security audits, testing, and documenting\nvulnerability assessments alongside the technical IT teams.\n Cyber security advice and support to all areas of the University and its business units.\n Delivery of training and awareness packages to improve end user awareness and\nprotection.\nCyber Officer\nThis position is responsible for operational coordination of cyber security intelligence\ncollection, security incident responses, and technical protections aligned to ISO 27001 and\nCyber security best practice. The cyber officer, reporting to the Cyber & INFOSEC manager\nhas the following high level roles:\n Ensure the development and promotion of a positive Cyber and Information Security\nculture that incorporates an increased awareness of security threats, vulnerabilities\nand cyber-crime prevention measures.\n Advise clients (either verbally or in writing) on various aspects of Cyber security, ICT\ntechnical controls, risk, threats, cyber intelligence and compliance.\n Delivery of policy, process and procedures to support the 20 Cyber controls and sub\ncontrols within the ICT arena.\n The delivery of Cyber Security audits and reviews in alignment with the Cyber &\nINFOSEC Manager leading the strategic programme and action plan.\n Coordinate investigation and responses to external and internal IT security threats or\ncompromises.\n Consult with University departments on maintenance of Disaster Recovery Plans and\nalign them with the risk management strategy.\nHead of Security & Emergency Planning\nThe Head of Security & Emergency planning is responsible for the University incident\nmanagement plan (IMP) and providing guidance on the physical and procedural security for\nsecuring information assets. The role works closely with the CISO and cyber security team\nto ensure criminal acts are correctly reported and investigated. The core responsibilities for\nINFOSEC are:\nPROTECT Page 9 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 10 of 15\n Conducting joint criminal investigations with the support of the campus police\nofficer.\n Reporting crime to the relevant fraud or cyber-crime departments.\n Maintaining an incident and cyber-criminal database to generate reports.\n Conducting ISMS audits aligned to physical and procedural controls for information\nassets alongside the Cyber officer.\nHead of IT Infrastructure and Operations & Head of Development and Application Services\nThese roles lead and champion the requirements for embedding cyber and information\nsecurity good practice within the centralised IT teams. Both roles within the ISMS act as\nData Custodians6 and are responsible for:\n Implementing appropriate physical and technical controls7, to protect the\nconfidentiality, integrity and availability of University data.\n Applying the 5 cyber security controls specified by the Cyber Essentials scheme8.\n Understanding and reporting on security risks and how they impact the\nconfidentiality, integrity and availability of University Data.\n Ensuring the relevant ISMS patching and configuration policy is adopted within the\ncentralised IT teams and reported on regularly to provide risk exposure status.\n Ensuring comprehensive disaster recovery architecture is maintained and operations\nare in place for such.\n Investigating and resolving information security incidents in conjunction with the\nCyber & INFOSEC Manager and CISO.\n Supporting appropriately authorised forensic investigations overseen by\nGovernance, Information, & Legal Services, the CIO or CISO.\n Ensuring compliance with required RPOs and RTOs during business continuity\nevents.\n Motivating, organising, mentoring, and directing department managers and staff\nregarding the security of information assets and cyber risks.\n The corrective action plans and remediation activity from internal and external\naudits, and other observed vulnerabilities.\nCollege and Department IT officers\nCollege and department IT officers, responsible for specific business unit IT systems, also act\nwithin the ISMS as Data Custodians. They are responsible for:\n6 Data Custodians are IT services and / or locally appointed persons responsible for the technical environments.\nThis may also be a person who has technical control over an information asset dataset with administrator level of\naccess.\n7 Aligned to the Statement of Applicability and the development of ISMS technical controls\n8 Aligned to the Statement of Applicability and the development of ISMS technical controls\nPROTECT Page 10 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 11 of 15\n Applying appropriate physical and technical safeguards to protect the confidentiality,\nintegrity, and availability of information asset datasets.\n Leading and championing the requirements for embedding cyber and information\nsecurity good practice within College and departmental teams.\n Applying IT technical controls within the ISMS policies and controls.\n Implementing the 5 cyber security controls specified by the Cyber Essentials Scheme.\n Understanding and reporting on security risks and how they impact the\nconfidentiality, integrity and availability of University Data.\n Ensuring the relevant ISMS patching and configuration policy is adopted within the\nbusiness unit.\nUniversity Department Heads and Managers\nHeads of Departments and Managers are responsible for:\n Day-to-day conformance with the University information security policies and\ncollege policy.\n Ensuring that security controls are in place in accordance with information security\npolicy and in particular, they should take measures to ensure that staff:\no Are informed of their information security obligations in adherence to\nrelevant policy by means of appropriate awareness, training and education\nactivities.\no Comply with the information security policies and undertake good\ninformation security practice.\no Providing the direction, support, and management necessary to ensure that\ninformation assets are appropriately protected within their area of\nresponsibility.\nAll Users\nAll individual users of University information systems and those handling or having access to\nUniversity information outside of those systems shall be responsible for:\n Complying with all relevant information security, policies, practices and procedures\nincluding any external accountability.\n Ensuring that they undertake, or request where necessary, relevant information\nsecurity awareness training to enable them to undertake their roles.\n Reporting information security incidents via the defined and approved channels.\n Ensuring that the University Data Protection Officer is informed of all potential\nbreaches of privacy laws in accordance with the Data Protection Policy.\n-End-\nPROTECT Page 11 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 12 of 15\nAnnex A\nV1.0\nUniversity Committees & Executive Board Secretary to Council\n& University\nAsset Secretary\nOwners\nBusiness Units\nSIRO\nService GDPR\nColleges Research\nDepts\nSenior Information Risk Owner\nInformation Asset Owners Policy & Compliance Data Protection\nOfficer\nInformation Asset Leads\nGeneral Data Protection\nRegulations\nRisk\nHead of Risk\nData Asset\nCustodians Cyber & Protection\nINFOSEC Strategic and\nIT Governance & operational risk\nCyber Security Technical Controls\nINFOSEC Risk Management, assurance, ISMS Framework & Head of Security &\nGovernance, Audits, Investigations, compliance Emergency Planning\nIT Teams\nCyber and INFOSEC Team Information Exchange for Metrics\nPhysical Security,\nAudits, Investigations\nHead IT Infra & Ops Head Development\n& Apps CISO\nIT Governance, Policy & Cyber & INFOSEC Cyber & Reporting of Operational Risk\nSystems managements Controls INFOSEC\nManager\nBusiness Unit Heads of IT Cyber and Information Security Ops & Plans,\nProjects & Audits\nOrganisation of BUL\nCyber Security Cyber Security\nAuditor Officer Information\nInformation Asset Audits & Controls Advice\nSecurity Management System (ISMS)\nPROTECT Page 12 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 13 of 15\nAnnex B\nData Owner and Custodian Roles\nA Data Owner has administrative control and has been officially designated as accountable for a specific information asset dataset. This is usually the most\nsenior officer in a Directorate or College division. Some examples of Data Owners include the Registrar and student data; The CFO for financial data; & the\nHR Director for employee data. Within colleges this role will fall to the Director of College Operations or the Institute Director of Operations for research. In\nmost cases, the Data Custodian is not the Data Owner.\nData Custodians are IT services and / or locally appointed persons responsible for the technical environments. A system administrator or Data Custodian is a\nperson who has technical control over an information asset dataset. Usually, this person has the administrator or root account or equivalent level of\naccess. This is a critical role and it must be executed in accordance with the access guidelines developed by the Data Owner.\nData Users also have a critical role to protect and maintain BUL information systems and data. For the purpose of information security, a Data User is any\nemployee, contractor or third-party provider who is authorised by the Data Owner to access information assets.\nGeneral Responsibilities of the Data Owner\n1. Ensure compliance with BUL policies and all regulatory requirements as they relate to the information asset.\n2. Assign an appropriate classification to information assets. BUL has three classifications of information assets:\n University Confidential\n Protect\n Unclassified\nPROTECT Page 13 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 14 of 15\n3. Determine appropriate criteria for obtaining access to information assets. A Data Owner is accountable for who has access to information assets within\ntheir functional areas. A Data Owner may decide to review and authorised each access request individually or may define a set of rules that determine who\nis eligible for access based on business function, support role, etc. Access must be granted based on the principles of least privilege as well as separation of\nduties.\n4. Bi-annually, the Data Owner is also responsible for reviewing who has been given access to ensure accuracy. University audits of information assets will\ntake place annually as part of the ISMS.\n5. Ensuring that Data Custodians implement reasonable and appropriate security controls to protect the confidentiality, integrity and availability of\nUniversity Data.\nBUL has published guidance on implementing reasonable and appropriate security controls based on three classifications of data: Unclassified, Protect and\nUniversity Confidential. See the BUL-POL-8.2 Information Classification for more information. Data owners will often have their own security requirements\nspecified in contractual language and/or based on various industry standards. Data owners should be familiar with their own unique requirements and\nensure Data Custodians are also aware of and can demonstrate compliance with these requirements. The Cyber and Information Security Manager can\nassist with mapping controls identified in the BUL-PROC-8.02 Information Classification to controls mandated by contract(s) or industry standards.\nGeneral Responsibilities of the Data Custodian\n1. Assign and remove access to others based upon the direction of the Data Owner.\nAssigning access to the information asset dataset so others can perform their respective job functions is an important and necessary part of the Data\nCustodian’s job.\n2. Produce reports or derivative information for others. In many cases the Data Custodian is also responsible for producing, interpreting, and distributing\ninformation based on the datasets to which he or she has access.\n3. Log all information provided and access granted to others. A log of all information that is disseminated must be kept including the dataset used, the\nreceiving party, and the date. Likewise, access granted to others must be logged including the access level granted and the dataset in question.\nPROTECT Page 14 of 15\nDocument Control\nReference: BUL-POL-6.1.1\nIssue No: 1\nIssue Date: 09/08/17\nPage: 15 of 15\n4. Implement appropriate physical and technical safeguards to protect the confidentiality, integrity, and availability of the information asset dataset. Data\nCustodians are expected to work with Data Owners to gain a better understanding of these requirements. Security controls must be documented and shared\nwith the Data Owner.\nPROTECT Page 15 of 15"
          },
          "002_BUL-POL-6.2.1-Information-Security-Remote-Working-Policy-v1.1.pdf": {
            "pages": 21,
            "text_length": 37981,
            "content": "Document Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 1 of 20\nInformation Security\nRemote working Policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nProtect Page 1 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 2 of 20\nDocument History\nVersion Author Comments Date\nV 0.1 Andrew Clarke Initial Draft 03/04/2017\nV 0.2 Andrew Clarke PWG Technical amendments and exceptions 06/04/2017\nPolicy renamed from Teleworking to Information\nV 0.3 Andrew Clarke 21/04/2017\nSecurity Remote working – approved CISA\nV 1.0 Andrew Clarke Approved Information Subcommittee 27/04/2017\nV 1.1 Andrew Clarke Appendix A – International Travel 06/03/2019\nAndrew Clarke Annual review 09/04/2019\nAndrew Clarke Annual review 06/05/2020\nDocument Approval\nThe contents of this document are classified as Protect t...",
            "full_content": "Document Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 1 of 20\nInformation Security\nRemote working Policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nProtect Page 1 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 2 of 20\nDocument History\nVersion Author Comments Date\nV 0.1 Andrew Clarke Initial Draft 03/04/2017\nV 0.2 Andrew Clarke PWG Technical amendments and exceptions 06/04/2017\nPolicy renamed from Teleworking to Information\nV 0.3 Andrew Clarke 21/04/2017\nSecurity Remote working – approved CISA\nV 1.0 Andrew Clarke Approved Information Subcommittee 27/04/2017\nV 1.1 Andrew Clarke Appendix A – International Travel 06/03/2019\nAndrew Clarke Annual review 09/04/2019\nAndrew Clarke Annual review 06/05/2020\nDocument Approval\nThe contents of this document are classified as Protect to Brunel University London (BUL)\ninformation classification. Proprietary information presented in this document may not be used\nwithout written consent from BUL and remains the exclusive property of BUL unless otherwise\nagreed to in writing.\nOwner: Michael Jenkins Chief Information Security Officer\nSignature: MGJ Date: 27 Apr 2017\nApprover: Pekka Kahkipuro Chief Information Officer\nSignature: PK Date: 27 Apr 2017\nDistribution:\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nProtect Page 2 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 3 of 20\nContents\n1. About this document 4\n1.1 Purpose 4\n1.2 Responsibilities 4\n1.3 ISO27001 Conformance 4\n1.4 Scope 5\n1.5 References 5\n1.6 Policy Objectives 5\n1.7 Policy Overview 5\n1.8 Policy Maintenance 6\n2.0 Remote Access Support Policy 7\n2.1 Policy Summary 7\n2.2 Policy Requirements 7\n2.3 Documentation and Data 9\n2.4 Working Remotely 9\n2.5 General Rules & Principles of Virtual Private Networks (VPNs) 9\n2.6 Reporting Security Incidents 10\n2.7 Business Continuity 10\n2.8 User Awareness 10\n2.9 Disciplinary Process 10\n3.0 Appendix A - International Travel 11\n4.0 Appendix B - Definitions 13\nProtect Page 3 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 4 of 20\n1. About this document\n1.1 Purpose of Document\nThis Policy establishes the area within Brunel University London covering Teleworking\nand Mobile Device Remote Access.\nPlease refer to Brunel University London ISMS Document BUL-GLOS-000 - SyOPs\nGlossary of Terms for the glossary of terms, acronyms and their definitions for the suite\nof Brunel University London ISMS documentations.\n1.2 Responsibilities\nTable 1 – responsibilities\nTitle / Role Description\nSystems Manager Is responsible for maintaining and managing systems policies on IT\nsystems and infrastructure and ensuring that remote teleworking\ncomplies with this policy.\nNetwork Manager Is responsible for maintaining and managing network policies on\nnetwork systems and ensuring that remote teleworking complies\nwith this policy.\nHead of Development and Is responsible for maintaining and managing password policies on\nApplication Services application and web systems and ensuring that remote teleworking\ncomplies with this policy.\nCyber & Information Is responsible for maintaining Remote Access policy best practice\nSecurity Manager and ensuring compliance with legislative and regulatory\nrequirements.\n1.3 ISO 27001 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control SOA – Number A6 – Organisation of information security\nNumber\nISO 27001:2013 Conformance Information Classification Objective\nControl\nA.6.2.1 Mobile Device Policy\nA.6.2.2 Teleworking & Remote working security\nProtect Page 4 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date06/05/2020\nPage: 5 of 20\n1.4 Scope\nThe scope of this policy applies to:\n• Brunel University employees, contractors, vendors and agents with a Brunel\nUniversity-owned or personally owned computer or workstation used to\nconnect to the Brunel University network from a remote location;\n• Information system resources, including data networks, LAN servers and PC\n(stand-alone or network-enabled) located on Brunel University London and\nnon-Brunel University London locations, where these systems are under the\njurisdiction and/or ownership of Brunel University London, and any personal\ncomputers and/or servers authorised to access Brunel University London’s\ndata networks;\n• Remote access implementations that are covered by this policy include, but\nare not limited to, dial-in modems, frame relay, ISDN, DSL, VPN, SSH, and\ncable modems, etc.\n• Remote access connections used to do work on behalf of Brunel University\nLondon, including reading, sending email and viewing intranet web resources\nfrom all types of equipment.\n1.5 References\n• CESG Good Practice Guide (GPG) 10 - Remote Working v2.2\n• Brunel University London Virtual Private Network (VPN) Policy\n• Brunel University London Acceptable Use Policy\n• Mobile Computing Policy\n1.6 Policy Objectives\nThe objectives of this policy with regard to the protection of information system\nresources against unauthorised access from remote locations are to:\n• Minimise the threat of accidental, unauthorised or inappropriate access to\neither electronic or paper-based information owned by Brunel University\nLondon or temporarily entrusted to it and to limit damage including the loss of\nsensitive or University confidential data, intellectual property, damage to public\nimage, damage to critical Brunel University internal systems;\n• Minimise Brunel University London’s network exposure, which may result in a\ncompromise of network integrity, availability and confidentiality of information\nsystem resources;\n• Minimise reputation exposure, which may result in loss, disclosure or\ncorruption of sensitive information and breach of confidentiality; and\nProtect Page 5 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date:06/05/2020\nPage: 6 of 20\n• Define standards for connecting to Brunel University's network from any host.\nThese standards are designed to minimise the potential exposure to Brunel\nUniversity from damages, which may result from unauthorised use of Brunel\nUniversity resources.\n1.7 Policy Overview\nBrunel University London information system resources are important business\nassets that are vulnerable to access by unauthorised individuals or unauthorised\nremote electronic processes. Sufficient precautions are required to prevent and\ndetect unwanted access from unauthorised users in remote locations. Users\nshould be made aware of the dangers of unauthorised remote access, and\nmanagers should, where appropriate, introduce special controls to detect or\nprevent such access\n1.8 Policy Maintenance\nSupporting standards, guidelines and procedures will be issued on an ongoing\nbasis by Brunel University London. Users will be informed of any subsequent\nchanges or updated versions of such standards, guidelines and procedures by\nway of e-mail or other relevant communication media. Users shall then have the\nobligation to obtain the current information systems policies from Brunel University\nLondon intranet (IB) or other relevant communication media on an ongoing basis\nand accept the terms and conditions contained therein.\nProtect Page 6 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 7 of 20\n2.0 Teleworking Policy\n2.1 Policy Summary\nThe purpose of this policy is to protect the confidentiality, integrity and availability of\nBrunel University London’s information by controlling remote access to University\nInformation Services (IS) systems by Brunel University London’s personnel,\ntemporary staff, contractors, students and service providers utilising Brunel\nUniversity London’s information system and to define standards for connecting to\nBrunel University London’s network.\nBrunel University London’s IS resources are assets important to Brunel University\nLondon’s business and stakeholders and its dependency on these assets demands\nthat appropriate levels of Information Security be instituted and maintained. It is\nBrunel University London’s policy that appropriate remote access control measures\nare implemented to protect its IS resources against accidental or malicious\ndestruction, damage, modification or disclosure, and to maintain appropriate levels\nof confidentiality, integrity and availability of such IS resources.\n2.2 Policy Requirements\n• It is the responsibility of Brunel University London’s employees, contractors,\nstudents and temporary staff with remote access privileges to Brunel University\nLondon’s network to ensure that their remote access connection is given the\nsame consideration as their on-site connection to Brunel University London;\n• General access to the Internet for recreational use by immediate household\nmembers through the Brunel University Network on personal computers is\npermitted for employees (although not recommended). The Brunel University\nemployee is responsible to ensure the family members do not violate any Brunel\nUniversity policies, do not perform illegal activities, and do not use the access for\noutside business interests. The Brunel University employee bears responsibility\nfor the consequences should the access be misused;\n• IT equipment provided to the employee to support working from home is for the\nexclusive use of that employee alone;\n• The only permitted remote access method for non-Brunel University London\ncomputers is via the Connect Portal VPN;\n• Managed mobile devices [running the SLM Windows build and registered with\nSCCM] and Community [Brunel owned and unmanaged] mobile devices e.g.\nLaptops, Blackberry’s, smartphones, iPhones and iPads are supported by Brunel\nUniversity London for remote connectivity;\n• Users are permitted to connect their personal mobile devices to Brunel University\nLondon email system. However, the IS Service Desk will only provide support for\nthis method of connection on a goodwill basis. Furthermore, it is the\nProtect Page 7 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 8 of 20\nresponsibility of the user to ensure that their personal mobile device is protected\nby a password. If that device is lost or stolen then it is the responsibility of the\nuser to advise their mobile provider and arrange for the device to be removed\nfrom the service. If the IS Service Desk believes that access to Brunel University\nLondon email systems is occurring without adequate security provisions, this\nfacility will be withdrawn immediately and a request for the mobile device to be\nwiped will be issued;\n• At no time should any Brunel University employee provide their login or email\npassword to anyone, not even family members.\n• Brunel University employees and contractors with remote access privileges must\nensure that their Brunel University-owned or personal computer or workstation,\nwhich is remotely connected to Brunel University's corporate network, is not\nconnected to any other network at the same time, with the exception of home or\npersonal networks that are under the complete control of the user.\n• Brunel University employees and contractors with remote access privileges to\nBrunel University's corporate network must not use non-Brunel University email\naccounts (i.e., Hotmail, Yahoo, AOL), or other external resources to conduct\nBrunel University business, thereby ensuring that official business is never\nconfused with personal business.\n• Routers for dedicated ISDN lines configured for access to the Brunel University\nnetwork must meet minimum authentication requirements of CHAP. [Ref.\nAppendix A – Definitions]\n• Reconfiguration of a home user's equipment for the purpose of split-tunnelling or\ndual homing is not permitted at any time.\n• Frame Relay must meet minimum authentication requirements of DLCI\nstandards.\n• Non-standard hardware configurations must be approved by Information\nSystems and Cyber & Information Security must pre-approve security\nconfigurations for access to hardware.\n• All hosts that are connected to Brunel University internal networks via remote\naccess technologies must use the most up-to-date anti-virus software, this\nincludes personal computers. Third party connections must comply with\nrequirements as stated in the Third Party Remote Access Support Policy\nAgreement.\n• Personal equipment that is used to connect to Brunel University's networks must\nmeet the requirements of Brunel University-owned equipment for remote access.\n• Organisations or individuals who wish to implement non-standard Remote\nAccess solutions to the Brunel University production network must obtain prior\napproval from Remote Access Services and InfoSec.\n2.3 Documentation and Data\nProtect Page 8 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 9 of 20\n• All University Confidential documentation being used at a remote location must\nbe securely stored and not displayed in a manner which allows its content to be\nviewed by unauthorised persons.\n• University Confidential data and documents belonging to Brunel University\nLondon must not be stored on personal equipment unless permission from the\nLine Manager has been obtained. Any data stored on personal equipment must\nbe encrypted, using advice obtained from the Cyber & Information Security Team\nfor Windows, LInux and Android devices.\n2.4 Working Remotely\n• Employees wishing to work from their own equipment should ensure that their\nhardware and software configuration complies with Brunel University London’s\nminimum requirements. It is the responsibility of the user to ensure their\nequipment is patched accordingly. The IS Service Desk will advise the user only\non suggested actions but they will not action any changes to non-Brunel\nUniversity London equipment.\n• Brunel University London will retain ownership of community devices and\nequipment.\n• The employee must take good care of the equipment and ensure that it be used\nin accordance with Brunel University London’s full range of policies.\n• When working in a public area, for instance on a train, the employee must take\nall reasonable steps to ensure that Brunel University London’s information\nremains confidential and secure. The employee must ensure that any\ndocuments/laptop screens are, as much as possible, not readily visible to\nmembers of the public.\n2.4.5 Trusted and Untrusted Access\nAccess to Brunel University of London services may be denied, withdrawn or\nrequire further steps (such as providing multiple factors of authentication – see\nMFA Policy) based on a number of conditions including (but not limited to) who\nyou are, the device you are using, your location, the date/time and what you are\nattempting to do.\nExamples include:\n• Denied: Jailbroken or rooted Apple iOS and Andoid mobile devices\n• You: If you are a student / member of staff, the department you belong to, the\ntype of job you do\n• Device: If the device is managed by Brunel or is a BYOD (Bring Your Own\nDevice e.g. untrusted), the operating system, the security conditions (e.g.\nantivirus, encryption, pin code etc)\n• Location: If you are on the University secure network, on the campus visitor\nnetwork, if you are in the UK, if you are in Europe etc\n• Time/Date: If you are within business hours, is it the middle of the night etc\nProtect Page 9 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 10 of 20\n2.5 General Rules & Principles of Virtual Private Networks (VPNs)\nApproved Brunel University students, employees and authorised third parties\n(contractors, vendors, etc.) must utilise the benefits of the University provided VPN\nfor remote access to University resources.\n• When actively connected to the corporate network, VPNs will force all traffic to\nand from the PC over the VPN tunnel: all other traffic will be dropped.\n• Dual (split) tunnelling is NOT permitted; only one network connection is allowed.\n• VPN gateways will be set up and managed by Brunel University network group.\n• All computers connected to Brunel University internal networks via VPN or any\nother technology must use the most up-to-date anti-virus software that is the\ncorporate standard (BUL Connect Portal Security Requirements) this includes\npersonal computers.\n• VPN users will be automatically disconnected from Brunel University's network\nafter thirty minutes of inactivity. The user must then logon again to reconnect to\nProtect Page 9 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 10 of 20\nthe network. Pings or other artificial network processes are not to be used to\nkeep the connection open.\n• The VPN concentrator is limited to an absolute connection time of 24 hours per\nsession.\n• Users of computers that are not Brunel University-owned equipment must\nconfigure the equipment to comply with Brunel University's VPN and Network\npolicies.\n• Only the Brunel-Cisco-approved VPN clients may be used.\n• By using VPN technology with personal equipment, users must understand that\ntheir machines are a de facto extension of Brunel University's network, and as\nsuch are subject to the same rules and regulations that apply to Brunel\nUniversity-owned equipment, i.e., their machines must be configured to comply\nwith Brunel University's Security Policies.\n2.6 Reporting Security Incidents\nAll security incidents, including actual or potential unauthorised access to Brunel\nUniversity London’s information systems via remote access, should be reported\nimmediately to the Head of Security and Emergency Planning or Cyber &\nInformation Security Manager.\n2.7 Business Continuity\nBusiness continuity plans may include provision for working from home or other\nremote locations in the event of Brunel University London’s campus or other\npremises being unavailable for a significant period of time.\n2.8 User Awareness\nUsers commencing remote working will be made aware by their Line Manager of\nthis policy and all its provisions.\n2.9 Disciplinary Process\nBrunel University London reserves the right to audit compliance with this policy from\ntime to time. Any disciplinary action, arising from breach of this policy, shall be\ntaken in accordance with Brunel University London’s Rules and Disciplinary Code\nas amended from time to time.\nProtect Page 10 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 11 of 20\n4.0 Appendix A – International Travel\nThe University is increasingly reliant on fast, reliable access to a wealth of digital information,\neven while travelling, particularly in relation to academic research. The demand for remote\ninstant access to the virtual office regardless of location or time of day via the use of portable\nelectronic devices which can offer the traveller both communications services and secure\naccess to University critical data is increasing exponentially.\nDevices such smart phones, laptops and tablets can all be secured, but the person operating\nthem, and indeed accessing data remotely, must be made aware of the associated risks they\nface whilst travelling on international business and to follow this policy and guidelines to\nmitigate the risk.\nStaff and students who are travelling internationally on University business must be familiar with\nwhat measures they can take to limit the potential for threats to expose vulnerabilities and\ncreate risk, they also need to understand that the very measures designed to protect them, can\nalso bring about unforeseen challenges when crossing international borders.\nThis advice can be found within the Travel Booking system that the University provides to\narrange all travel and accommodation in relation to University business (Ian Allen Travel) or\nfrom Terry Vaas, Head of Security And Emergency Planning\nFor example, such is the risk of compromise in some high cyber risk countries that an\nexpectation exists whereby any devices taken into the country will be accessed remotely and\nunencrypted data copied as a norm. This makes it essential that international travellers are fully\nbriefed regarding ICT entry requirements into each country, particularly those assessed as high\nICT risk (including Bahrain, China and Russia) and that they are provided with the necessary\ntraining to understand what mitigation measures should be implemented before travel.\nHowever, there are also instances where the measures deployed by border security agents in\nwestern countries have also placed sensitive corporate data at risk, and this is something which\nthe traveller cannot control or mitigate against.\nRecommendations:.\n• Always take ‘clean’ equipment where possible. The University offers clean loan laptops\nfor travel, loaded only with what is needed for that business trip. Any University\nConfidential information can then be accessed over the internet once arrived at the\ndestination and deleted before returning.\n• Follow University encryption guidelines - BUL-POL-10.1 - Cryptographic Policy. University\nresearch data can be subject to suspicion if academics and students undertake their\nresearch abroad.\n• Ensure you are aware of the rules surrounding encryption, and the legality of entering a\ncountry with an encrypted device.\n• Password protect all devices using strong complex password layers and ensure that both\nUniversity and personal devices are protected, where possible, by a multi-factor\nauthentication process.\nProtect Page 11 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 12 of 20\n• Disable remote connectivity such as Bluetooth, Wi-Fi, and file sharing when not in use,\nand always decline to allow others to connect a USB or portable device to any equipment\nbut especially a laptop or mobile phone.\n• Plan ahead – understand that there is a possibility you may be questioned by customs\nofficials. Carrying a headed letter in the local language stating that your equipment uses\ncommercial encryption software and that the information is normal business information in\nrelation to your role, might prove to be useful if you do face questioning at a border.\n• Never use USB drives or software received as gifts or promotional items until they have\nbeen verified clean by the University IS department.\n• Backup important data that will travel with you.\n• Assume all internet connections as insecure and use a VPN at all times.\n• Do not plug your device into USB charger kiosks in airports, hotels or other public places1. These\nmay be infected with malware that will be uploaded to your device that may result in your device\nbeing compromised and data being stolen.\n• Disable remote connectivity such as Bluetooth, Wi-Fi, and file sharing where possible.\n• Do not leave devices unattended. Even hotel safes should not be considered secure.\n1 If using a USB Data Blocker then charge points may be used – A USB Data Blocker will eliminate the risk of\ninfecting your phone or tablet with malware, and even prevent criminals installer/executing any malicious code that\nenables access your data.\nProtect Page 12 of 20\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 12 of 20\nRussia / Other risky\nUSA EU ROW\nChina / Iran countries\n(1)\nThreat\nTheft of Data     \nAcquisition of Data    \nTTPs\nSecurity checkpoint requisition - Be prepared to turn on and off\ndevices, and present all removable media for customs officials.\nYou may be asked to decrypt data for inspection at international     \nborders. In some countries, withholding your password is a\ncriminal offense.\nMan in the middle attack - method by which attackers manage\nto interpose themselves secretly between the user and a web\nservice they're trying to access. For instance, an attacker might\n    \nset up a Wi-Fi network with a login screen designed to mimic a\nhotel network; once a user logs in, the attacker can harvest any\ninformation that user sends, including banking passwords.\nEavesdropping attack - Eavesdropping attacks occur through the\ninterception of network traffic. By eavesdropping, an attacker\ncan obtain passwords, credit card numbers and other     \nconfidential information that a user might be sending over the\nnetwork\nPhishing and spear phishing attacks - likely to be targeted with\nspecific details about the visit abroad increasing complacency as     \nrecipient may have advertised the visit\nSocial engineering - Unsolicited contact in a social environment\nmay not be what it purports to be. The intention is to gain     \nintelligence through the source and human relationships.\nPen drive scam - introduction of malware. Free Pen Drive/Gifted\n    \nPen Drive following a show or host.\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 13 of 20\nSurveillance from voice / locations etc. Phone calls, electronic\ncommunications and even hotel rooms may be monitored as a     \nstandard practice.\nControls before departure:\nDelete email accounts on devices, both social and University     \nBriefing to all staff before travel from cyber team     \nNo data on local drives     \nIssue advisory notices on social engineering TTPs     \nChange all passwords on all devices and use different passwords\non each. Remove or limit biometric data for authentication.\nBiometrics have been used before in court cases to compel\n    \nhumans to unlock their phones (unwillingly). The factor of\n“something you know” literally cannot be compelled in a court\nof law or other situations\nEnable multi-factor authentication on all accounts used on your\n    \ndevice that support it.\nEnsure full-disk encryption on laptops.     \nEncrypt mobile phones and tablets (android and apple) -\nConfiguring automatic wiping settings to wipe the device’s data     \nafter a pre-determined number of passcode entry failures\nProvide “loaner” laptops and burner phones and/or tablet to\nlimit the loss of both University and personal data if the device     \nis lost, stolen or confiscated by officials.\nIssue temporary email accounts.     \nPurchase and install a glass “privacy screen cover“ to prevent\n    \nshoulder surfing\nLimit or minimise any data taken to include removable media\n    \nsuch as CDs, DVDs and thumb drives.\nPerform a full device back up and secure with a strong\n    \npassword. Store it in a secure location while you are away.\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 14 of 20\nInform banks and credit card companies of travel plans to\ninclude dates, locations and any special instructions.\nInternational transactions are typically flagged as fraud, and     \npurchases may be delayed or your card can cancelled without\nadvanced travel notice.\nConsider using virtual credit card numbers that offer one-time\n    \nuse and are disposable, yet will display on the credit card bill.\nPack only essential ID, credit and debit cards. Leave the others\n    \nin a secure location.\nUpdate data protection software such as operating systems,\nanti-malware, anti-virus, security patches and others prior to\n    \ndeparture. After you have updated the device, turn off\nautomatic updates in the device and app store\nDelete all saved Wi-Fi networks your device has “previously\nconnected to”\nYour device will attempt to login to previously connected     \nnetworks, and someone can log those probes including the\npasswords.\nDisable “side-loading”, which is a way for the device to allow\ninstallation of software from 3rd parties not using the trusted     \napp store.\nTurn on ‘find my phone’ features and ensure the device is\nconfigured to send the last known location. Test to make sure it     \nworks from another device or from the related website.\nControls while on travel (You have no reasonable expectation of privacy in some countries):\nDo NOT leave your device unattended.     \nSensitive or confidential conversations, transactions or data\n    \ntransfer should be kept to a minimum until you return home.\nUse the same rules for your personal and University devices to\nseparate acceptable social networking communications versus     \nsensitive transactions. Understand there is a difference\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 15 of 20\nbetween sharing a photo on social networking versus\nconnecting to your bank or credit card company.\nUse end-to-end encrypted applications (like Signal) for\ncommunications. SMS is not secure.\n1) Monitor your device’s network traffic to determine if any\nunencrypted communications occur and address, as needed.\n    \n2) Google Voice provides encrypted messages on all of your\ndevices, e.g. for MFA one time login codes.\n3) Use an application like Wickr or Wire that can automatically\ndelete messages after a certain amount of time.\nUse safe ATMs in public areas during daylight. Cover PIN entry\n    \nand cash output as much as possible.\nDetermine the availability and cost of purchasing a local mobile\nphone, prepaid local phones limit costs by not working after\nexceeding a maximum number of minutes. They are cheaper for\nlocal calls and have better connectivity. Buying local SIMs,\n    \nespecially PAYG, adds a level of anonymity, which may be good\nfor privacy/security. Obtain and install a local SIM card ONLY IF\nNEEDED, plugging anything unknown into your device is\ndangerous.\nUse trusted VPN connections as much as possible. If you don’t\nhave a VPN available, use HTTPS connections as much as     \npossible.\nFollow the principle of least privilege. While traveling you will\nlikely be connecting to many new, probably poorly managed,\nand potentially unsafe networks (e.g. in airports and hotels).     \nExpect to be targeted by malicious users on these networks. Do\nnot use an administrator account as your primary user account.\nWork only from MS OneDrive     \nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 16 of 20\nConnections in cyber cafes, public areas and hotels can be safe\nwith a VPN, but should otherwise be considered insecure and\nprobably monitored by state agents and/or criminals. Physical     \nPCs in such places may contain keystroke logging or other\nmalicious methods to gather your information.\nDo not loan your device to anyone, or attach unknown devices\nsuch as thumb drives. Thumb drives are notorious for computer     \ninfections.\nDisable device illicit access via wireless technologies by:\n1) Using airplane mode to disable or suspend all connectivity.\n2) Disabling Wi-Fi when not in use. Wi-Fi ad-hoc mode or\nunsecure file sharing enables direct access to devices.\n3) Disabling Bluetooth when not in use (or set it to “hidden,”\nnot \"discoverable”). Consider rental car Bluetooth PBAP (Phone\n    \nBook Access Profile) functionality loads the entire address\nbook, while Bluetooth (Personal Area Network) functionality\nenables connections with other Bluetooth devices.\n4) Do not automatically join any wireless networks from\nlaptops, tablets, or mobile phones. Manually pick the specific\nnetwork you want to join.\nReport lost or stolen devices as soon as possible to whomever it\nconcerns. This might include the University, mobile provider,\nhotel, airline, insurance company and/or local authorities. Local     \nauthorities have a better chance to find stolen property if it is\nreported stolen as soon as you know it is missing.\nControls Upon Returning Home (Very simply, assume that you have been compromised while traveling abroad and act accordingly):\nReturn the loaner device(s).     \nHave all devices, media and thumb drives reviewed for\nmalware, unauthorised access or other corruption. Do not\n    \nconnect it to the University network until you have tested it for\nmalware.\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 17 of 20\nIf the device is found to be compromised, contact IS/College IT\nto reformat it and rebuild it from trusted sources/media. Then     \nrestore data from backups taken before the trip.\nChange all University and personal passwords. If possible,\nchange the passwords for things like University network\n    \naccounts, banks, etc., using a device other than the one you\ntravelled with.\nChange all passwords on all devices and use different passwords\n    \non each\nInform your bank or credit card companies of your return and\n    \nreview transactions.\nContinue to monitor your business and personal financial\n    \ninstitution transitions for unauthorised or unapproved use.\nDamage to University\nLoss of high grade IP data     \nLoss of personal data and data breaches     \nLoss of commercially sensitive data     \n   \nRisk score HIGH MEDIUM LOW MEDIUM HIGH\nType of Data\nIntellectual Property     \nPersonal data     \nCommercially sensitive data     \n\n(1) Afghanistan, Bosnia and Herzegovina, Guyana, Iraq, Lao PDR, Syria, Yemen, Pakistan,\nDemocratic People's Republic of Korea\nOther HEI's\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 18 of 20\nIn Summary;\nThe significant majority of respondents offered staff (usually via a policy) who are traveling to certain countries a clean laptop and a burner phone, on return to the UK these\nare flattened.\nOther respondents also indicated that staff who travel with either their own or University devices were heavily encouraged (some had polices) to not access any services\nwhere data may be stored, use a secure VPN, don’t use public Wi-Fi and when returning to the UK do not connect to University systems/services until a complete check had\nbeen carried out on all devices which could result in the devices being flattened\nStaff traveling to China, North Korea, Iran, or the United States should not take any electronic gear with them; i.e. laptops, smart phones, tablets, etc.\nAny data they may need to access while overseas should be securely transferred before they leave. The only kind\nof mobile phone they should carry with them is one that can do no more than make or accept phone calls and, possibly, text messages.\nNo texts should be stored on the phone. No contact details should be stored on the phone.\nIf a flash drive is transported to any of these countries, make sure it is encrypted, and pack it in your checked luggage, not your carry-on bags.\nThe dangers are fairly obvious for the first three countries listed. However, Customs officials in the US are allowed to examine and/or impound any electronic equipment\nfrom any traveller, without having or providing a reason for doing so.\nSome further advice:\n• Keep any documents or electronic equipment which contain personal data or intellectual property out of sight in your hotel room; don’t leave them unattended if you\nare giving a presentation or out in public.\n• Password protect and encrypt any documents and electronic equipment; don’t write the passwords down.\n• Avoid using computers in internet cafes or hotels, as they may be monitored or infected with malware.\n• Take a full back up of everything before you go .\n• Do not purchase or download new software while abroad as they could be counterfeit or contain malicious programs.\n• Do not have any of your electronic devices repaired or worked on while abroad.\nDocument Control\nReference: BUL-POL-6.2.1\nIssue No: 5\nIssue Date: 06/05/2020\nPage: 20 of 20\n4.0 Appendix B - Definitions\nTerm Definition\nChallenge Handshake Authentication Protocol is an authentication method that uses a\none-way hashing function. DLCIData Link Connection Identifier (DLCI) is a unique\nCHAP number assigned to a Permanent Virtual Circuit (PVC) end point in a frame relay\nnetwork. DLCI identifies a particular PVC endpoint within a user's access channel in a\nframe relay network, and has local significance only to that channel.\nHaving concurrent connectivity to more than one network from a computer or network\ndevice. Examples include: Being logged into the Corporate network via a local Ethernet\nDual connection, and dialling into AOL or other Internet service provider (ISP). Being on a\nHoming Brunel University-provided Remote Access home network, and connecting to another\nnetwork, such as a spouse's remote access. Configuring an ISDN router to dial into\nBrunel University and an ISP, depending on packet destination.\nDigital Subscriber Line (DSL) is a form of high-speed Internet access competing with\nDSL cable modems. DSL works over standard phone lines and supports data speeds of\nover 2 Mbps downstream (to the user) and slower speeds upstream (to the Internet).\nA method of communication that incrementally can go from the speed of an ISDN to\nFrame\nthe speed of a T1 line. Frame Relay has a flat-rate billing charge instead of a per time\nRelay\nusage. Frame Relay connects via the service provider’s network.\nThere are two flavours of Integrated Services Digital Network or ISDN: BRI and PRI.\nISDN BRI is used for home office/remote access. BRI has two \"Bearer\" channels at 64kbit\n(aggregate 128kb) and 1 D channel for signalling info.\nRemote Any access to Brunel University's corporate network through a non-Brunel University\nAccess controlled network, device, or medium.\nSimultaneous direct access to a non-Brunel University network (such as the Internet,\nor a home network) from a remote device (PC, PDA, WAP phone, etc.) while\nSplit-\nconnected into Brunel University's corporate network via a VPN tunnel. VPN Virtual\ntunnelling\nPrivate Network (VPN) is a method for accessing a remote network via \"tunnelling\"\nthrough the Internet.\nProtect Page 20 of 20"
          },
          "003_BUL-POL-8.1-ISMS-Asset-owners-Roles-and-Responsibilities-v1.0.pdf": {
            "pages": 12,
            "text_length": 20604,
            "content": "Document Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 1 of 12\nInformation Security\nAsset Owners Policy\nA university-wide information management and\nsecurity policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 1 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 2 of 12\nDocument History\nVersion Author Comments Date\nV 0.1 Michael Jenkins Initial Draft 09/10/2017\nV 1.0 Michael Jenkins Approved Exec 26/04/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG...",
            "full_content": "Document Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 1 of 12\nInformation Security\nAsset Owners Policy\nA university-wide information management and\nsecurity policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 1 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 2 of 12\nDocument History\nVersion Author Comments Date\nV 0.1 Michael Jenkins Initial Draft 09/10/2017\nV 1.0 Michael Jenkins Approved Exec 26/04/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG Jenkins\nDocument Owner: Michael Jenkins Document Approver: Pekka Kahkipuro\nChief Information Security Officer Chief Information Officer\nDocument Distribution\nName Title Version Date of Issue\nAll Directors for Cascade\nDCO’s / DRO\nCOO\nCIO\nCFO\nUniversity secretary\nPROTECT Page 2 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 3 of 12\nContents\n1. Introduction ................................................................................................................. 4\n2. Purpose of Document ................................................................................................. 4\n4. Background ................................................................................................................. 5\n5. Principles .................................................................................................................... 5\n6. Asset Management .................................................................................................... 6\n7. Information Asset Register ......................................................................................... 6\n8. Roles and Responsibilities.......................................................................................... 6\n9. Risks to be Managed .................................................................................................. 8\n10. Information Leads ....................................................................................................... 9\n11. Annual Reporting ........................................................................................................ 9\n12. Guidance and Training ............................................................................................. 10\n13. Governance, Approval and Review .......................................................................... 10\nPROTECT Page 3 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 4 of 12\n1. Introduction\nThe Information Asset Owner (IAO) is a university mandated role, aligned to the Information\nSecurity Management System. Individuals are appointed as IAO and are responsible for\nensuring that information assets are handled and managed appropriately. This means making\nsure that information assets are properly protected and that their value to the organisation\nis fully exploited.\nAn Information Asset Owner reports to the Senior Information Risk Owner (SIRO)1, who in\nturn reports to the Executive Board.\nThe role is a standard requirement of an ISO 27001 Information Security Management System\n(ISMS) and supports the provision of a common, consistent and unambiguous understanding\nof what information is held, how important it is, how sensitive it is, the risk to it and who is\nresponsible for it.\n2. Purpose of Document\nThis document sets out the university’s approach to managing and securing its information\nand data assets. It explains the concept of an ‘Information Asset’ and defines the role of the\n‘Information Asset Owner’ who is responsible for each Information Asset. This document also\nsets out the primary responsibilities of an Information Asset Owner for managing the risks to\npersonal data and business critical information held within a department.\nThe University’s Information Security Policy states that:\n“Brunel University London will maintain an Information Security Management\nSystem (ISMS) to preserve its competitive edge, educational excellence, cash-flow,\ndata protection, customer confidence and reputational image.\nBrunel University will ensure that the individuals, roles, bodies and governing\nframeworks are in place to maintain security ownership and responsibilities.”\nA guiding principle of our Strategy document is that ‘All information and systems will have\nidentified owners.’ This document formally establishes the roles and responsibilities for IAO\nwithin the University Information Security Management System framework.\n3. ISO 27001 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control SOA – Number A.6 – Organisation of Information Security\nNumber SOA – Number A.8 – Asset Management\n1 Chief Information Officer\nPROTECT Page 4 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 5 of 12\nISO 27001:2013 Information Classification Objective\nConformance Control A.6.1.1 Information Security Roles and Responsibilities\nA 8.1 Asset Management\n4. Background\nThe university holds a wealth of information. This information can be in different formats and\nheld in a variety of locations and systems. It is essential that the university understands the\ninformation it holds so that we can adequately manage and protect it.\nTo manage this information, the university needs to have Information Asset Registers (IAR)\nwhich are managed by Information Asset Owners. Information Asset Owners are senior\nmembers of staff who have been appointed to be responsible for one or more identified\ninformation asset(s). This person will be responsible for ensuring that the Information Asset\nis accurately stored and maintained on the Information Asset Register. The full university\nInformation Asset Register will be owned by the CIO office.\nThe IAO will provide assurance to the Senior Information Risk Owner (SIRO) on the security\nand use of their assets. They are responsible for ensuring that specific information assets are\naccessed, handled and managed appropriately. This means making sure that information\nassets are properly protected and that their value to the organisation is fully exploited.\nPerforming the role well brings significant benefits. It provides a common, consistent and\nunambiguous understanding of what information the university holds, how important it is,\nhow sensitive it is, how accurate it is, how reliant the university is on it, and who is responsible\nfor it.\n5. Principles\nThe IAO role is about managing information not systems.\nThe driver for establishing the role of the IAO within the ISMS is to ensure that information\nassets, whether personal data or business data, are identified and securely handled. This also\ninvolves making sure that it is used in the way that is required, for as long as required.\nThe IAO is responsible for ensuring that information is protected appropriately, and where\nthe information is shared, that proper confidentiality, integrity and availability safeguards\napply and are in place.\nThe IAO role is about providing information assurance and making sure that action is taken to\nsecure information assets, its movement and sharing is appropriately managed, and that\ncontracts are in place where it is shared with 3rd parties.\nPROTECT Page 5 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 6 of 12\nAn IAO can delegate responsibility to particular areas that can support the role but the IAO\nand SIRO retain the accountability for proper information management and handling.\n6. Asset Management\nAn information asset is a body of information, defined and managed as a single unit, so that\nit can be understood, shared, protected and exploited effectively. Information assets have\nrecognisable and manageable value, risk, content and lifecycles. They include physical and\ndigital assets and are recorded in an information asset register – held centrally within the\nISMS and locally within colleges and directorates.\nThe university SIRO will decide what information assets IAO’s are responsible for. This could\ncover both sensitive personal data and non-personal information that is critical to business.\nIt could be held in paper as well as electronic formats.\nWhen an IAO is appointed, performance metrics will be discussed and agreed. Some of\nthese will be directly related to the need to demonstrate compliance with mandatory\nrequirements, but others may be specific to colleges or directorates.\n7. Information Asset Register\nAn Information Asset Register (IAR) is a mechanism for understanding and managing the\nuniversity’s assets and the risks to them. The IAR should include links between the\ninformation assets, their business requirements or processes and any technical\ndependencies that there may be. An IAR is dynamic and should be consistently updated and\nimproved to ensure each business unit develops a ‘mature’ understanding of the\ninformation that it holds.\nThe Cyber & INFOSEC teams have developed a standardised asset register but general\ninformation on the types of assets and how to develop the registers can be seen at Annex A.\n8. Roles and Responsibilities\nThe CIO undertakes the role of Senior Information Risk Owner (SIRO) for the organisation.\nThe role of the SIRO is to take ownership of the organisation's information risk, act as an\nadvocate for information risk on the executive board and provide advice to the board and\ncouncil on the Information risk governance and risk exposure. The SIRO’s responsibilities\ncan be summarised as:\n Leading and fostering a culture that values, protects and uses information for the\nsuccess of the organisation and benefit of its clients and stakeholders.\n Owning the organisation’s overall information risk policy and risk assessment processes\nand ensuring they are implemented consistently.\nPROTECT Page 6 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 7 of 12\n Advising the VC & COO or relevant accounting officer on the information risk aspects of\ninternal controls.\nInformation Asset Owners\nInformation Asset Owners (IAOs) are Directors and Heads of Departments responsible for\nthe protection of particular Information Assets2. IAOs may delegate information security\ntasks to managers or other individuals but remain accountable for the proper\nimplementation of the tasks.\nThe IAO is expected to understand the overall business goals of the university and how the\ninformation assets they own contribute to and affect these goals. The IAO should nominate\nat least one Information Lead to support the IAO on a day-to-date basis.\nIAOs are responsible for:\n Leading and fostering a culture that values, protects and uses information for the\nuniversity good.\n Knowing what information the asset holds, and what information is transferred in or out\nof it and what systems it links to.\n Know who has access and why, and ensure that their use is monitored.\n Understanding and addressing risks to the asset, provide assurance to the SIRO and\nensure that any data loss incidents are reported and managed following BUL guidelines.\n Ensuring compliance with BUL ISMS policies and all regulatory requirements as they\nrelate to the information assets.\n The appropriate classification and protection of the information assets.\n Ensuring all staff managing information assets are appropriately trained in managing,\nsecuring and accessing the assets.\n Determining appropriate criteria for obtaining access to information assets3.\n Authorising access to information assets in accordance with the classification and\nbusiness need.\n Undertaking or commissioning information security risk assessments to ensure that the\ninformation security requirements are properly defined and documented.\n Monitoring compliance with protection requirements affecting their assets.\n Ensuring that contractual agreements exist for the transfer to, or processing by, any\nthird party.\nA number of senior staff will have de facto responsibility for the information assets under\ntheir control. For example, the HR Director will have responsibility for all the personnel\ninformation held within the organisation and will, in part, be responsible for determining\nhow it is used, accessed and stored.\n2 The named asset owners are aligned to the ISMS information asset registers that have been completed within\nBUL.\n3 An IAO is accountable for who has access to information assets both internally and externally.\nPROTECT Page 7 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 8 of 12\nAn IAO will be required to consider the following questions:\n• Do I understand what information assets I am responsible for (including personal and\nnon-personal data) and has that understanding been properly documented within\nthe Information Asset Register (IAR) and shared with the SIRO and others who need\nthat information?\n• Have I assessed and logged information risks to those assets?\n• Do I have a plan for managing risks, and validating that security controls are in place?\n• Do my team(s) and third parties understand their roles and responsibilities in\nmanaging those risks and controls?\nThe SIRO, CISO, Cyber & INFOSEC team and Data Protection Officer are all organisational\nleads able to provide guidance support and advice in the management of information\nassets.\n9. Risks to be Managed\nAn Information Asset Owner shall need to assure against:\n• Inappropriate access to, or disclosure of, protectively marked or sensitive personal\ndata by staff, contractors and outsiders, whether accidental or deliberate\n• Inappropriate data sharing – too much or irrelevant data is shared internally i.e. a full\nlist with all personal data is provided where only numbers of a specific category have\nbeen requested.\n• Internal threat – staff acting in error or deliberately, or external parties getting your\ninformation illegally and exposing it/acting maliciously to defraud.\n• Information loss – particularly during transfer or movement of information, or as a\nresult of business or regulatory change\n• Loss of ready access to information\n• Records management – that information assets are not retained for longer than\nrequired (either by law or for business need) as outlined in the corporate retention\nand disposal schedule.\n• Business continuity/disaster recovery – that the relevant personnel are aware of the\nagreed continuity and recovery for their services.\nPROTECT Page 8 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 9 of 12\n• Loss of digital continuity – i.e. losing the ability to use information in the way required\nwhen required. By use we mean being able to find, open, work with, understand and\ntrust your information. The lifecycle of a piece of information – and how long you need\nto use and keep it – is often different to the lifecycle of the IT system that we have to\naccess and use it\n• Poor quality of information and poor quality assurance, for example, of datasets\n• Poor change management – business needs change, systems change, your information\nrisk appetite may change, so you need to keep your policies and processes in step\naccordingly\n10. Information Leads\nAn Information Lead should understand the overall business goals of the organisation and\nthe importance of the information assets in supporting these goals. Information Leads\nshould understand the IAOs responsibilities and lead in ensuring the methods outlined in\nAnnex A are fully exploited to support delivery.\nInformation Leads will be expected to:\n Review the IAR on a six monthly basis and ensure that the IAR is maintained and\nupdated when new assets are created.\n Ensure that retention periods for information are documented in the retention\nschedule. Arrange for documented audits to ensure that information is deleted in\naccordance with retention periods.\n Ensure that decisions are clearly recorded against any information that is retained\nover its agreed retention period.\n Ensure that managers understand the importance of maintaining correct access\ncontrols of drives and systems.\n Carry out regular audits of systems and drives to ensure correct access controls are\nmaintained.\n Ensure that local information handling guidelines are in place and that these refer to\ncorporate guidance where appropriate.\n Provide assurance to the IAO on a regular basis.\n Attend training as required.\n11. Annual Reporting\nIAOs will be required to provide annual assurance on the following areas to the SIRO. This\nreport will be presented to Executive Board.\n That local procedures governing the use of data are in place and updated when\nrequired.\nPROTECT Page 9 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 10 of 12\n That access control measures are in place for systems, which includes how access is\ngranted and removed for users.\n That updates on data flows (links to other systems) and reasons are provided.\n That action following security incidents are monitored and updated.\n That any records management responsibilities are captured (for example, the\nretention schedule is reviewed annually and that any system(s) used to store\ninformation have been reviewed to ensure retention is reflected.\n Contracts with data processers have the agreed information security and GDPR\nclauses and compliance with these are monitored.\n That appropriate Information Sharing Agreements are in place and reviewed where\nrequired.\n That actions identified during audits are captured in the IAR where required.\n12. Guidance and Training\nAll IAO’s and Information leads will receive the relevant baseline, and on the job training to\nbe able to undertake the roles and responsibilities. A specific IAO guidance shall be available\nto support the day to day management and security of the information assets under\nownership.\n13. Governance, Approval and Review\nThis policy and the university’s commitment to a robust information assurance framework\nare subject to continuous, systematic review and improvement. This university-wide policy\noperates as part of the ISMS and shall be governed by the Information subcommittee.\n-End-\nPROTECT Page 10 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 11 of 12\nAnnex A\nIdentifying an IAO\nAn IAO must have the power to make decisions about how Information Assets are managed.\nTherefore this role must be a senior member of staff. These posts will typically be assigned\nto Directors or Heads of Department.\nThe post holder must have the skills, resources and authority to discharge the\nresponsibilities and take action on any deficiencies in the relevant processes.\nAll IAOs must attend IAO training provided by the university which will include onsite\nsessions in the initial creation phase, followed by specific cyber security and GDPR training\nsessions. IAOs must attend subsequent training where it is identified.\nIdentifying Information Assets\nAssessing every individual file, database entry or piece of information isn’t realistic -\ntherefore the university and its departments needs to group information into manageable\nportions, and classify the data according to its value and sensitivity.\nTo assess whether something is an information asset, ask the following questions:\nValue: Does the information have a value to the organisation? How useful is it? Will it cost\nmoney to reacquire? Would there be legal, reputational or financial repercussions if you\ncouldn’t produce it on request? Would it adversely impact operational efficiency if you\ncould not access it easily? Would there be consequences of not having it?\nRisk: Is there a risk associated with the information? Is there a risk of losing it? A risk that is\nnot accurate? A risk that someone may try to tamper with it? A risk arising from\ninappropriate disclosure?\nRetention: Does the group of information have a manageable lifecycle? Were all the\ncomponents created for a common purpose? Will they be disposed of in the same way and\naccording to the same rules?\nPROTECT Page 11 of 12\nDocument Control\nReference: BUL-POL-8.1\nIssue No: 2\nIssue Date: 26/04/18\nPage: 12 of 12\nPROTECT Page 12 of 12"
          },
          "004_BUL-POL-10.1-Cryptographic-Policy-v1.1.pdf": {
            "pages": 11,
            "text_length": 17861,
            "content": "Document Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 1 of 11\nCryptographic Policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nProtect Page 1 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 2 of 11\nDocument History\nVersion Author Comments Date\nV 0.1 Andrew Clarke Initial Draft 03/04/2017\nV0.2 Andrew Clarke PWG Technical amendments and exceptions 06/04/2017\nV0.3 Andrew Clarke Amendments from CISA – conditionally approved 21/04/2017\nAmend Mick Jenkins role to CISO;\nV 0.4 Andrew Clarke Change from demanding encryption on all PII 17/08/2017\ncommunications to external only;\nV 1.0 Andrew Clarke Approved InfoSub Committee 26/01/2018\nAnnual review – Personally Identifiable Information\nreplaced with Personal Data (ref DPA 1998 - DPA 2018;\nV 1.1 Andrew Clarke 07/08/2019\nSensitive ...",
            "full_content": "Document Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 1 of 11\nCryptographic Policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nProtect Page 1 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 2 of 11\nDocument History\nVersion Author Comments Date\nV 0.1 Andrew Clarke Initial Draft 03/04/2017\nV0.2 Andrew Clarke PWG Technical amendments and exceptions 06/04/2017\nV0.3 Andrew Clarke Amendments from CISA – conditionally approved 21/04/2017\nAmend Mick Jenkins role to CISO;\nV 0.4 Andrew Clarke Change from demanding encryption on all PII 17/08/2017\ncommunications to external only;\nV 1.0 Andrew Clarke Approved InfoSub Committee 26/01/2018\nAnnual review – Personally Identifiable Information\nreplaced with Personal Data (ref DPA 1998 - DPA 2018;\nV 1.1 Andrew Clarke 07/08/2019\nSensitive data replaced with special category data.\nSALT added to HASH function\nAndrew Clarke Annual review 08/06/2020\nDocument Approval\nThe contents of this document are classified as Protect to Brunel University London\n(BUL) information classification. Proprietary information presented in this document\nmay not be used without written consent from BUL and remains the exclusive property\nof BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance\ndocument.\nOwner: Michael Jenkins Chief Information Security Officer\nSignature: MGJ Date: 26 Jan 2018\nApprover: Pekka Kahkipuro Chief Information Officer\nSignature: PK Date: 26 Jan 2018\nDistribution:\nDocument Distribution\nName Title Version Date of Issue\nProtect Page 2 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 3 of 11\nContents\n1. About this document 4\n1.1 Purpose 4\n1.2 Responsibilities 4\n1.3 ISO27001 Conformance 4\n1.4 Scope 5\n1.5 References 5\n1.6 Policy Objectives 5\n1.7 Policy Overview 5\n1.8 Policy Maintenance 5\n1.9 Cryptography UK Legislation 6\n2.0 Cryptography Policy 7\n2.1 Policy Summary 7\n2.2 Data encryption for secure network transit 7\n2.3 Required use of encryption 7\n2.4 Management of encryption keys 9\n2.5 Required use of digital signatures 9\n2.6. Unsupported use of encryption 9\n2.7. Cryptography implementation 9\n3.0 Method Statement 11\nProtect Page 3 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 4 of 11\n1. About this document\n1.1 Purpose of Document\nThis Policy establishes the area within Brunel University London covering\nCryptographic controls.\nPlease refer to Brunel University London ISMS Document BUL-GLOS-000 - SyOPs\nGlossary of Terms for the glossary of terms, acronyms and their definitions for the\nsuite of Brunel University London ISMS documentations.\n1.2 Responsibilities\nTable 1 – responsibilities\nTitle / Role Description\nSystems Manager Is responsible for maintaining and managing systems policies on IT\nsystems and infrastructure and ensuring that IS cryptographic\ncontrols comply with this policy.\nNetwork Manager Is responsible for maintaining and managing network policies on\nnetwork systems and ensuring that network cryptographic controls\ncomply with this policy.\nHead of Development and Is responsible for implementing cryptographic controls throughout\nApplication Services the Software Development Life Cycle\nCyber & Information Is responsible for maintaining Remote Access policy best practice\nSecurity Manager and ensuring compliance with legislative and regulatory\nrequirements.\n1.3 ISO 27001 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control SOA – Number A10 – Cryptography\nNumber\nISO 27001:2013 Conformance Information Classification Objective\nControl A.10.1.1 Policy on the use of cryptographic controls\nA.10.1.2 Key Management\n1.4 Scope\nThe scope of this policy applies to:\nProtect Page 4 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 5 of 11\n Brunel University London’s personnel, temporary staff, contractors,\nstudents and service providers utilising Brunel University London’s\ninformation system resources;\n Information System resources, including data networks, SAN, LAN\nservers, PC (stand-alone or network-enabled) and laptops located on\nBrunel University London and non-Brunel University London locations,\nwhere these systems are under the jurisdiction and/or ownership of Brunel\nUniversity London, and any personal computers and/or servers authorised\nto access Brunel University London’s data networks;\n1.4.1 Out of Scope\nExclusions from the scope include Virtual Machine (VM) servers; this does not\ninclude VM indirect attached storage which remain in scope.\n1.5 References\nGPG 3 - Securing Bulk Data Transfers;\nGPG 5 - Securing Data At Rest On Laptops;\n1.6 Policy Objectives\nThe purpose of this policy is to provide guidance that limits the use of\nencryption to those algorithms that have received substantial public review and\nhave been proven to work effectively. Additionally, this policy provides direction\nto ensure that UK regulations and legislation are followed, and legal authority is\ngranted for the dissemination and use of encryption technologies outside of the\nUK.\nThis policy document sets out principles and expectations about when and how\nencryption of University digital information should (or should not) be used.\n1.7 Policy Overview\nBrunel University London information system resources are important business\nassets that are vulnerable to access by unauthorised individuals or\nunauthorised remote electronic processes. Sufficient precautions using\nencryption are required to prevent unwanted access from unauthorised users.\n1.8 Policy Maintenance\nSupporting standards, guidelines and procedures will be issued on an ongoing\nbasis by Brunel University London. Users will be informed of any subsequent\nchanges or updated versions of such standards, guidelines and procedures by\nway of e-mail or other relevant communication media. Users shall then have\nthe obligation to obtain the current information systems policies from Brunel\nUniversity London intranet (IB) or other relevant communication media on an\nongoing basis and accept the terms and conditions contained therein.\nProtect Page 5 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 6 of 11\n1.9 Cryptography UK Legislation\nExport regulations relating to cryptography technologies are complex. (Any\nmember of the University becoming involved in export of cryptography is\nadvised to seek specialist advice. Cyber & Information Security Services can\nassist by coordinating access to such advice.)\nThe Regulation of Investigatory Powers Act (RIPA) October 2000. Section 49\nincludes a provision for public authorities to demand, where it is judged there\nare reasonable grounds, decryption keys or decryption of information stored on\ncomputer systems in the UK. Anyone who could be assumed to have encrypted\nand stored data is very strongly advised to ensure that they retain the means to\ndecrypt it.\nProtect Page 6 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 7 of 11\n2.0 Cryptographic Policy\n2.1 Policy Summary\n Cryptographic techniques shall be implemented as needed based on a risk\nassessment in line with the requirements;\n All external communications involving personal data must be encrypted in\ntransit dependent upon the DPIA1 assessment;\n University or personal information must be protected in line with information\nsecurity classification guidelines;\n A schedule of all cryptographic controls shall be documented. Access to\nprivate keys must be restricted to identified individuals and stored on a\nnetwork share which only authorised staff, security and IS personnel can\naccess. The server must comply with the requirements for physical protection\nof assets;\n Brunel University London shall use the United States National Institute of\nStandards and Technology (NIST) FIPS-140-2 compliant encryption\nalgorithms where appropriate;\n The retention of keys associated with encrypted archives or digital signatures;\n2.2 Data encryption for secure network transit\n2.2.1 Provided no other restrictions apply, it is permitted for all University staff\nand students to use computer systems which would normally and by default use\nencryption, in order to secure data in transit on a communications network.\n2.2.2 Whenever possible and appropriate, encryption shall be used to support\nsecurity of remote access connections to the University's network and computing\nresources.\n2.3 Required use of encryption\n2.3.1 Loss, theft, or unauthorised disclosure of certain information could be\ndetrimental to the University, its staff or students. Such information includes that\ndefined as personal data by the Data Protection Act 2018. Where the University\nis handling digital personal data that cannot be sufficiently secured by physical\ncontrols, the data must be encrypted.\nData which must be handled securely, using encryption where pertinent,\nincludes:\n Any personal data classed as “special category” by the Data Protection Act.\n1 Data protection Impact Assessment - is a procedure that describes a data processing and identifies its needs, its adequacy\nand its risks\nProtect Page 7 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 8 of 11\n Any data, that is not in the public domain, about a significant number of\nidentifiable individuals.\n Personal data in any quantity where its protection is justified because of the\nnature of the individuals, source of the information, or extent of the information.\nData as described above must be encrypted:\n Where it is stored on a computing device or any computer storage medium\nwhich may be exposed to a significant risk of being lost or stolen. (Computers\nused to access remotely stored data or to process locally stored data may create\ncache files. Depending on the technology in use persistent and unencrypted\ncache files may be created.) Any such device when outside a secure University\nlocation is considered to be at significant risk, including home computers.\n Where it is to be transmitted via an external computer network using a\nmechanism that does not itself incorporate encryption. Depending on the specific\ntechnology being used this could refer to: sending data by email either within or\noutside the University, transferring files offsite, remotely accessing files or Web\npages. The risk is that unencrypted data in transit may be intercepted.\n When the data is being sent using a postal service where the data media\ncould be lost, stolen or intercepted and read whilst in transit.\n2.3.2 Where data being handled by the University is subject to an agreement\nwith an external organisation specifying use of encryption, the agreed handling\nprocedures, encryption technologies and standards must be used.\n2.3.3 Where personal data is to be encrypted and no overriding requirements\n(from an external body) apply, the recommended minimum University encryption\nstandards (or better) must be applied. For further details refer below to the\n“Cryptography implementation” section.\n2.3.4 Individuals must be authorised by the Head of Department before taking or\nsending University confidential information out of a secure University location.\nOptionally the Head of Department may elect to authorise specific individuals to\nroutinely undertake a particular activity involving a specific type of data. A\ndepartmental record of such authorisations is to be established and maintained\nrecording the following details:\n The data name or description.\n Who has been authorised to remove the data.\n Purpose for which the data is being removed.\n Date of data removal or an indication where removal is routine, e.g. “during\nexam marking”.\n Where the data is being taken or sent.\n Any agreed external security requirements that apply to the data.\n Confirmation that the data will be encrypted and handled securely.\n Encryption technology used e.g. name of encryption hardware or software.\nIf the data being sent off campus is of a personal identifiable nature, the Data\nProtection Officer must be consulted prior to the release.\n2.3.5 University Web transactions that involve the transfer of personal, special\ncategory or University Confidential data or funds must use encryption, for\nProtect Page 8 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 9 of 11\nexample, Hypertext Transfer Protocol over Secure Socket Layer or Transport\nSecurity Layer (HTTPS).\n2.4 Management of encryption keys\n2.4.1 Departmental procedures must be in place:\n To manage encryption keys in a way that ensures encrypted stored data will\nneither become unrecoverable nor accessible by an unauthorised person.\n To facilitate authorised officers of the University to obtain prompt access to\nthe encrypted information in the case of an emergency or investigation.\n To ensure that encryption keys are stored and always communicated\nsecurely.\n To record who holds encryption keys relating to important information.\n To revoke encryption keys when key holders leave.\n2.4.2 Where University information received as email has been encrypted for\nsecure transit, and is information which may be needed again later, it should be\nsecurely stored in a form which does not rely on ongoing accessibility of the\nsenders public key.\n2.5 Required use of digital signatures\n2.5.1 Significant University business information being communicated\nelectronically should be authenticated by use of digital signatures; information\nreceived without a digital signature should not be relied upon. Staff involved\nmust assess the level of risk and decide whether to require use of digital\nsignatures or whether to use an alternative means to authenticate the\ncommunication.\n2.6 Unsupported use of encryption\n2.6.1 Staff and students should:\n Not store encrypted data on University systems except where they are able to\njustify doing so for legitimate purposes.\n Be aware that the University reserves the rights to request sight, at any time,\nof the unencrypted version of any data stored on its systems and the option to\nremove any data.\n2.7. Cryptography implementation\n2.7.1 All encryption products, standards and procedures used to protect\nUniversity Confidential data must be ones which have received substantial public\nreview and have been proven to work effectively. (see 3.0 algorithm\nrequirements)\n2.7.2 Where a department elects to undertake an activity that would incur a cost,\nin order to remain compliant with security policy, then that cost should normally\nbe found from the departmental budget. For example, where a research project\nrequires measures for secure data handling it is appropriate that costs for any\nnecessary additional security measures are factored into the tender.\nProtect Page 9 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 10 of 11\n3.0 Algorithm Requirements\n3.1 Ciphers in use must meet or exceed the set defined as \"AES-compatible\" or\n\"partially AES-compatible\" according to the set defined for use in the United\nStates National Institute of Standards and Technology (NIST) publication FIPS\n140-2, or any superseding documents according to the date of implementation.\nThe use of the Advanced Encryption Standard (AES) is strongly recommended\nfor symmetric encryption.\n3.2 Algorithms in use must meet the standards defined for use in NIST\npublication FIPS 140-2 or any superseding document, according to date of\nimplementation. The use of the RSA and Elliptic Curve Cryptography (ECC)\nalgorithms is strongly recommended for asymmetric encryption.\n3.3 Signature Algorithms\nAlgorithm Key Length Additional Comment\n(min)\nECDSA P-256 Cisco Legal recommends RFC6090 compliance to avoid\npatent infringement.\nRSA 2048 Must use a secure padding scheme. PKCS#7 padding\nscheme is recommended. Message hashing required.\nLDWM SHA256 Refer to LDWM Hash-based Signatures Draft\n3.4 HASH (and SALT) Function Requirements\nIn general the Brunel University London adheres to the NIST Policy on Hash2\nFunctions. It is policy that, where possible, a SALT3 is added to the hashing\nprocess to force their uniqueness, increase their complexity without increasing\nuser requirements\n3.5 Key Agreement and Authentication\n3.5.1 Key exchanges must use one of the following cryptographic protocols:\nDiffie- Hellman, IKE, or Elliptic curve Diffie-Hellman (ECDH).\n3.5.2 End points must be authenticated prior to the exchange or derivation of\nsession keys.\n3.5.3 Public keys used to establish trust must be authenticated prior to use.\nExamples of authentication include transmission via cryptographically signed\nmessage or manual verification of the public key hash.\n3.5.4 All servers used for authentication (for example, RADIUS or TACACS)\nmust have installed a valid certificate signed by a known trusted provider.\n3.5.5 All servers and applications using SSL or TLS must have the certificates\nsigned by a known, trusted provider.\n3.6 Key Generation\n2 Hashing is the transformation of a string of characters into a usually shorter fixed-length value or key that represents the\noriginal string\n3 SALT is random data that is used as an additional input to a one-way function that \"hashes\" data, a password or passphrase.\nSalts are used to safeguard passwords in storage.\nProtect Page 10 of 11\nDocument Control\nReference: BUL-POL-10.1.1\nIssue No: 6\nIssue Date: 07/08/2019\nPage: 11 of 11\n3.6.1 Cryptographic keys must be generated and stored in a secure manner that\nprevents loss, theft, or compromise.\n3.6.2 Key generation must be seeded from an industry standard random number\ngenerator (RNG).\nProtect Page 11 of 11"
          },
          "005_POL-IT-Acceptable-Usage-Policy-v1.0.pdf": {
            "pages": 18,
            "text_length": 37855,
            "content": "Information Services\nIT Acceptable Usage Policy\nContents\n1. Document Control ........................................................................................................................... 3\n2. Purpose and Background ................................................................................................................ 4\n3. Scope ............................................................................................................................................... 4\n4. Definitions ....................................................................................................................................... 5\n5. Policy Statement ............................................................................................................................. 7\n5.1 Key Principles .......................................................................................................................... 7\n5.2 Policy Framework ......................................",
            "full_content": "Information Services\nIT Acceptable Usage Policy\nContents\n1. Document Control ........................................................................................................................... 3\n2. Purpose and Background ................................................................................................................ 4\n3. Scope ............................................................................................................................................... 4\n4. Definitions ....................................................................................................................................... 5\n5. Policy Statement ............................................................................................................................. 7\n5.1 Key Principles .......................................................................................................................... 7\n5.2 Policy Framework .................................................................................................................... 7\n5.3 Accountability ......................................................................................................................... 7\n5.4 Key roles & responsibilities ..................................................................................................... 8\n5.5 Exemptions.............................................................................................................................. 9\n5.6 Policy Compliance ................................................................................................................... 9\n5.7 Policy Review and Maintenance ........................................................................................... 10\n6 BUL System Use ............................................................................................................................. 10\n7. Email Use ....................................................................................................................................... 12\n8. BUL Networks ................................................................................................................................ 13\n9. Privileged Access ........................................................................................................................... 13\n10. User Endpoint Devices .................................................................................................................. 14\n11. Printing .......................................................................................................................................... 15\n12. Working Remotely ......................................................................................................................... 15\n13. International Working ................................................................................................................... 16\n14. Social Media .................................................................................................................................. 16\n15. Classification – University Confidential & Personal Data .............................................................. 16\n16. Payment Card Data ....................................................................................................................... 17\n17. Introducing new technology ......................................................................................................... 17\n18. Security Incident Management ..................................................................................................... 18\n1. Document Control\nTitle IT Acceptable Usage\nVersion 1.0\nReview by September 2025\nPolicy live date September 2024\nPolicy owner Chief Digital Information Officer\nStakeholders consulted in IS SLT & Managers\ndevelopment\nCollege IT (CDEPS, CBASS, CHMLS)\nData Privacy\nCampus Security\nFinance\nProcurement\nLegal Team\nFor information & action All employees, students and authorised affiliates of BUL\nsystems\nSupersedes BU-POL – AUP\nBUL-POL-EMAIL\nBUL-POL-6.2.1 – Remote Working\nBUL-POL-Social Media Use\nSupporting policies Under review/to be drafted\nInformation Security Policy\nInformation Security Awareness Policy\nIdentity & Access Management Policy\nPassword Management Policy\nBring Your Own Device (BYOD) Policy\nSecurity Incident Management Policy\nSupplier Security Management Policy\n2. Purpose and Background\n2.1 The IT Acceptable Usage Policy (ITAUP) aims to provide clarity on the behaviours expected and\nrequired by BUL employees, students, alumni and other authorised affiliates, in order to\nprotect the individual and BUL.\n2.2 Information technology systems are provided to enable authorised affiliates to contribute to\nachieving the vision and mission of BUL; intended to promote effective communication and\nworking practices within our organisation, and in the interest of supporting the delivery of\nlearning, teaching, innovation and research to the highest possible standards.\n2.3 The following BUL policies and frameworks should be referenced in conjunction with this\nPolicy:\n• Information Security Policy\n• Data Protection and Information Access Policy\n• Records Management Policy & retention schedules\n• Safeguarding Policy\n• Procurement Policy\n• Anti-Bribery and Corruption Policy\n• Prevent Policy\n• Social Media Use Policy\n• International Remote Working Policy\n3. Scope\n3.1 This Policy outlines the standards we require BUL employees, students, alumni and other\nauthorised affiliates to observe while using information and information systems provided by\nor through BUL. This includes but is not limited to email, internet, network, voice and mobile\nIT equipment, software and IT systems.\n3.2 This Policy applies whether using your own device or a BUL owned device to access or process\ninformation on BUL information systems.\n3.3 This Policy applies at all times, both on and off the BUL campus when using BUL information\nsystems and not just during your normal working hours.\n3.4 This Policy is taken to include the JISC Acceptable Use Policy, JANET Acceptable Use Policy,\nEduroam Use Policy and the Combined Higher Education Software Team (CHEST) User\nObligations, together with its associated Copyright Acknowledgement. The University also has\na statutory duty, under Section 26 of the Counter Terrorism and Security Act 2015, termed\n“PREVENT”. The purpose of this duty is to aid the process of preventing people being drawn\ninto terrorism.\n4. Definitions\nAccount Audit Logs Account audit logs capture information account which users\nare performing actions and when.\nAlumni Former students of BUL.\nAuthorised Affiliates Contractors, temporary workers, sponsored international\nresearchers, Council or Senate appointments, BUL Pathway\nCollege, Union of Brunel Students, Chaplaincy, recognised\nexternal teachers and supervisors for PGR students, Erasmus\nStudents at other universities, Trade Union Reps and work\nexperience students, third parties who have been granted\naccess to BUL’s information systems.\nAuthorised Device A user endpoint device that has been registered on the\nUniversity’s Connect Portal and approved to access the\nUniversity’s network and systems.\nAvailability Information and systems available when needed.\nBUL Systems Account Main account used to access BUL email, network services\nand cloud applications.\nCloud Applications Software delivered to users over the Internet.\nConfidential Data Information that is confidential to BUL and is not intended\nfor public dissemination.\nConfidentiality Only permitting authorised access to information, while\nprotecting from improper disclosure.\nCyber Security Incident A breach or attempted breach of an information system in\norder to affect its integrity or availability.\nBusiness Service Owner A senior-level individual or the designated department\nwithin BUL that holds ultimate accountability for a specific\ndataset or data domain.\nData Subject The identified or identifiable living individual to who\npersonal data relates.\nEmployees Fixed term and permanent employees on BUL’s payroll.\nInformation All information and data held on BUL’s applications and\nsystems.\nInformation Security Breach Any incident that results in unauthorised access to BUL’s\ndata, applications, networks or devices.\nInformation Security A framework of policies and controls that manage security\nManagement System (ISMS) and risks systematically across the entire organisation.\nTypically aligning with a common security standard e.g. ISO\n27001\nInformation Services Team The Information Services Team at Brunel encompassing the\nInformation Services Directorate and College IT Teams.\nInformation Systems BUL’s systems, devices, services (e.g. Internet, email, “bring\nyour own device” (when connected to the University\nsystems) and telephony, applications and information in\nlogical and physical form as well as any other University\nequipment. This also includes service providers’\nsystems/equipment when provided to BUL.\nIntegrity Information is recorded, used and maintained in a way that\nensures its completeness, accuracy, consistency and\nusefulness for the stated activity.\nMay/Should Refers to items regarded by BUL as minimum good practice,\nbut for which there is no specific legal requirement.\nNetwork Device A physical or virtual component used to facilitate\ncommunication and data transfer within a computer\nnetwork. E.g. routers, switches, firewalls\nPersonal Data Information relating to a Data Subject, who can be\nidentified directly or indirectly from that information.\nPersonal Data can be factual (such as name, email\naddress) machine data (such as IP Address, device\ninformation), or an opinion about that person’s actions or\nbehaviour. It does not include anonymised data.\nPrivileged Access Account System access account that provides elevated access to\nadminister a system and/or view restricted data.\nRemote Access Any access to BUL’s network through a non-BUL controlled\nnetwork.\nSingle Sign-on Authentication method that enables users to securely\nauthenticate with multiple applications and websites using\none set of account credentials.\nStudents All individuals enrolled on a course of study at BUL\n(undergraduates, postgraduate research, executive\nstudents)\nUser endpoint device Laptops, notebook computer, desktop, tablet, mobile phone\nWe Brunel University London (BUL)\nWill/Shall/Must Equals ‘is required to’. It is used to indicate mandatory\nrequirements to be strictly followed to conform to the\nstandard and from which no deviation is permitted.\n5. Policy Statement\n5.1 Key Principles\nAcceptable use is that which is lawful and in accordance with BUL’s objectives and policies. The\nsecurity of BUL’s data network against unauthorised use and access must be a primary concern of\neach and every user at all times.\nIndividuals will be granted access to BUL’s information systems on their justifiable operational need.\nIt is a clear breach of this Policy to act with disregard - whether wilful or negligent - of best\ninformation security best practice, and such disregard may be dealt with under BUL’s disciplinary\nprocedures.\nThe absence of a prohibition within this Policy shall not be taken to mean that permission is granted.\nAdvice must always be sought from BUL Information Services Team.\n5.2 Policy Framework\nThis Policy is part of BUL’s Information Security Management System and should be read in\nconjunction with the BUL Information Security Policy, BUL Data Protection & Information Access\nPolicy and any other relevant policy as mentioned in this document.\n5.3 Accountability\nBrunel’s Chief Digital Information Officer (CDIO) has overall accountability for this policy.\nThe CDIO will be accountable for implementing and enforcing this Policy and ensuring that all\nemployees, students and other authorised users receive guidance on IT acceptable usage.\n5.4 Key roles & responsibilities\nHead of Cyber Resilience\nThe Head of Cyber Resilience is responsible for the production, maintenance and communication of\nthis Policy and has overall responsibility for maintaining and ensuring compliance against this Policy.\nBUL Information Services Team\nBUL Information Services Team will implement technical controls and procedures to enforce this\nPolicy.\nIt is the Information Services Team’s responsibility to ensure that:\n• the technology estate (user devices, infrastructure, networks, applications & systems) is\nsecure and compliant to all relevant Acts and laws.\n• actual cyber security incidents are reported via BUL cyber security incident management\nprocess.\nBUL Line Managers\nLine managers are responsible for ensuring that their team – including contractors, temporary staff\nand any third parties – are aware of and understand:\n• This Policy and all supporting policies and procedures applicable in their work areas.\n• Their personal responsibility for information security.\n• How to access advice on information security matters.\nIn addition, Line managers are responsible for:\n• Ensuring that their team have completed all mandatory compliance training on information\nsecurity awareness, relevant to their role.\n• The acceptable use of information and information technology within their team.\n• Ensuring that no new software system or tooling is procured in their area of responsibility\nwithout appropriate due diligence and involvement of Information Systems, Data Protection\nand Legal Teams.\n• Ensuring that system accounts are disabled, and equipment and data is recovered from\nleavers – including employees, contractors, temporary workers and third parties.\nEmployees, Students and other Authorised Affiliates\nAll employees, students and other authorised affiliates must ensure that they have read and\nunderstood BUL’s Information Security Policy and supporting policies, as well as completed all\nmandatory training on information security awareness, relevant to their role.\nAll employees, students and other authorised affiliates must always comply with this Policy to\nprotect BUL’s electronic communication systems, data and equipment from unauthorised access and\nphysical damage.\nAll employees, students and other authorised affiliates are responsible for:\n• The security of BUL’s IT equipment and data. IT equipment must not be left unattended\nother than at home or within secure office spaces on campus, with equipment either\nlocked or logged off to prevent unauthorised access.\n• Ensuring that all sensitive/confidential information is removed from workspaces and\nmeeting rooms when not in use.\n• Ensuring that non-BUL equipment used to access BUL’s IT resources are maintained,\nupdated, and comply with the requirements set out within BUL’s Bring Your Own Device\n(BYOD) Policy.\n• Ensuring that all BUL IT equipment and data are returned on termination of their\nemployment contract or on leaving the University.\n• Reporting actual, suspected and potential cyber security incidents to the IT Service Desk as\nsoon as they are aware of them and assisting with investigations as required, particularly if\nurgent action must be taken to prevent further damage.\n• Ensuring that the necessary due diligence is completed before introducing new technology\nproducts in accordance with BUL’s Supplier Security Management Policy.\n5.5 Exemptions\nWhere it is not possible to apply or enforce any part of this policy (for example, legitimate research,\nteaching and academic activities that could be considered unacceptable use), then a request must\nbe raised with the IT Service Desk in the first instance. BUL’s Head of Cyber Resilience will review the\nbusiness justification and advise on the associated risks. Policy exceptions will only be issued when\nthe relevant Data Owner has signed off on the identified risks.\nThis policy may have an impact on users of assistive technology or assistive software due to their\ndisability. These individual cases will be considered on a case by case basis.\nAny potential research involving obscene or indecent material must always be approved by BUL’s\nLegal Team.\n5.6 Policy Compliance\nCompliance with this Policy and all supporting policies and procedures is a requirement for all\nemployees, students and other authorised affiliates.\nBUL reserves the right to monitor system use, including analysis of account audit logs. Any such\nexamination or monitoring will only be carried out by authorised and trained individuals.\nTechnical security controls and processes will be implemented by BUL’s Information Services Team\nto support the required procedures and settings for BUL system use.\nNon-Compliance\nAny evidence of non-compliance with any aspect of this Policy or any supporting policy or procedure\nshould be raised with the CDIO via the appropriate University authority (such as Director of HR, Head\nof Privacy, Head of Security and Campus Support Services).\nThe CDIO, or designated agent, has the authority to:\n• Withdraw access to all or any subset of information systems, or to commute such sanction\nby issuing a warning of unacceptable use.\n• Restrict or terminate a user’s right to use the BUL network.\n• Withdraw or remove any material uploaded in contravention of this Policy.\n• Where appropriate, disclose information to law enforcement agencies.\nBreach of this Policy and any supporting policy or procedure may be dealt with under BUL’s\ndisciplinary procedures and, in serious cases, may be treated as gross misconduct. Legal action may\nbe taken by BUL in any instance wherein it is deemed to be in the interests of the University to do\nso.\nAny risks arising from non-compliance must be recorded on the relevant risk register and\nproportionate mitigation action put in place.\n5.7 Policy Review and Maintenance\nThis Policy and all supporting policies and procedures that form BUL’s Information Security\nManagement System (ISMS) will be reviewed and updated on an annual basis to ensure that they:\n• Remain operationally fit for purpose;\n• Reflect current technologies;\n• Are aligned to industry best practice; and\n• Support continued regulatory, contractual and legal compliance.\n6 BUL System Use\n6.1 Access credentials are issued for the sole use of an individual; these will include, but are not\nnecessarily limited to, a username and password.\n6.2 Multi factor authentication (MFA) must be in place for all cloud application accounts. MFA\nverification should be via a BUL approved MFA Authenticator App and in accordance with\nBUL’s Identity and Access Management Policy\n6.3 Generic or group IDs shall not normally be permitted as a means of access to BUL’s\ninformation systems but may be granted under exceptional circumstances where sufficient\naccess controls are in place to protect the account.\n6.4 Generic identities must never be used to access confidential data or personally identifiable\ninformation.\n6.5 Privileged access accounts for system administration must only be accessed via a BUL owned\ndevice.\n6.6 BUL systems accounts must be logged into at least every 180 days, failure to do so may\nresult in the account being locked.\n6.7 Employees, Students and other authorised affiliates must ensure that they have read and\nunderstood BUL’s Password Policy. All passwords must be set in accordance with this policy.\n6.8 Individuals must take all possible precautions to protect their access credentials and never\nshare them with anyone at any time.\n6.9 Individuals must never grant access to BUL information systems with anyone at any time,\nunless authorised to do so as part of their role.\n6.10 No individual shall masquerade as another using login names and passwords, which are\ndesignated for individual use.\n6.11 Individuals who believe their credentials may have been compromised must immediately\nchange their password and report it to the IT Service Desk for further investigation.\n6.12 Individuals must not attempt to gain access to restricted areas of BUL’s systems, which is not\nrequired for their role, unless specifically authorised in accordance with BUL’s Identity &\nAccess Management Policy.\n6.13 The use of BUL’s information systems is prohibited when the use is deemed unacceptable.\nUnacceptable use includes, but is not limited to:\n• Any activity regarded as unlawful or potentially unlawful.\n• Disclosing personal identifiable information and restricted or confidential information to\nunauthorised individuals.\n• Compromising passwords (e.g., by using weak passwords, reusing them, making them\nvisible to or disclosing them to others)\n• Creation, download, storage, transmission or display of:\no Any offensive, obscene, or indecent images, data or other material or any\ncapable of being resolved into obscene or indecent images or unsolicited\nmaterial.\no Material with the intent to cause annoyance, inconvenience or anxiety.\no Material with the intent to defraud.\no Material that promotes or discriminates against anyone because of age, gender\nassignment, being married or in a civil partnership, being pregnant or on\nmaternity leave, disability, race including colour, nationality, ethnic or national\norigin, religion or belief, sex.\no Material that incites racial or religious hatred, terrorist activities, or hate crime,\nor instructional information about any illegal activities.\no Defamatory material (e.g., cyber bullying)\no Material that could damage BUL’s image or reputation.\no Material such that this infringes the copyright of another person.\n• Unsolicited bulk or marketing material unless using BUL’s email marketing tools, and in\naccordance with the Privacy and Electronic Communications Regulation (2003), see Data\nProtection and Information Access Policy.\n• The use of BUL’s information systems for any commercial or business activity that is not\nin accordance with the aims and policies of BUL.\n• Deliberate unauthorised access to BUL equipment, facilities, or property.\n• Storing material downloaded for personal purposes on BUL systems.\n• Corrupting or destroying other individuals’ data.\n• Violating the privacy of other individuals.\n• Continuing to use an item of technology after the Information Services Team has\nrequested that use ceases as it poses a potential risk to the University.\n• Knowingly or recklessly introducing harmful software (e.g., malware) or opening\nattachments from unknown or untrusted sources.\n• Disabling security or email scanning software.\n• Signing up to ‘free’ or ‘trial’ versions of any software via their BUL account, as it\ngenerally allows for data/content to be used by the company, which may have\nimplications not just for personal data, but for the University’s business data and\nintellectual property rights.\n• Connection of any internet enabling device or other external link, enabling remote\naccess to any BUL system without permission. For example, unauthorised VPN software.\n6.14 Any information stored on or shared via BUL’s systems is subject to data protection and law\nenforcement legislation and should be managed in accordance with BUL’s retention and\ndisposal schedules.\n6.15 BUL reserves the right to use monitoring activities to protect against threats to the university\ncommunity and to the University itself.\n6.16 In certain circumstance it may be necessary for a member of the Information Services Team\nto access an individuals’ BUL systems account, for example to investigate a technical issue,\nto grant access to another individual for business continuity in their absence, or in other\nexceptional circumstances. Requests for access must be raised with the IT Service Desk in\nthe first instance, with either agreement from the individual for Information Services or\nanother individual to access their account, or if the user is unavailable, in consultation with a\nmember of the HR and Privacy Teams.\n6.17 BUL reserves the right to withdraw access privileges and report to the appropriate authority\nany user who uses the internet for illegal purposes.\n7. Email Use\n7.1 Authorisation for a BUL email account will either be triggered by the HR system for\nemployees, and the Student Records system for students, except for contractors and third\nparties where delegated processes are in place.\n7.2 An official BUL email account must be used for all communications on behalf of the\nUniversity to ensure traceability and security of BUL data and information.\n7.3 BUL email accounts should not be used to sign-up to services used outside of the University.\nE.g. shopping sites, social media\n7.4 Email containing University Confidential information must be encrypted when sending to\nexternal recipients outside of the organisation.\n7.5 Email communication with under 18s must comply with the BUL Safeguarding Policy.\n7.6 In situations where a shared mailbox is required, access to it will be configured through an\nindividual’s BUL account.\n7.7 Shared mailbox sponsors are responsible for ensuring that appropriate access is maintained.\n7.8 Automatic forwarding of emails from a University owned email account to an external email\naccount is not permitted.\n7.9 Legacy email protocols (POP, IMAP, Remote PowerShell, Exchange Web Services (EWS),\nOffline Address Book (OAB), Outlook for Windows, and Mac) are not permitted to connect to\nBUL email systems.\n7.10 The Microsoft Outlook App should be used to access BUL email from a user endpoint device.\nNative mail apps (e.g., Apple’s iPhone Mail app, or the Gmail app on Android) are not\npermitted to access BUL email.\n7.11 File attachments larger than 35MB are not permitted to be sent or received by BUL email\naccounts.\n7.12 Certain file extensions are not permitted to be sent or received, click here for more info.\n8. BUL Networks\n8.1 Individuals must not attempt to gain access to restricted areas of the network, or to any\npassword-protected information, which is not required for their role, unless specifically\nauthorised in accordance with BUL’s Identity & Access Management Policy.\n8.2 Only authorised individuals may physically access the BUL data centres, communications\n(comms) room or IT cabinets.\n8.3 Smoking, eating and drinking is strictly forbidden in areas housing network equipment or\nservers.\n8.4 Only user endpoint devices registered on the University’s Connect Portal are authorised to\nconnect to the BUL wired or wireless network.\n8.5 In highly critical infrastructure areas (data centres, comms rooms) individuals must not add\nor remove, modify, connect to or disconnect from the BUL network any equipment unless\napproved in writing by the Head of Infrastructure Operations and supported by an IT Change\nRequest.\n8.6 Individuals must not connect a wireless access point to the BUL network unless approved in\nwriting by the Head of Infrastructure Operations and supported by an IT Change Request\n8.7 No individual shall download/share large files or stream online services that could impact\nBUL network performance.\n9. Privileged Access\n9.1 Privileged access means access to BUL systems and data that has been granted to an\nindividual beyond that of a typical user. For example, administrative access to a system,\naccess to sensitive personal data on a HR system.\n9.2 Privileged access must be via an individual account with a unique username and password,\nwhich is separate from their day-to-day user account.\n9.3 Privileged access accounts must not be used for high risk or day to day user activities, for\nexample web browsing and email.\n9.4 Privileged access accounts must only be used to perform authorised duties where\nresponsibility is part of the individual’s assigned role duties.\n9.5 Individuals with privileged access rights are required to sign agreements annually to\nreinforce the Information Security Policy and ensure ongoing compliance.\n9.6 Individuals with privileged access shall take all necessary precautions to protect the\nconfidentiality of information encountered in the performance of their duties, and data must\nnot be used for purposes other than those already authorised.\n9.7 If methods other than using privileged access will accomplish an action, those other methods\nshould be used unless the burden of time or other resources required clearly justifies using\nprivileged access.\n10. User Endpoint Devices\n10.1 BUL purchased user endpoint devices (e.g. laptops, notebook computers, desktops, tablets)\nmust be procured and configured by the Information Services Team.\n10.2 Equipment procured by BUL is owned by BUL and the individual in receipt of the equipment\nis accountable and responsible for its use and storage until it is formally returned:\n• Must protect their BUL device from loss, theft and damage, and must also report any\nloss or theft to the IT Service Desk within 24hrs.\n• Must not allow their BUL device to be used by unauthorised users.\n• Must not attempt to deactivate, bypass, tamper with or reconfigure any protection\ninstalled on the device e.g. antivirus service, desktop firewall, services to install security\npatches or any other security measures that BUL has in place.\n• Must not install, un-install or change the configuration of software on their BUL device.\nAll software must be approved and installed by the Information Services Team.\n• Must only use software (including cloud applications) that is authorised by BUL on their\nBUL device. Authorised software must be used in accordance with the software\nsupplier’s licensing agreements.\n• Must not store local copies of confidential or personally identifiable information on their\nBUL device. This information must be held securely within approved BUL systems and or\nstorage areas. Note: this currently excludes data locally synced to the Microsoft Outlook\napp and OneDrive on BUL devices.\n• Must cease to use their device if they believe it has become infected with malware and\nimmediately report to the IT Service Desk for investigation.\n10.3 Users should take all reasonable steps to report any faulty equipment to the IT Service Desk,\nand endeavour to leave computers in a clean, usable state.\n10.4 Line managers are responsible for ensuring that all equipment and data is recovered from\ntheir direct reports on termination of their employment contract or on leaving the\nUniversity.\n10.5 All equipment that is no longer used for the purposes it was originally issued for should be\nreturned to the Information Services Team; there is no recourse for equipment to be gifted\nor purchased.\n10.6 Individuals using non-BUL equipment (computers, laptops, smart phones and/or tablets) to\naccess and use BUL IT resources, must comply with BUL’s Bring Your Own Device (BYOD)\nPolicy.\n11. Printing\n11.1 If there is a requirement to print documents containing personal or confidential information\nthis should be carried out on a BUL multi-function printer, requiring user authentication to\nrelease the print job.\n11.2 All paperwork printed that holds personal or confidential information must be held in a\nlocked drawer or filing cabinet and destroyed via BUL’s confidential waste disposal service.\n12. Working Remotely\n12.1 Employees, Students and other authorised affiliates must always be conscious of the\nphysical environment when working remotely, ensuring no one is looking over their shoulder\nat information on their device.\n12.2 Unprotected public WiFi networks (e.g. no password required to access) must not be used\nfor carrying out BUL work.\n12.3 When working away from the campus or your home network, it is advisable to use mobile\ntethering as an alternative to public Wi-Fi, but BUL cannot be held liable for the use of a\npersonal mobile phone including any data charges, and so any use of a personal phone for\nthis purpose is the individual’s choice.\n12.4 If it is necessary to use public WiFi the hotspot must be secured by the provider (e.g., train,\nconference venue, hotel, coffee shop) with a password to grant access and a clearly named\nnetwork to connect to from the list of available WiFi networks. Employees, Students and\nother authorised affiliates are responsible for checking the providers Ts & Cs before\nconnecting to the network to carry out their BUL work.\n12.5 VPN access to information systems hosted on the BUL network is only permitted via a BUL\napproved VPN client.\n12.6 It is the responsibility of individuals with VPN privileges to ensure that these privileges are\nprotected and not shared with unauthorised users.\n13. International Working\n13.1 The Information Services Team must approve the use of BUL issued equipment abroad and\nthis must be supported by an International Remote Working Request Form in accordance\nwith BUL’s International Remote Working Policy.\n13.2 Employees, students and other authorised affiliates accessing BUL information systems from\nother countries must be familiar with what measures they can take to limit the potential for\nthreats to expose vulnerabilities and create risk.\n13.2 Where there is a requirement to access BUL information systems from countries considered\nas high risk, this must be discussed with the Information Services Team and appropriately\nrisk assessed.\n14. Social Media\n14.1 The use of social media for BUL purposes shall be in accordance with BUL’s Social Media Use\nPolicy.\n14.2 Employees, students and other authorised affiliates must not use their BUL email address on\ntheir private social media accounts as this may compromise the security and privacy of BUL’s\nemail system.\n14.3 In line with data protection principals, personal social media channels must not be used for\nsharing sensitive and/or confidential/personal information.\n14.4 BUL M365 (Email, Teams, Viva Engage) and Intranets are the approved communication tools\nand must be used for all BUL related internal communications.\n14.5 Public social media may only be used for BUL purposes by using official BUL social media\naccounts with authorisation from the External Communications Team. Users of official BUL\nsocial media accounts shall be appropriately trained and be aware of the risks of sharing\nsensitive information via social media.\n14.6 Official BUL social media accounts shall be protected by strong passwords in-line with the\npassword requirements for administrator accounts in accordance with the BUL Password\nPolicy.\n14.7 Users shall behave responsibly while using any social media whether for BUL or personal\nuse, bearing in mind that they directly or indirectly represent the University.\n15. Classification – University Confidential & Personal Data\n15.1 Users must ensure that all University information (including third party information held by\nBUL) is classified correctly and treated appropriately in accordance with BUL’s Information\nClassification Policy and retention schedules.\n15.2 Everyone working with or using personal data that is not their own has a responsibility to\nensure appropriate confidentiality is maintained, and in accordance with the BUL Data\nProtection and Information Access Policy.\n15.3 All employees, students and other authorised affiliates are responsible for ensuring that\nappropriate access to data is maintained in accordance with the BUL Data Protection and\nInformation Access Policy and any other contractual obligation from data providers they\nmust meet.\n15.4 University confidential and/or personal data must not be stored on removable electronic\nmedia or locally on any device. Any data downloaded must be deleted from the device\nimmediately after accessing. Note: this currently excludes data locally synced to the\nMicrosoft Outlook app and OneDrive on BUL devices.\n15.5 Copies of University confidential and/or personal data must not be taken stored/saved to\nany location that is not within BUL approved systems and/or storage areas.\n16. Payment Card Data\n16.1 Only individuals who have been allocated with and trained to use card payment devices are\npermitted to use them.\n16.2 A central register will be maintained of all payment card devices owned or leased by BUL,\nwith all devices inspected on a regular basis.\n16.3 Users shall never store payment card data for any reason without approval from BUL’s\nFinance Department. This includes printing it or writing it down on paper.\n16.4 Guidelines for storing and protecting payment card data must be compliant with PCI data\nsecurity standards.\n16.5 An annual review will be conducted of BUL’s payment card environment and controls to\nensure PCI-DSS compliance.\n17. Introducing new technology\n17.1 The introduction of new technology must meet BUL’s minimum technology and security\nrequirements and be in accordance with BUL’s Supplier Security Management Policy.\n17.2 Individuals responsible for agreeing supplier contracts on behalf of BUL are responsible for:\n• ensuring that adequate background screening is conducted, in accordance with BUL’s\nProcurement Policy.\n• ensuring that the necessary security due diligence is completed before entering into a\nrelationship with a supplier, including an information security and data protection\nimpact assessment.\n• ensuring that any variations to BUL’s standard terms and conditions comply with BUL’s\nInformation Security Policy and are authorised by the Procurement Team, who will seek\nadvice on alternative clauses from Legal Services as appropriate.\n• assessing if restricted/confidential information will be shared with a supplier, and\nconsulting with the Legal Team for guidance on non-disclosure agreements.\n• ensuring that requests to share University information beyond the supplier have been\nsigned off by Data Protection and Privacy Team.\n• ensuring that supplier renewals include a review of the supplier’s information security\ncontrols.\n18. Security Incident Management\n18.1 Actual, suspected, threatened and potential cyber security incidents must be reported in a\ntimely manner to the IT Service Desk.\n18.2 Incidents that involve personal data must also be reported to BUL’s Data Protection Officer.\n18.3 Employees, Students and other authorised affiliates are responsible for assisting with\ninvestigations as required, particularly if urgent action must be taken to prevent further\ndamage."
          },
          "006_BUL-POL-IRM02-Information-Risk-Management-Methodology-v1.1.pdf": {
            "pages": 15,
            "text_length": 24845,
            "content": "Document Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 1 of 15\nInformation Security\nRisk Management\nMethodology\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 1 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 2 of 15\nDocument History\nVersion Author Comments Date\nV 0.2 Mick Jenkins Draft 09/08/2017\nV1.0 Mick Jenkins First release\nV 1.1 Mick Jenkins Approved ISC 26/01/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG Jenkins\nDocument Owner: Michael Jen...",
            "full_content": "Document Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 1 of 15\nInformation Security\nRisk Management\nMethodology\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 1 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 2 of 15\nDocument History\nVersion Author Comments Date\nV 0.2 Mick Jenkins Draft 09/08/2017\nV1.0 Mick Jenkins First release\nV 1.1 Mick Jenkins Approved ISC 26/01/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG Jenkins\nDocument Owner: Michael Jenkins Document Approver: Pekka Kahkipuro\nChief Information Security Officer Chief Information Officer\nDocument Distribution\nName Title Version Date of Issue\nAll Directors for Cascade\nDCO’s / DRO\nCOO\nCIO\nCFO\nUniversity secretary\nPROTECT Page 2 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 3 of 15\nContents\n1. Purpose of Document .................................................................................................... 4\n3. Scope ............................................................................................................................ 5\n4. Information Risk Assessments ....................................................................................... 5\n5. Scoring Tables 6\nPROTECT Page 3 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 4 of 15\n1. Purpose of Document\nThis handbook states the risk management approaches the Cyber & Information Security\nTeam (CIST) will utilise to support the identification and management of information risks.\nThe approaches within this handbook are aligned with industry good practice, including:\n• ISO 27001: Information security management system – Requirements\n• ISO 27002: Code of practice for information security controls\n• ISO 27005: Information security risk management\n• ISO 31000: Risk management — Principles and guidelines\n• ISO 22301: Business continuity management systems – Requirements\n• Cloud Security Alliance: Security, Trust & Assurance Registry (STAR)\n• Information Commissioner’s Office: Privacy impact assessments code of Practice\nAdditionally the risk management approaches within this toolkit are aligned with the\nobjectives stated in the University’s Risk Management Policy.\nPlease refer to Brunel University London ISMS Document BUL-GLOS-000 - SyOPs Glossary of\nTerms for the glossary of terms, acronyms and their definitions for the suite of Brunel\nUniversity (BUL) London ISMS documentations.\nThe University’s Information Security Policy states that:\n“Brunel University London will maintain an Information Security Management\nSystem (ISMS) to preserve its competitive edge, educational excellence, cash-flow,\ndata protection, customer confidence and reputational image.\nBrunel University will use a risk based approach to ensure that information assets are\nidentified and the confidentiality, integrity and availability are appropriately\nsafeguarded by security controls.”\nThis document formally establishes these governing bodies and roles and responsibilities for\nthe University Information Security management and the ISMS framework.\n2. ISO 27005 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control 27005:2011 Information security risk management\nNumber\nPROTECT Page 4 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 5 of 15\nISO 27005:2011\nConformance Control\n3. Scope\nThe CIST shall utilise the risk management approaches stated within this handbook to identify\nvulnerabilities, threats and mitigating controls associated with University business processes,\npeople, technologies and services. This handbook and the supporting tools / resources can be\nadopted by any University department or college.\nThe Chief Information Security Officer (CISO) is the owner of this handbook and shall ensure\nthat it remains operationally fit for purpose and is appropriately communicated.\n4. Information Risk Assessments\n4.1 Types of risk assessments\nThe following risk management approaches will be capable of identifying the majority of\nknown information security vulnerabilities and threats that could impact the University.\nStandard Risk Used for generic asset based risk assessments,\nAssessment Risk mitigation based on industry good practice,\nCIA Approach e.g. ISO 27002\nThird Party Security Used to assess third parties who process\nUniversity information\nAssessment\nSupports procurement and legal due diligence\nCloud Security Used to identify risks posed by cloud service\nChecklist providers (CSP) – used in conjunction with TPSA\nData Protection Used to identify risks associated with processing\nImpact Assessment personal information - Can be applied to process,\ntechnologies or services\nBusiness Impact Used to identify recovery time / recovery point\nAssessment objectives -Can be applied to technologies,\nservices, personnel and associated processes\n4.2 Information Security Risk Register\nRisks identified from the varying risk management approaches shall be recorded in a\nsuitable information security risk register. The CIST shall maintain a central register on\nbehalf of the University, to support the uniform recording of risks and management\nreporting.\nPROTECT Page 5 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 6 of 15\nAs a minimum the following information shall be recorded for each risk:\n• Unique risk number or identifier\n• Date risk identified\n• Asset(s) at risk\n• Identified threat and vulnerability\n• Risk scenario treatment option\n• Risk owner or person accepting risk, e.g. Service Owner or Head of House/Department\n• Identified risk treatment plan (RTP) or controls identified to mitigate risk\n• Identified residual risk(s)\n• Date risk last reviewed\n• Risk closure date\n4.3 Standard risk assessment\n4.3.1 Risk scenario elements\nThe standard risk assessment utilises the formula built into the Verinice1 tool and is aligned\nto ISO 27001/27002 and 270005 which provides good practice methodology for information\nsecurity management, controls and risk analysis - based on the Confidentiality, Integrity and\nAvailability (CIA) of assets.\nThe definitions for CIA are:\n• Confidentiality - property that information is not made available or disclosed\nto unauthorised individuals, entities, or processes\n• Integrity - property of accuracy and\ncompleteness\nAsset\n• Availability - property of being accessible\nand usable upon demand by an\nauthorised entity\nThe standard risk assessment approach is risk scenario\nbased. Risk scenarios are built by considering three Threat Vulnerability\nelements:\n• Asset\n• Vulnerability (ease of exploitation)\n1 Verinice is a tool for managing information security and supports performing risk analysis based on ISO 27005;\nPROTECT Page 6 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 7 of 15\n• Threat (likelihood of threat occurrence)\nFor example: unauthorised access (threat) by a hacker on a web server (asset) that is not\nadequately patched (vulnerability). To support consistency of results and uniformity, the\nrisk scenario shall utilise a common set of vulnerabilities and threats adapted from ISO\n27005:2011 Information security risk management.\n4.3.2 Deriving the risk CIA score\nThe risk analysis within Verinice requires the following scoring:\n• Individual assets are scored for each CIA element, i.e. Low = 0, Medium = 1\nand High = 2.\n• Individual vulnerabilities are scored Very low = 0, Low = 1, Medium = 2 or\nHigh =3.\n• Individual threats are scored Rare = 0, Annual = 1, Monthly = 2 or Weekly =3.\nOnce a vulnerability and threat has been associated with an asset, a risk analysis can be run\nwithin Verinice to derive the risk score for an asset. Each asset will have a derived risk score\nfor CIA from adding the vulnerability and threat score to the original asset CIA score.\nFor example: Asset CIA is Low, High, Medium (0, 2, 1) and vulnerability is Medium (2) and\nthreat score is Weekly (3), then the derived risk CIA score for the asset is 5,7,6.\nWhen summed the derived risk score will provide a numerical score between 0 and 24. Risk\nacceptance criteria and associated risk decision options have been set for these scores.\nThese scores can then be aligned to the university risk management policy and scoring\nsystem for strategic risk reporting – and sitting behind these score are the CIST detailed\nscoring.\n4.3.3 Risk scenario treatment options\nThe next step is to cross reference the risk score against the risk score matrix to identify one\nof the following risk scenario treatment options:\n• Accept - a justifiable decision by the risk owner to accept and not implement\na risk treatment plan to mitigate the risk.\n• Avoid - typically involves either removing the asset, or changing or\nterminating the associated asset processes to avoid the risk.\n• Reduce - implementation of a risk treatment plan to lower the residual risk\nto an acceptable level.\nPROTECT Page 7 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 8 of 15\n• Transfer – the risk is shared with another party that can most effectively\nmanage the particular risk depending on risk evaluation.\nThe option to accept a risk shall be evaluated and periodically reviewed by the Cyber &\nInformation Security Team to ensure the original decision remains justifiable.\n4.3.4 Risk treatment plans and controls\nIf the risk scenario treatment option is to avoid, reduce or transfer, then a risk treatment\nplan (RTP) shall be documented and communicated to the appropriate risk owner for\napproval and, where applicable, implementation.\nThe mitigating controls identified within the RTP shall be based on controls stated in ISO\n27002 – Code of practice for information security, although where applicable, other security\ncontrols can be used.\n4.3.5 Risk owners\nFor each risk scenario a risk owner shall be identified and recorded in the information\nsecurity risk register. The risk owner shall be the person or entity with the accountability\nand authority to manage a risk. Risk owners are usually the asset or service owner, Heads of\nDepartment or Dean / Director. Additionally there may be more than one risk owner.\n4.3.6 Residual risks\nResidual risk is the risk that remains after the risk treatment. Where applicable, residual\nrisks shall be treated as a new risk scenario and be assessed accordingly.\n4.4 Third Party Security Assessment (TPSA)\nThe Third Party Security Assessment (TPSA) is used to assess the security controls of third\nparties who will be processing University information as part of a contractual service or\nformal agreement. The TPSA is aligned to the control areas within ISO 27002 – Code of\npractice for information security. The TPSA control areas map to the headings used in the\nSecurity Schedule Template. Where applicable the Security Schedule Template shall be\nnegotiated, agreed and included as an appendix within the overall contractual arrangement\nwith relevant third parties.\n4.5 Cloud Security Checklist\nThe Cloud Security Checklist is typically used to check whether a cloud service provider’s\nPROTECT Page 8 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 9 of 15\nstandard terms and conditions or service level agreements contain adequate security\ncontrols to protect University information.\n4.6 Data Protection Impact Assessment (DPIA)\nA Data Protection Impact Assessment (DPIA) is a process which helps the University to\nidentify and reduce privacy risks that may exist within an information processing activity,\ne.g. business process, project, technology or service. A DPIA enables the University to\nsystematically analyse how a particular information processing activity will impact personal\ninformation and ensure that any processing is compliant with the General Data Protection\nRegulation. (GDPR).\nThe University’s Governance, Information, and Legal Office provide services to enable\ncompliance with risks relating to the DPA, personal information and privacy.\n4.7 Business impact analysis (BIA)\nThe business impact analysis (BIA) is a process for assessing the impacts of disrupting\nactivities on University business processes, people, technologies and services. The BIA shall\ninclude the following:\n• identifying critical activities that support the day- to- day operations of the\nUniversity;\n• assessing the impacts over time of not performing these activities;;\n• setting prioritised timeframes for resuming these activities at a specified\nminimum acceptable level, taking into consideration the time within which\nthe impacts of not resuming them would become unacceptable;; and\n• identifying dependencies and supporting resources for these activities,\nincluding suppliers, outsource partners and other relevant interested parties.\nThe output from a BIA supports the development of business continuity plans.\nIndividual departments and colleges are responsible for the development and maintenance\nof fit for purpose business continuity plans.\n5. Scoring Tables\nAsset scoring tables and risk scoring tables can be seen at Annex A, alongside acceptance\ncriteria scoring and a list of ISO 27005 derived vulnerabilities.\n-End-\nPROTECT Page 9 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 10 of 15\nAnnex A\nScoring Tables\nAsset CIA scores and definitions\nConfidentiality Integrity Availability\n0 Low Information can be disclosed Information can be modified No requirement to have\nto any individual, entity, or by all individuals, entities continuous access to\nprocess. and processes. information.\n1 Medium Information is not public and Information can be modified Short periods of information\navailable to a group of by a set of authorised unavailability are tolerable\nauthorised individuals, individuals, entities and but normally authorised\nentities and processes. processes. individuals, entities and\nprocesses require access.\n2 High Information can only be Information can only be Information must be\ndisclosed to a privileged modified by the owner or a accessible to authorised\ngroup of authorised privileged group of individuals, entities and\nindividuals, entities and authorised individuals, processes at all times.\nprocesses. entities and processes.\nVulnerability level scores\nValue Explanation Example\n0 Very low Vulnerability nearly impossible to exploit\n1 Low Vulnerability difficult to exploit and requires high level knowledge of asset\n2 Medium Vulnerability can be exploited with moderate knowledge of asset\n3 High Vulnerability can be easily exploited by any one\nThreat likelihood scores\nValue Explanation Example\n0 Rare Has not previously occurred in the last 2 years\nPROTECT Page 10 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 11 of 15\n1 Annual Occurs once a year\n2 Monthly Occurs once a month\n3 Weekly Occurs once a week\nRisk scores for CIA\nVulnerability Threat C confidentiality Integrity Availabilityy\nlevel Likelihood\nL M H L M H L M H\nRare 0 1 2 0 1 2 0 1 2\nAnnual 1 2 3 1 2 3 1 2 3\nVery low\nMonthly 2 3 4 2 3 4 2 3 4\nWeekly 3 4 5 3 4 5 3 4 5\nRare 1 2 3 1 2 3 1 2 3\nAnnual 2 3 4 2 3 4 2 3 4\nLow\nMonthly 3 4 5 3 4 5 3 4 5\nWeekly 4 5 6 4 5 6 4 5 6\nRare 2 3 4 2 3 4 2 3 4\nAnnual 3 4 5 3 4 5 3 4 5\nMedium\nMonthly 4 5 6 4 5 6 4 5 6\nWeekly 5 6 7 5 6 7 5 6 7\nRare 3 4 5 3 4 5 3 4 5\nAnnual 4 5 6 4 5 6 4 5 6\nHigh\nMonthly 5 6 7 5 6 7 5 6 7\nWeekly 6 7 8 6 7 8 6 7 8\nAcceptance criteria for summed CIA scores\nRange Acceptance Criteria\nLow : Risk Score Within this range accepting the risk scenario without implementing controls may be\nbetween 0 and 8 considered. Before accepting a risk scenario, careful consideration shall be given to\nindividual asset CIA , scores. A decision to accept a risk scenario within this range\nshall be justifiable and recorded in the information security risk register.\nMedium : Risk Within this range it is advised the risk scenario is reduced by implementing applicable\nScore between 9 controls. If a decision is made to accept a risk scenario within this range then the\nand 12 reason shall be justifiable, recorded in the information security risk register and have a\ndesignated risk owner.\nHigh : Risk Score Within this range it is strongly advised the risk scenario is reduced by implementing\nbetween 13 and applicable controls. If a decision is made to accept a risk scenario within this range\n18 then the reason shall be justifiable, recorded in the information security risk register and\nhave a designated risk owner.\nCritical - Risk Within this range a risk scenario should not be accepted.\nScore between 19\nand 24\nPROTECT Page 11 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 12 of 15\nRisk decision option definitions\nAccept A justifiable decision by the asset/risk owner to accept and not implement a risk treatment plan\nto mitigate the risk.\nAvoid Typically involves either removing the asset, or changing or terminating the associated asset\nprocesses to avoid the risk.\nReduce Implementation of a risk treatment plan to lower the likelihood and/or impacts if a risk scenario\noccurred.\nTransfer The risk is shared with another party that can most effectively manage the particular risk\ndepending on risk evaluation.\nVulnerabilities and threats\nFrom ISO 27005: Information security risk management\nType Examples of vulnerabilities Examples of threats\nBreach of information system\nHardware Insufficient maintenance/faulty installation of storage media maintainability\nHardware Lack of periodic replacement schemes Destruction of equipment or\nmedia\nHardware Susceptibility to humidity, dust, soiling Dust, corrosion, freezing\nHardware Sensitivity to electromagnetic radiation Electromagnetic radiation\nHardware Lack of efficient configuration change control Error in use\nHardware Susceptibility to voltage variations Loss of power supply\nHardware Susceptibility to temperature variations Meteorological phenomenon\nHardware Unprotected storage Theft of media or documents\nHardware Lack of care at disposal Theft of media or documents\nHardware Uncontrolled copying Theft of media or documents\nSoftware No or insufficient software testing Abuse of rights\nSoftware Well- known flaws in the software Abuse of rights\nSoftware No 'logout' when leaving the workstation Abuse of rights\nSoftware Disposal or reuse of storage media without proper erasure Abuse of rights\nSoftware Lack of audit trail Abuse of rights\nSoftware Wrong allocation of access rights Abuse of rights\nSoftware Widely- distributed software Corruption of data\nSoftware Applying application programs to the wrong data in terms of Corruption of data\ntime\nSoftware Complicated user interface Error in use\nSoftware Lack of documentation Error in use\nPROTECT Page 12 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 13 of 15\nSoftware Incorrect parameter set up Error in use\nSoftware Incorrect dates Error in use\nLack of identification and authentication mechanisms like user\nNetwork authentication Forging of rights\nNetwork Unprotected password tables Forging of rights\nNetwork Poor password management Forging of rights\nNetwork Unnecessary services enabled Illegal processing of data\nNetwork Immature or new software Software malfunction\nNetwork Unclear or incomplete specifications for developers Software malfunction\nNetwork Lack of effective change control Software malfunction\nNetwork Uncontrolled downloading and use of software Tampering with software\nNetwork Lack of back- up copies Tampering with software\nNetwork Lack of physical protection of the building, doors and windows T heft of media or documents\nNetwork Failure to produce management reports Unauthorised use of\nequipment\nNetwork Lack of proof of sending or receiving a message Denial of actions\nNetwork Unprotected communication lines Eavesdropping\nNetwork Unprotected sensitive traffic Eavesdropping\nFailure of telecommunication\nNetwork Poor joint cabling equipment\nFailure of telecommunication\nNetwork Single point of failure equipment\nNetwork Lack of identification and authentication of sender and receiver F orging of rights\nNetwork Insecure network architecture Remote spying\nNetwork Transfer of passwords in clear Remote spying\nSaturation of the information\nNetwork Inadequate network management (resilience of routing) system\nNetwork Unprotected public network connections Unauthorised use of\nequipment\nPersonnel Absence of personnel Breach of personnel availability\nPersonnel Inadequate recruitment procedures Destruction of equipment or\nmedia\nPersonnel Insufficient security training Error in use\nPersonnel Incorrect use of software and hardware Error in use Error in use\nPersonnel Lack of security awareness Error in use Error in use\nPersonnel Lack of monitoring mechanisms Illegal processing of data\nPersonnel Unsupervised work by outside or cleaning Theft of media or documents\nLack of policies for the correct use of telecommunications Unauthorised use of\nPersonnel media and messaging equipment\nInadequate or careless use of physical access control to Destruction of equipment or\nSite buildings and rooms media\nSite Location in an area susceptible to flood Flood\nSite Unstable power grid Loss of power supply\nSite Lack of physical protection of the building, doors and windows Theft of equipment\nOrganisation Lack of formal procedure for user registration and de- Abuse of rights\nregistration\nPROTECT Page 13 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 14 of 15\nOrganisation Lack of formal process for access right review (supervision) Abuse of rights\nLack or insufficient provisions (concerning security) in contracts\nOrganisation with customers and/or third parties Abuse of rights\nOrganisation Lack of procedure of monitoring of information processing Abuse of rights\nfacilities\nOrganisation Lack of regular audits (supervision) Abuse of rights\nOrganisation Lack of procedures of risk identification and assessment Abuse of rights\nOrganisation Lack of fault reports recorded in administrator and operator Abuse of rights\nlogs\nBreach of information system\nOrganisation Inadequate service maintenance response maintainability\nBreach of information system\nOrganisation Lack or insufficient Service Level Agreement maintainability\nBreach of information system\nOrganisation Lack of change control procedure maintainability\nOrganisation Lack of formal procedure for ISMS documentation control Corruption of data\nOrganisation Lack of formal procedure for ISMS record supervision Corruption of data\nLack of formal process for authorisation of public available Data from untrustworthy\nOrganisation information sources\nOrganisation Lack of proper allocation of information security responsibilities Denial of actions\nOrganisation Lack of continuity plans Equipment failure\nOrganisation Lack of e- mail usage policy Error in use\nLack of procedures for introducing software into operational\nOrganisation systems Error in use\nOrganisation Lack of records in administrator and operator logs Error in use\nOrganisation Lack of procedures for classified information handling Error in use\nOrganisation Lack of information security responsibilities in job descriptions Error in use\nLack or insufficient provisions (concerning information security)\nOrganisation in contracts with employees Illegal processing of data\nLack of defined disciplinary process in case of information\nOrganisation security incident Theft of equipment\nOrganisation Lack of formal policy on mobile computer usage Theft of equipment\nOrganisation Lack of control of off- premise assets Theft of equipment\nOrganisation Lack or insufficient 'clear desk and clear screen' policy Theft of media or documents\nOrganisation Lack of information processing facilities authorisation Theft of media or documents\nOrganisation Lack of established monitoring mechanisms for security Theft of media or documents\nbreaches\nOrganisation Lack of regular management reviews Unauthorised use of\nequipment\nOrganisation Lack of procedures for reporting security weaknesses Unauthorised use of\nequipment\nLack of procedures of provisions compliance with intellectual Use of counterfeit or copied\nOrganisation rights software\nPROTECT Page 14 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 15 of 15\nPROTECT Page 15 of 15"
          },
          "007_POL-05.1-POLICY-Information-Security-Policy.pdf": {
            "pages": 2,
            "text_length": 3899,
            "content": "Document Control\nReference: POL 05.1\nIssue No: 2\nIssue Date: 01/08/2020\nPage: 1 of 2\nINFORMATION SECURITY POLICY\nIntroduction\nThe Information Security Policy (ISP) details the principles and objectives that Brunel University\nLondon adopts in regard to Cyber and Information Security.\nPurpose\nThe purpose of the Information Security Policy is to protect the Brunel University London and\nboth our academics’ and students’ Information Assets and Services from all threats, whether\ninternal or external, deliberate or accidental.\nScope\nThis policy applies to Brunel University London at Kingston Lane, Uxbridge and all associated sites;\n• all individuals who have access to University information and technologies;\n• all facilities, technologies and services that are used to process University information;\n• all information processed, in any format, by the University pursuant to its operational\nactivities;\n• internal and external processes used to process University information; and\n• third parties ...",
            "full_content": "Document Control\nReference: POL 05.1\nIssue No: 2\nIssue Date: 01/08/2020\nPage: 1 of 2\nINFORMATION SECURITY POLICY\nIntroduction\nThe Information Security Policy (ISP) details the principles and objectives that Brunel University\nLondon adopts in regard to Cyber and Information Security.\nPurpose\nThe purpose of the Information Security Policy is to protect the Brunel University London and\nboth our academics’ and students’ Information Assets and Services from all threats, whether\ninternal or external, deliberate or accidental.\nScope\nThis policy applies to Brunel University London at Kingston Lane, Uxbridge and all associated sites;\n• all individuals who have access to University information and technologies;\n• all facilities, technologies and services that are used to process University information;\n• all information processed, in any format, by the University pursuant to its operational\nactivities;\n• internal and external processes used to process University information; and\n• third parties that provide information processing services to the University.\nObjectives\nWe, the management of Brunel University London, are committed to ensuring that:\n• Brunel University will develop an Information Security framework aligned to university\nneeds in order to establish strategic security objectives and will review these on a regular\nbasis;\n• Brunel University will maintain an Information Security framework to preserve its\ncompetitive edge, educational excellence, cash-flow, data protection, customer\nconfidence and reputational image;\n• Brunel University will ensure that the individuals, roles, bodies and governing\nframeworks are in place to maintain security ownership and responsibilities;\n• Brunel University will continue to ensure that all authorised users can securely access\ninformation to perform their roles;\n• Brunel University will use a risk based approach to ensure that information assets are\nidentified and the confidentiality, integrity and availability are appropriately safeguarded\nby security controls;\nBrunel University Unclassified\nDocument Control\nReference: POL 05.1\nIssue No: 2\nIssue Date: 01/08/2020\nPage: 2 of 2\n• Brunel University will continue to comply with all relevant contractual, statutory and\nregulatory requirements that apply to information management;\n• Brunel University as a university entity can survive with minimal disruption in the event\nof an Information Security breach occurring;\n• Brunel University will treat all Personal Data as University Confidential;\n• Brunel University will comply with the requirements of ISO 27001 and the guidance\ncontained in ISO 27002 and maintain, as part of the overall Brunel University\nmanagement system, an Information Security management system approach;\n• Brunel University will ensure that all staff are aware of their responsibilities and\nobligations and are trained in how to respond in an Information Security scenario;\n• Brunel University will pass security requirements on to our suppliers and customers to\nensure consistency throughout the supply chain;\n• Brunel University will maintain a Cyber Security incident management process in order to\nhelp protect the confidentiality and integrity of its information assets;\nCompliance\nBrunel University will regularly conduct information security compliance and assurance activities\nand Penetration testing to ensure information security objectives are met.\nReview\nThe Information Security Policy and accompanying Information Security Management System\nDocumentation shall be reviewed and updated on an annual basis to ensure that they:\n• remain operationally fit for purpose;\n• reflect current technologies;\n• are aligned to industry best practice; and\n• support continued regulatory, contractual and legal compliance.\nProfessor Julia Buckingham,\nCBE, DSc, FRSB\nVice-Chancellor and President, 07/08/2019\nReviewed: 01/08/2020\nBrunel University Unclassified"
          }
        }
      },
      {
        "batch_number": 2,
        "timestamp": "2025-08-17T18:20:15.467419",
        "files": [
          "008_BUL-POL-6.1.2.1-ISMS-Information-Asset-Owners-Handbook.pdf",
          "009_BUL-POL-08-02-Information-Classification-v1.1.pdf",
          "010_BUL-POL-IRM02-Information-Risk-Management-Methodology-v1.1+(1).pdf",
          "011_BUL-POL-IRM01-Information-Risk-Management-Policy-v1.0.pdf"
        ],
        "total_pages": 54,
        "extracted_content": {
          "008_BUL-POL-6.1.2.1-ISMS-Information-Asset-Owners-Handbook.pdf": {
            "pages": 24,
            "text_length": 36268,
            "content": "Document Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 1 of 24\nBRUNEL UNIVERSITY\nINFORMATION SECURITY GOVERNANCE\nINFORMATION ASSET OWNERS\nHANDBOOK\nPROTECT Page 1 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 2 of 24\nInformation Security\nInformation Asset Owners\n(IAO) Handbook\nA university-wide information management and\nsecurity policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 2 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 3 of 24\nDocument History\nVersion Author Comments Date\nV 0.1 Michael Jenkins Initial Draft 09/08/2018\nV 0.2 Michael Jenkins Amended text and copy-edit by ML 18/02/2019\nV 1.0 Michael Jenkins Approved Document\nDocument Approval\nThe contents of this document are confide...",
            "full_content": "Document Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 1 of 24\nBRUNEL UNIVERSITY\nINFORMATION SECURITY GOVERNANCE\nINFORMATION ASSET OWNERS\nHANDBOOK\nPROTECT Page 1 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 2 of 24\nInformation Security\nInformation Asset Owners\n(IAO) Handbook\nA university-wide information management and\nsecurity policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 2 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 3 of 24\nDocument History\nVersion Author Comments Date\nV 0.1 Michael Jenkins Initial Draft 09/08/2018\nV 0.2 Michael Jenkins Amended text and copy-edit by ML 18/02/2019\nV 1.0 Michael Jenkins Approved Document\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG Jenkins P Kahkipuro\nDocument Owner: Michael Jenkins Document Approver: Pekka Kahkipuro\nChief Information Security Officer Chief Information Officer\nDocument Distribution\nName Title Version Date of Issue\nAll IAO’s and IAC’s\nDCO’s / DRO\nCOO\nCIO / SIRO\nCFO\nDPO\nPROTECT Page 3 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 4 of 24\nHandbook Contents\nHandbook Contents .............................................................................................................. 4\n1. Introduction .................................................................................................................... 5\n2. Purpose of the Handbook .............................................................................................. 5\n3. ISO 27001 Conformance 6\n4. Background .................................................................................................................... 6\n5. Principles ....................................................................................................................... 7\n6. Asset Management .................................................................................................... 8\n7. Information Asset Register ......................................................................................... 8\n8. Roles and Responsibilities.......................................................................................... 9\n9. Risks to be Managed ................................................................................................ 11\n10. Information Asset Administrators (IAA) ..................................................................... 11\n11. Annual Reporting ...................................................................................................... 13\n12. Guidance and Training ............................................................................................. 13\n13. Governance, Approval and Review .......................................................................... 13\nPROTECT Page 4 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 5 of 24\nPART 1 – BACKGROUND AND GOVERNANCE\n1. Introduction\nThe Information Asset Owner (IAO) is a university mandated role, aligned to the Information\nSecurity Management System. Individuals are appointed as IAO and are responsible for\nensuring that information assets are handled and managed appropriately. This means making\nsure that information assets are properly protected and that their value to the organisation\nis fully exploited.\nAn Information Asset Owner reports to the Senior Information Risk Owner (SIRO)1, who in\nturn reports to the Executive Board.\nThe role is a standard requirement of an ISO 27001 Information Security Management System\n(ISMS) and supports the provision of a common, consistent and unambiguous understanding\nof what information is held, how important it is, how sensitive it is, the risk to it, and who is\nresponsible for it.\n2. Purpose of the Handbook\nThis handbook sets out the university’s approach to managing and securing its information\nand data assets. It explains the concept of an ‘Information Asset’ and defines the role of the\n‘Information Asset Owner’ who is responsible for each Information Asset. This handbook also\nacts as a specific guide for the IAO and sets out the primary responsibilities of an IAO for the\nrisk and operational management of information assets including personal data and business\ncritical information held within a college or directorate.\nThe handbook also explains how IAOs will report on metrics to the SIRO throughout the\nreporting cycle.\nThe University’s Information Security Policy states that:\n“Brunel University London will maintain an Information Security Management\nSystem (ISMS) to preserve its competitive edge, educational excellence, cash-flow,\ndata protection, customer confidence and reputational image.\nBrunel University will ensure that the individuals, roles, bodies and governing\nframeworks are in place to maintain security ownership and responsibilities.”\n1 Chief Information Officer\nPROTECT Page 5 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 6 of 24\nA guiding principle of our Strategy document is that ‘All information and systems will have\nidentified owners.’ This document formally establishes the roles and responsibilities for\nIAOs within the University Information Security Management System framework.\n3. ISO 27001 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control SOA – Number A.6 – Organisation of Information Security\nNumber\nISO 27001:2013 Information Classification Objective\nConformance Control A.6.1.2 Information Security Roles and Responsibilities\n4. Background\nThe university holds a wealth of information. This information can be in different formats and\nheld in a variety of locations and systems. It is essential that the university understands the\ninformation it holds so that we can adequately manage and protect it.\nTo manage this information, the university needs to have Information Asset Registers (IAR)\nwhich are managed by Information Asset Owners. Information Asset Owners are senior\nmembers of staff who have been appointed to be responsible for one or more identified\ninformation asset(s). This person will be responsible for ensuring that the Information Asset\nis accurately stored and maintained on the Information Asset Register. The full university\nInformation Asset Register will be owned by the office of the Chief Information Officer (CIO).\nPerforming the role well brings significant benefits. It provides a common, consistent and\nunambiguous understanding of what information the university holds, how important it is,\nhow sensitive it is, how accurate it is, how reliant the university is on it, and who is responsible\nfor it.\nThe organisation of BUL Information Assurance is shown below:\nPROTECT Page 6 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 7 of 24\nV1.0\nUniversity Committees & Executive Board\nAsset\nOwners\nBusiness Units\nSIRO\nColleges Research Service GDPR\nDepts\nInformation Asset Owners Senio P r o In li f c o y r m & a C t o io m n p R li i a s n k c O e wner Data Protection\nOfficer\nInformation Asset Leads\nGeneral Data Protection\nRegulations\nRisk\nHead of Risk\nData Asset\nCustodians Cyber & Protection\nINFOSEC Strategic and\nIT Governance & operational risk\nCyber Security Technical Controls\nINFOSEC Risk Management, assurance, ISMS Framework & Head of Security &\nGovernance, Audits, Investigations, compliance Emergency Planning\nIT Teams Cyber and INFOSEC Team Information Exchange for Metrics\nPhysical Security,\nAudits, Investigations\nHead IT Infra & Ops Head Development\n& Apps CISO\nIT Governance, Policy & Cyber & INFOSEC Cyber & Reporting of Operational Risk\nSystems managements Controls INFOSEC\nManager\nBusiness Unit Heads of IT Cyber and Information Security Ops & Plans,\nProjects & Audits\nOrganisation of BUL\nCyber Security Cyber Security\nAuditor Officer Information\nInformation Asset Audits & Controls Advice\nSecurity Management System (ISMS)\n5. Principles\nThe IAO role is about managing information not systems.\nThe driver for establishing the role of the IAO within the ISMS is to ensure that information\nassets, whether personal data or business data, are identified and securely handled. This also\ninvolves making sure that they are used in the way that is required, for as long as required.\nThe IAO is responsible for ensuring that information is protected appropriately, and where\nthe information is shared, that proper confidentiality, integrity and availability safeguards\napply and are in place.\nThe IAO role is about providing information assurance and making sure that action is taken to\nsecure information assets, their movement and sharing is appropriately managed, and that\ncontracts are in place where they are shared with 3rd parties.\nPROTECT Page 7 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 8 of 24\nAn IAO can delegate responsibility to particular areas that can support the role but the IAO\nand SIRO retain the accountability for proper information management and handling.\n6. Asset Management\nAn information asset is a body of information, defined and managed as a single unit, so that\nit can be understood, shared, protected and exploited effectively. Information assets have\nrecognisable and manageable value, risk, content and lifecycles. They include physical and\ndigital assets and are recorded in an information asset register – held centrally within the\nISMS and locally within colleges and directorates.\nThe university SIRO will decide what information assets IAO’s are responsible for. This could\ncover both sensitive personal data and non-personal information that is critical to business.\nIt could be held in paper as well as electronic formats.\nWhen an IAO is appointed, performance metrics will be discussed and agreed. Some of\nthese will be directly related to the need to demonstrate compliance with mandatory\nrequirements, but others may be specific to colleges or directorates.\n7. Information Asset Register\nAn Information Asset Register (IAR) is a mechanism for understanding and managing the\nuniversity’s assets and the risks to them. The IAR should include links between the\ninformation assets, their business requirements or processes and any technical\ndependencies that there may be. An IAR is dynamic and should be consistently updated and\nimproved to ensure each business unit develops a ‘mature’ understanding of the\ninformation that it holds.\nThe Cyber & INFOSEC teams have developed a standardised asset register but general\ninformation on the types of assets and how to develop the registers can be seen at Annex A.\n–End Part 1-\nPROTECT Page 8 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 9 of 24\nPART 2 – IAO HANDBOOK AND ROLES\n8. Roles and Responsibilities\nSenior Information Risk Owner (SIRO) Information Asset Owners (IAO)\nThe Senior Information Risk Owner is a Chief The SIRO is supported by the BUL IAOs. The\nOfficer with allocated lead responsibility for the role of IAO is to understand what information\norganisation’s information risks and provides is held, what is added and what is removed,\nthe focus for management of information. The who has access and why in their own area. As a\nSIRO provides the Executive Board with result they are able to identify and address\nassurance that information risk is being risks to the information assets they ‘own’ and\nmanaged appropriately and effectively across to provide assurance to the SIRO on the\nthe organisation and for any services contracted security and use of the assets. The organisation\nby the organisation. has allocated this role to Directors and Senior\nDepartmental Heads and/or Managers for each\ncollege, institute or directorate.\nThe CIO undertakes the role of Senior Information Risk Owner (SIRO) for BUL. The SIRO’s\nresponsibilities can be summarised as:\n• Leading and fostering a culture that values, protects and uses information for the\nsuccess of the organisation and benefit of its clients and stakeholders.\n• Owning the organisation’s overall information risk policy and risk assessment processes\nand ensuring they are implemented consistently.\n• Advising the VC & COO or relevant accounting officer on the information risk aspects of\ninternal controls.\nInformation Asset Owners\nInformation Asset Owners (IAOs) are Directors and Heads of Departments responsible for\nthe protection of particular Information Assets2. IAOs may delegate information security\ntasks to managers or other individuals but remain accountable for the proper\nimplementation of the tasks.\n2 The named asset owners are aligned to the ISMS information asset registers that have been completed within\nBUL.\nPROTECT Page 9 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 10 of 24\nThe IAO is expected to understand the overall business goals of the university and how the\ninformation assets they own contribute to and affect these goals. The IAO should nominate\nat least one Information Lead to support the IAO on a day-to-date basis.\nIAOs are responsible for:\n• Leading and fostering a culture that values, protects and uses information for the good\nof the university.\n• Knowing what information the asset holds, and what information is transferred in or out\nof it and what systems it links to.\n• Knowing who has access and why, and ensuring that their use is monitored.\n• Understanding and addressing risks to the asset, providing assurance to the SIRO and\nensuring that any data loss incidents are reported and managed following BUL\nguidelines.\n• Ensuring compliance with BUL ISMS policies and all regulatory requirements as they\nrelate to the information assets.\n• The appropriate classification and protection of the information assets.\n• Ensuring all staff managing information assets are appropriately trained in managing,\nsecuring and accessing the assets.\n• Determining appropriate criteria for obtaining access to information assets3.\n• Authorising access to information assets in accordance with the classification and\nbusiness need.\n• Undertaking or commissioning information security risk assessments to ensure that the\ninformation security requirements are properly defined and documented.\n• Monitoring compliance with protection requirements affecting their assets.\n• Ensuring that contractual agreements exist for the transfer to, or processing by, any\nthird party.\nA number of senior staff will have de facto responsibility for the information assets under\ntheir control. For example, the HR Director will have responsibility for all the personnel\ninformation held within the organisation and will, in part, be responsible for determining\nhow it is used, accessed and stored.\nAn IAO will be required to consider the following questions:\n• Do I understand what information assets I am responsible for (including personal and\nnon-personal data) and has that understanding been properly documented within\nthe Information Asset Register (IAR) and shared with the SIRO and others who need\nthat information?\n• Have I assessed and logged information risks to those assets?\n• Do I have a plan for managing risks, and validating that security controls are in place?\n3 An IAO is accountable for who has access to information assets both internally and externally.\nPROTECT Page 10 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 11 of 24\n• Do my team(s) and third parties understand their roles and responsibilities in\nmanaging those risks and controls?\nThe SIRO, CISO, Cyber & INFOSEC team and Data Protection Officer are all organisational\nleads able to provide guidance support and advice in the management of information\nassets.\n9. Risks to be Managed\nAn Information Asset Owner shall need to assure against:\n• Inappropriate access to, or disclosure of, protectively marked or sensitive personal\ndata by staff, contractors and outsiders, whether accidental or deliberate\n• Inappropriate data sharing where too much or irrelevant data is shared internally, i.e.\na full list with all personal data is provided where only numbers of a specific category\nhave been requested.\n• Information loss, particularly during transfer or movement of information, or as a\nresult of business or regulatory change\n• Loss of ready access to information\n• Records management – that information assets are not retained for longer than\nrequired (either by law or for business need) as outlined in the corporate retention\nand disposal schedule.\n• Business continuity/disaster recovery – that the relevant personnel are aware of the\nagreed continuity and recovery for their services.\n• Loss of digital continuity – i.e. losing the ability to use information in the way required\nwhen required. By use we mean being able to find, open, work with, understand and\ntrust your information. The lifecycle of a piece of information – and how long you need\nto use and keep it – is often different to the lifecycle of the IT system that we have to\naccess and use it\n10. Information Asset Administrators (IAA)\nAn Information asset administrator (IAA) should understand the overall business goals of\nthe organisation and the importance of the information assets in supporting these goals.\nInformation asset administrators should understand the IAOs responsibilities and lead in\nensuring the methods outlined in Annex A are fully exploited to support delivery.\nPROTECT Page 11 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 12 of 24\nIAA’s will be expected to:\n• Review the IAR on a six-monthly basis and ensure that the IAR is maintained and\nupdated when new assets are created.\n• Ensure that retention periods for information are documented in the retention\nschedule. Arrange for documented audits to ensure that information is deleted in\naccordance with retention periods.\n• Ensure that decisions are clearly recorded against any information that is retained\nlonger than its agreed retention period.\n• Ensure that managers understand the importance of maintaining correct access\ncontrols of drives and systems.\n• Carry out regular audits of systems and drives to ensure correct access controls are\nmaintained.\n• Ensure that local information handling guidelines are in place where required and\nthat these refer to corporate guidance where appropriate.\n• Provide assurance to the IAO on a regular basis.\n• Attend training as required.\n-End Part 2-\nPROTECT Page 12 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 13 of 24\nPART 3 – REPORTING TO SIRO\n11. Annual Reporting\nIAOs will be required to provide bi-annual assurance on the following areas to the SIRO.\nThis report will be presented to Executive Board and can be seen at Annex B. It will\ninclude reporting that:\n• Local procedures governing the use of data are in place and updated when required.\n• Access control measures are in place for systems, which includes how access is\ngranted and removed for users.\n• Updates on data flows (links to other systems) and reasons are provided.\n• Action following security incidents are monitored and updated.\n• Any records management responsibilities are captured (for example, the retention\nschedule is reviewed annually and that any system(s) used to store information have\nbeen reviewed to ensure retention is reflected.)\n• Contracts with data processers have the agreed information security and GDPR\nclauses and compliance with these are monitored. 4\n• Appropriate Information Sharing Agreements are in place and reviewed where\nrequired.\n• Actions identified during audits are captured in the IAR where required.\n12. Guidance and Training\nAll IAOs and Information Asset Administrators will receive the relevant baseline and on the\njob training to be able to undertake the roles and responsibilities. A specific IAO guidance\nshall be available to support the day-to-day management and security of the information\nassets under ownership.\n13. Governance, Approval and Review\nThis policy and the university’s commitment to a robust information assurance framework\nare subject to continuous, systematic review and improvement. This university-wide policy\noperates as part of the ISMS and shall be governed by the Information subcommittee.\n-End\n4 Clauses will be developed and agreed by the DPO. Additionally the DPO is the person who will draft and\nreview any data-sharing agreements.\nPROTECT Page 13 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 14 of 24\nPROTECT Page 14 of 24\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 15 of 24\nAppendix 1 Bi-Annual Reporting Template\nINFORMATION ASSET OWNERS (IAO) - BI-ANNUAL KPI REPORT TO SIRO An ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and Information Security Best Practice\n01 January 2019\nISMS Ref Type Metrics 18/19 19/20 Notes Measurements and objectives\nMANAGEMENT CONTROLS\nClause 4ISMS SECURITY POLICIES Trend & Status QTY Details Measurements and objectives\nCOMPLIANCE TO ISMS POLICY # of spot checks and audits in the year.\nINTERNAL IAO AUDITS COMPLETED - Business unit At least 2 audits.\nA.15 TRAINING & AWARENESS Effective Security awarness training set against policy\nMandatory training\nPERCENTAGE OF STAFF TRAINED ON DATA PROTECTION\nPERCENTAGE OF STAFF TRAINED ON INFOSEC\nA.7 ASSET MANAGEMENT\nASSET INVENTORY COMPLETION\nASSET CLASSIFICATION COMPLETION\nNEW ASSETS ADDED THIS PERIOD\nNEW DATA FLOWS COMPLETED THIS PERIOD\nASSET INVENTORY ADJUSTMENT - By Audit\nOPERATIONAL CONTROLS\nA.13 INCIDENT MANAGEMENT This Period To ensure information security events and weaknesses\nassociated with information systems are communicated\nDATA PROTECTION INCIDENTS\nINFORMATION SECURITY INCIDENTS Number of security breaches reduced on a year by year\nCYBER FRAUD INCIDENTS basis\nPHISHING / MALWARE INCIDENTS\nCOMPROMISED ACCOUNTS\nCYBER INVESTIGATIONS\nA.12 TECHNICAL VULNERABILITIES From pen tests & data custodians\nFor servers where data resides\nHigh\nMedium\nLow\nA.12 PATCHING LATENCY From data custodians\nCSIRT\nA.13 COPYRIGHT BREACHES\nA.13 SECURITY REMEDIATION\nCLOUD CONTROLS\nData sets in cloud environments\nCloud occurences or incidents\nBUSINESS RISK PROCESSES\nCONTRACTS WITH 3RD PARTY PROVIDERS FOR DATA\nClause 8RISK REGISTER ENTRIES Control objectives shall be selected and implemented to\nmeet the requirements identified by the risk assessment\nTREATMENT PLANS PROTECT Risk Treatment is one of the principle objectives of\nInfoSec and therefore measuring the effectiveness will\nNEW RISKS IDENTIFIED Number of new threats and risks identified compared to\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 16 of 24\nAppendix 2\nList of IAOs and IAC’s\nDirectorate, College, Dept Information Asset Owner IS Information Asset Custodian\nCustomer Relationship Managers\nPILOT BUSINESS UNITS (2019)\nGLASS – Business Support JILLY COURT SENANI THOTABADUGE\nand SITS\nCHLS – CLINICAL SCIENCES MIKE KEIGHLEY ALAN CHARIE\nCOMMERCIAL SERVICES PETER BENT ALAN CHARIE\nHUMAN RESOURCES GEMMA BAILEY ALAN CHARIE\nFINANCE JAMES HOBSON ALAN CHARIE\nNEW 2020 BUSINESS UNITS\nSTRATEGIC PLANNING ROSA SCOBLE SENANI THOTABADUGE OR\nALAN CHARIE (As appropriate)\nINFORMATION SERVICES IAIN LIDDELL SENANI THOTABADUGE OR\nALAN CHARIE (As appropriate)\nESTATES AKINTOYE OLUWATUDIMU SENANI THOTABADUGE OR\nALAN CHARIE (As appropriate)\nCEDPS PAUL WORTHINGTON SENANI THOTABADUGE OR\nALAN CHARIE (As appropriate)\nJILLY COURT SENANI THOTABADUGE OR\nSTUDENT SERVICES\nALAN CHARIE (As appropriate)\nRSDO THERESA WALLER SENANI THOTABADUGE OR\nALAN CHARIE (As appropriate)\nREGISTRY & LEGAL JILLY COURT SENANI THOTABADUGE OR\nALAN CHARIE (As appropriate)\nPROCUREMENT IAIN WILCOCKS SENANI THOTABADUGE OR\nALAN CHARIE (As appropriate)\nPROTECT\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 17 of 24\nAppendix 3\nIAO Works Programmes\nAnnual Tasks\nTask Start Date Finish Action\nDate\n2018/19\nInformation Asset Register To be submitted as part of the\nRecord of Processing Activity (ROPA) Information assurance evidence.\nData Flow Mapping Exercise To be submitted as part of the\nInformation assurance evidence.\nAnnual INFOSEC & Data All staff to complete mandatory training\nProtection training\nConfidentiality and Safe Haven Audit To be submitted as part of the\nInformation assurance evidence.\nPractice should be on-going\nINFOSEC Spot Check and Record Keeping To be submitted as part of the\nAudit Information assurance evidence.\nPractice should be on-going\nImplement Local Induction for New On-going as and when new starters arrive.\nStaff\nReporting Incidents and Breaches. On-going as required. Report to INFOSEC & DP team as and\nwhen events occur.\nResponding to Subject Access On-going as required to support the data protection officer.\nRequests.\nInformation Sharing Protocols & contracts On-going. Ensure IAOs & Project Leads are aware of the\nInformation Sharing requirements & contracts clauses required to\nprotect data and consult with the DPO\nPrivacy Impact Assessments On-going. Ensure IAOs & Project Leads are aware of the DPIA\ntemplate and consult with the data protection officer in relation\nto new or existing projects.\nPROTECT\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 18 of 24\nFAQs\nInformation Assets and Information Asset Register (IAR)\nSubject Heading Definition and Actions needed to complete the audit process\nKeeping an information asset register will enable you to understand\nwhat information assets are held and how they support operations\nwithin your team.\nWhat is an Information\nAsset Register (IAR) and It will help you undertake the ‘data mapping’ task, as well as, prevent\nwhy is it completed?? loss of information and data breaches. It will also help colleagues locate\ninformation for Freedom of Information requests in a timely manner.\nAll information assets will be ‘owned’ by your team’s IAO.\nIAOs are required to identify and record information assets within the\ninformation asset register template provided. This practice is used to:\nWhy is an audit of the • ensure that the information assets within BUL are managed\nassets undertaken? effectively\n• Identify potential issues\n• protect and keep the asset secure.\nData Flow Mapping Exercise (DFM)\nSubject Heading Definition and Actions needed to complete the audit process\nIt is a legal requirement under the Data Protection Act 2018, that\nWhy do we complete the organisations must ensure that measures are embedded to avoid\nData Flow mapping unauthorised and unlawful or accidental:\nprocess? • access\n• transfer\n• processing of\n• loss and destruction of\n• damage to personal data, including special category personal data\nAll questions on the template will need to be answered for each data flow\nprocess\nHow does the DFM\nexercise produce the\nOnce completed any information flows rated as ‘red’ or ‘amber’ risk will\noutcomes to inform the\nbe reviewed by the IAO with support from the DP & INFOSEC Team or\nrisks?\nfollowed up via the BUL INFOSEC risk management process.\nPROTECT\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 19 of 24\n• Identifies all transfers of information and also enables the DPO to\nidentify potential issues which may require further assessment.\nWhat information is • Will determine where, why, how and with whom the\nincluded in this process? organisation exchanges information.\n• Record inbound and outbound information flows within the data\nflow mapping register:\nReporting Incidents & Breaches\nSubject Heading Definition and Actions needed to complete the process\nWho should be notified of The DPO and INFOSEC team should be notified, as they will then\nany data incidents or inform the SIRO\nbreaches?\nWhat type of incident Incidents that relate to loss or compromise of data, Cyber and Data\nshould be reported? Protection Act breaches.\nHow do I get further For further guidance on reporting INFOSEC and DP incidents please\ninformation? refer to the cyber 365 intranet and data protection pages.\nHow do I encourage Provide them with sufficient information to understand how reporting\ncolleagues to report incidents will improve working practices, protect BUL IP and special\nincidents? category data, and reduce complaints.\nInformation Sharing Protocols/Agreements\nSubject Heading Definition and Actions needed to complete the process\nIt is important to ensure that there is a balance between sharing\ninformation with other organisations for the purposes of operational and\nstrategic business and keeping information secure and confidential.\nWhat are information\nsharing\nThe organisation needs to ensure that mechanisms are in place to\nprotocols/agreements?\nenable reliable and secure exchange of data within the constraints of the\nlaw, relevant guidance and service specific requirements.\nPROTECT\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 20 of 24\nBUL uses information sharing protocols to put in place an agreement\nbetween parties to document:\n• The purpose for sharing the information\n• Who the information will be shared with\nWhy does the organisation\n• Structures for sharing information\nneed to use them?\n• Legislation and regulations which must be adhered to\n• Conditions of processing our data and INFOSEC standards\nrequired\nFrom the work undertaken for the Information Asset register and the\nData Flow Mapping exercise, IAOs should ensure that information\nsharing protocols are in place for outbound information flows.\nHow will this area of work\nhelp me with my IAO IAO’s are also required to carry out assessments on the information\nrole? flows between the organisation and its partners, and as a result complete\nand embed a local Information Sharing Service Agreement.\nThe DPO & INFOSEC teams will support and advise on these processes.\nInformation Sharing protocols and data processing templates and\nguidance are available from the DPO and CISO teams.\nWhere can I obtain the\nprotocol/agreement The information sharing agreements once completed will need to be\ntemplates? signed off by the DPO, SIRO and Legal teams\nData Protection Impact Assessments (DPIA’s)\nSubject Heading Definition and Actions needed to complete the process\nA DPIA is a document that identifies the risk elements of a project and/or\nWhat is a Data process. Guidance for the Introduction of New Processes for DPIAs can\nProtection Impact be found on the DPO intranet page. It is used for all new projects\nAssessment (DPIA)? and changes to existing ones to assess the risk to personal data.\nPROTECT\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 21 of 24\nIAOs are pivotal to the roll out of the BUL Information Assurance\nagenda and ensuring partner organisations handle information in a\nsecure and appropriate manner. As part of this framework, we ask to\nsupport and encourage colleagues to consider risk implications to\nWhy is a DPIA required? personal data when starting new projects and programmes, and effecting\nchanges to existing systems and processes. This is now a legal\nrequirement under DP Act 2018 and the GDPR.\nEnsure that you involve the DPO team during the project/programme\ninitiation stage.\nIdentifying risk to personal data at an early stage will ensure;\n• compliant operations\n• necessary information sharing protocols in place\n• the organisation is aware of and can effectively monitor data\nWhat are the benefits of\nidentifying and introducing and its processing\na DPIA • they are added to the Information Asset register\n• that System Level Security Polices are initiated where appropriate\nIt will also ensure BUL is compliant with the Data Protection Act 2018 and\nmitigate subsequent fines from the Information Commissioner’s Office.\nOnce the DPIA has been completed, the document is forwarded to the\nWhat is the process for\nDPO for approval and recommendations.\nDPIA approval?\nWhere can I obtain the The DPIA screening questionnaire can be obtained from the CISO\nDPIA template? and DPO.\nKey Definitions\nSubject Supporting information\nController the natural or legal person, public authority, agency or other body\nwhich, alone or jointly with others, determines the purposes and means\nof the processing of personal data\nProcessor a natural or legal person, public authority, agency or other body\nwhich processes personal data on behalf of the controller\nData Subject the identified or identifiable living individual to whom personal data\nrelates\nPersonal data any information relating to an identified or identifiable living individual\nPROTECT\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 22 of 24\nSpecial Category Personal data that contains details of the person’s:\npersonal data • racial or ethnic origin\n• political opinions\n(For this type of • religious or philosophical beliefs\ninformation even more\n• trade union membership\nstringent measures should\n• genetic data\nbe employed to ensure the\n• biometric data\ndata remains secure)\n• health data\n• sex life or sexual orientation\n• Criminal convictions.\nProcessing Any operation or set of operations which is performed on personal\ndata or on sets of personal data, whether or not by automated\n(in relation to personal means, such as:\ndata) • collection\n• recording\n• organization\n• structuring\n• storage\n• adaptation or alteration\n• retrieval\n• consultation\n• use\n• disclosure by transmission ,dissemination or otherwise making\navailable\n• alignment or combination\n• restriction\n• erasure\n• destruction\nPROTECT\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 23 of 24\nAppendix 4\nIdentifying an IAO\nAn IAO must have the power to make decisions about how Information Assets are managed. Therefore,\nthis role must be held by a senior member of staff. These posts will typically be assigned to Directors or\nHeads of Department.\nThe post holder must have the skills, resources and authority to discharge the responsibilities and take\naction on any deficiencies in the relevant processes.\nAll IAOs must attend IAO training provided by the university which will include onsite sessions in the initial\ncreation phase, followed by specific cyber security and data protection training sessions. IAOs must\nattend subsequent training where it is identified.\nIdentifying Information Assets\nAssessing every individual file, database entry or piece of information isn’t realistic - therefore the\nuniversity and its departments needs to group information into manageable portions, and classify the data\naccording to its value and sensitivity.\nTo assess whether something is an information asset, ask the following questions:\nValue: Does the information have a value to the organisation? How useful is it? Will it cost money to\nreacquire? Would there be legal, reputational or financial repercussions if you couldn’t produce it on\nrequest? Would it adversely impact operational efficiency if you could not access it easily? Would there\nbe consequences of not having it?\nRisk: Is there a risk associated with the information? Is there a risk of losing it? A risk that it is not\naccurate? A risk that someone may try to tamper with it? A risk arising from inappropriate disclosure?\nRetention: Does the group of information have a manageable lifecycle? Were all the components created\nfor a common purpose? Will they be disposed of in the same way and according to the same rules?\nPROTECT\nDocument Control\nReference: BUL-POL-6.1.2.1\nIssue No: 0.2 PROTECT\nIssue Date: 18/02/19\nPage: 24 of 24\nPROTECT"
          },
          "009_BUL-POL-08-02-Information-Classification-v1.1.pdf": {
            "pages": 6,
            "text_length": 9358,
            "content": "Document Control\nReference: BUL-POL-8.2\nIssue No: 4\nIssue Date: 01/09/2020\nPage: 1 of 6\nInformation Classification Policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nDipa Gorsia\nData Protection Officer\nProtect Page 1 of 6\nDocument Control\nReference: BUL-POL-8.2\nIssue No: 4\nIssue Date: 01/09/2020\nPage: 2 of 6\nDocument control\nVersion history\nVersion Author Date Comments\n0.1 Andrew Clarke 22 Nov 2016 First draft\n0.2 Andrew Clarke 21 Dec 2016 Revisions from Information Access Officer\n1.0 Andrew Clarke 06 Apr 2017 Approved - Exec\n1.1 Andrew Clarke 08 Oct 2019 DPO Amendment:3.4 Special Category Data always UC\n1.1 Andrew Clarke 01 Sep 2020 Annual Review\nDocument Approval\nThe contents of this document are classified as Protect to Brunel University London\n(BUL) information classification. Proprietary information presented in this document may\nnot be...",
            "full_content": "Document Control\nReference: BUL-POL-8.2\nIssue No: 4\nIssue Date: 01/09/2020\nPage: 1 of 6\nInformation Classification Policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nDipa Gorsia\nData Protection Officer\nProtect Page 1 of 6\nDocument Control\nReference: BUL-POL-8.2\nIssue No: 4\nIssue Date: 01/09/2020\nPage: 2 of 6\nDocument control\nVersion history\nVersion Author Date Comments\n0.1 Andrew Clarke 22 Nov 2016 First draft\n0.2 Andrew Clarke 21 Dec 2016 Revisions from Information Access Officer\n1.0 Andrew Clarke 06 Apr 2017 Approved - Exec\n1.1 Andrew Clarke 08 Oct 2019 DPO Amendment:3.4 Special Category Data always UC\n1.1 Andrew Clarke 01 Sep 2020 Annual Review\nDocument Approval\nThe contents of this document are classified as Protect to Brunel University London\n(BUL) information classification. Proprietary information presented in this document may\nnot be used without written consent from BUL and remains the exclusive property of\nBUL unless otherwise agreed to in writing.\nOwner: Michael Jenkins Chief Information Security Officer\nSignature: MGJ Date: 06 Apr 2017\nApprover: Pekka Kahkipuro Chief Information Officer\nSignature: PK Date: 06 Apr 2017\nDistribution:\nThis document requires the approval from BUL as defined in the ISMS Compliance\ndocument.\nProtect Page 2 of 6\nDocument Control\nReference: BUL-POL-8.2\nIssue No: 4\nIssue Date: 01/09/2020\nPage: 3 of 6\n1.0 About this document\n1.1 Purpose of Document\nThe University generates and holds a wide variety of information that must be protected against\nunauthorised access, disclosure, modification, or other misuse. Efficient management of such\nassets is also necessary in order to comply with legal and regulatory obligations such as the Data\nProtection Act, and to ensure efficient handling of Freedom of Information requests.\nDifferent types of information require different security measures and hence proper classification\nof information assets is vital to ensuring effective information security and management. This\nInformation Classification Policy is intended to help staff and students to determine what\ninformation can be disclosed to external parties, as well as the relative sensitivity of information\nthat should not be disclosed outside of the University without proper authorisation.\nThis policy, along with the BUL-PROC-8.02 Information Classification guidelines, assists all\nmembers of the University to ensure that correct classification and handling methods are applied\nduring their day-to-day activities and information is managed accordingly.\n• University information assets should be made available to all those who have a legitimate\nneed to access them;\n• The integrity of information must be maintained; information must be accurate, complete,\ntimely and consistent with other related information and events.\nPlease refer to BUL-GLOS-000 - SyOPs for the glossary of terms, acronyms and their definitions\nfor the suite of BUL ISMS documentations.\n1.2 Responsibilities\nTable 1 – responsibilities\nTitle / Role Description\nAsset Owners • Are responsible for determining the classification of\n(as identified by the their assets\nUniversity) • To ensure assets are correctly labelled and for any\nsteps necessary to ensure their correct handling in\nline with their classification.\n• Are responsible for appropriate delegation to\ncustodians\nCyber & Information • Is responsible for maintaining the inventory of assets\nSecurity Manager and services together with their classification levels\nSystems Manager • Is responsible for technical labelling mechanisms\nProtect Page 3 of 6\nDocument Control\nReference: BUL-POL-8.2\nIssue No: 4\nIssue Date: 01/09/2020\nPage: 4 of 6\nAll Managers • Are responsible for providing direction, as\nappropriate, on mail/postal services, voice mail and\nvoice communication, fax machines, photocopiers,\ncouriers, and sensitive documents for ensuring that\nthese media or information types are handled in line\nwith these requirements\nAll employees • Any user of University information assets (including\nmobile phones, laptops and/or other peripherals)\nmay have specific custodianship responsibilities\nidentified in their user agreements and have a\nresponsibility to adhere to this policy\nISO 27001 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control Number SOA – Number A8 – Asset management\nISO 27001:2013 Conformance Control Information Classification Objective\nA.8.2 - Information Classification\n1.3 Scope\nThis policy applies to:\n• All University data held on any medium, including all forms of hard copy and electronic\ndata.\n• All University Colleges, Research Institutes, Administrative and Service Departments.\n• All contractors, third party suppliers and external stakeholders.\nProtect Page 4 of 6\nDocument Control\nReference: BUL-POL-8.2\nIssue No: 4\nIssue Date: 01/09/2020\nPage: 5 of 6\n2.0 Classification Policy\n2.1\nThe University classifies information into three levels (University Confidential,\nProtect and Unclassified):\n• University Confidential must identify the individuals, roles, departments or\ncolleges to whom the information is restricted and is available only to those\nspecified and relevant members with authorisation (see BUL-POL-6.1.1 -\nInfoSec Roles);\nA breach of confidentiality could result in unacceptable damage with very\nserious and lasting consequences threatening the University or one of its\nactivities.\n• Protect is available to any authenticated member of the University. Typically,\nif this level of information was leaked outside of the University, it could be\ninappropriate or ill-timed.\n• Unclassified: available to any member of the public without restriction. This\ninformation, however, should not be placed into the public domain without\nreason, such as a request or promotional material.\n2.2\nIt is possible that we could receive information that is classified by Government or\nother institutions as Secret (HMG Information Security Classification April 2014).\nWe do not expect to classify any information generated at the University as secret.\nIt is reserved for information that could impact on National Security, potentially\ndestabilizing the UK or its allies, including information which is subject to the\nOfficial Secrets Act 1989. The information handling requirements associated with\nthis level will be dictated by the information owner on each occasion.\n2.3\nAll information held by or on behalf of the University will be categorised according\nto the Information Classification level (above).\n2.4\nThe information owner will assess the value, sensitivity and the risk of\nconfidentiality breach to their data set. Once the classification has been\nestablished any documents containing this information must be systematically\nmarked as such. It is recommended that each department or research group\nexplicitly identifies information owners. This however differs if you are including\nany Special Category Personal Data. Please refer to the Information Classification\nProcedure Paragraph 4.2 for further details.\n2.5\nAny information which is not explicitly marked will be classified as University\nConfidential, pending classification, by default to avoid data leakage. In the case\nof disagreement over the classification level to be used, the more secure level\nshould be adopted. Questions about the proper classification of a specific piece of\ninformation or a dataset should be addressed to your manager. Where there is a\nmix of information from different classification levels, the more secure level should\nbe adopted. Information that is sent externally must be marked with its\nclassification level unless already identified and marked as unclassified\nwhereupon no marking is required on the information distributed. All staff have a\nProtect Page 5 of 6\nDocument Control\nReference: BUL-POL-8.2\nIssue No: 4\nIssue Date: 01/09/2020\nPage: 6 of 6\nresponsibility for ensuring that any information sent externally, in any format or\nmedia, is correctly classified\n2.6\nAll information must be secured to meet the requirements of their respective\nclassification levels (as above). Guidance on the type of security controls that\nshould be implemented is available in the BUL-PROC-08.02 Information\nClassification.\n2.7\nThe classification must be included in the document footer, which must be\nmanually set to appear on all pages of the document, or on the media on which it\nis recorded.\n2.8\nInformation received from outside the University that is used within the ISMS scope\nmust be re-classified by its recipient so that, within the University, it complies with\nthis policy.\n2.9\nThe classification of information assets must be reviewed at least once a year by\nthe Asset Owners, and if the classification level can be reduced, it will be. The\nAsset Owner is responsible for de-classifying information.\n2.10\nAsset Owners may delegate ownership responsibility to specific individuals, and\nthis delegated responsibility is known as ‘custodianship’ (and the individuals\nconcerned are known as ‘custodians’).\n2.11\nWhere a third party will be responsible for handling the information on behalf of the\nUniversity, the third party shall be required by contract to adhere to this policy prior\nto the sharing of information.\nProtect Page 6 of 6"
          },
          "010_BUL-POL-IRM02-Information-Risk-Management-Methodology-v1.1+(1).pdf": {
            "pages": 15,
            "text_length": 24845,
            "content": "Document Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 1 of 15\nInformation Security\nRisk Management\nMethodology\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 1 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 2 of 15\nDocument History\nVersion Author Comments Date\nV 0.2 Mick Jenkins Draft 09/08/2017\nV1.0 Mick Jenkins First release\nV 1.1 Mick Jenkins Approved ISC 26/01/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG Jenkins\nDocument Owner: Michael Jen...",
            "full_content": "Document Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 1 of 15\nInformation Security\nRisk Management\nMethodology\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nPROTECT Page 1 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 2 of 15\nDocument History\nVersion Author Comments Date\nV 0.2 Mick Jenkins Draft 09/08/2017\nV1.0 Mick Jenkins First release\nV 1.1 Mick Jenkins Approved ISC 26/01/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG Jenkins\nDocument Owner: Michael Jenkins Document Approver: Pekka Kahkipuro\nChief Information Security Officer Chief Information Officer\nDocument Distribution\nName Title Version Date of Issue\nAll Directors for Cascade\nDCO’s / DRO\nCOO\nCIO\nCFO\nUniversity secretary\nPROTECT Page 2 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 3 of 15\nContents\n1. Purpose of Document .................................................................................................... 4\n3. Scope ............................................................................................................................ 5\n4. Information Risk Assessments ....................................................................................... 5\n5. Scoring Tables 6\nPROTECT Page 3 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 4 of 15\n1. Purpose of Document\nThis handbook states the risk management approaches the Cyber & Information Security\nTeam (CIST) will utilise to support the identification and management of information risks.\nThe approaches within this handbook are aligned with industry good practice, including:\n• ISO 27001: Information security management system – Requirements\n• ISO 27002: Code of practice for information security controls\n• ISO 27005: Information security risk management\n• ISO 31000: Risk management — Principles and guidelines\n• ISO 22301: Business continuity management systems – Requirements\n• Cloud Security Alliance: Security, Trust & Assurance Registry (STAR)\n• Information Commissioner’s Office: Privacy impact assessments code of Practice\nAdditionally the risk management approaches within this toolkit are aligned with the\nobjectives stated in the University’s Risk Management Policy.\nPlease refer to Brunel University London ISMS Document BUL-GLOS-000 - SyOPs Glossary of\nTerms for the glossary of terms, acronyms and their definitions for the suite of Brunel\nUniversity (BUL) London ISMS documentations.\nThe University’s Information Security Policy states that:\n“Brunel University London will maintain an Information Security Management\nSystem (ISMS) to preserve its competitive edge, educational excellence, cash-flow,\ndata protection, customer confidence and reputational image.\nBrunel University will use a risk based approach to ensure that information assets are\nidentified and the confidentiality, integrity and availability are appropriately\nsafeguarded by security controls.”\nThis document formally establishes these governing bodies and roles and responsibilities for\nthe University Information Security management and the ISMS framework.\n2. ISO 27005 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control 27005:2011 Information security risk management\nNumber\nPROTECT Page 4 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 5 of 15\nISO 27005:2011\nConformance Control\n3. Scope\nThe CIST shall utilise the risk management approaches stated within this handbook to identify\nvulnerabilities, threats and mitigating controls associated with University business processes,\npeople, technologies and services. This handbook and the supporting tools / resources can be\nadopted by any University department or college.\nThe Chief Information Security Officer (CISO) is the owner of this handbook and shall ensure\nthat it remains operationally fit for purpose and is appropriately communicated.\n4. Information Risk Assessments\n4.1 Types of risk assessments\nThe following risk management approaches will be capable of identifying the majority of\nknown information security vulnerabilities and threats that could impact the University.\nStandard Risk Used for generic asset based risk assessments,\nAssessment Risk mitigation based on industry good practice,\nCIA Approach e.g. ISO 27002\nThird Party Security Used to assess third parties who process\nUniversity information\nAssessment\nSupports procurement and legal due diligence\nCloud Security Used to identify risks posed by cloud service\nChecklist providers (CSP) – used in conjunction with TPSA\nData Protection Used to identify risks associated with processing\nImpact Assessment personal information - Can be applied to process,\ntechnologies or services\nBusiness Impact Used to identify recovery time / recovery point\nAssessment objectives -Can be applied to technologies,\nservices, personnel and associated processes\n4.2 Information Security Risk Register\nRisks identified from the varying risk management approaches shall be recorded in a\nsuitable information security risk register. The CIST shall maintain a central register on\nbehalf of the University, to support the uniform recording of risks and management\nreporting.\nPROTECT Page 5 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 6 of 15\nAs a minimum the following information shall be recorded for each risk:\n• Unique risk number or identifier\n• Date risk identified\n• Asset(s) at risk\n• Identified threat and vulnerability\n• Risk scenario treatment option\n• Risk owner or person accepting risk, e.g. Service Owner or Head of House/Department\n• Identified risk treatment plan (RTP) or controls identified to mitigate risk\n• Identified residual risk(s)\n• Date risk last reviewed\n• Risk closure date\n4.3 Standard risk assessment\n4.3.1 Risk scenario elements\nThe standard risk assessment utilises the formula built into the Verinice1 tool and is aligned\nto ISO 27001/27002 and 270005 which provides good practice methodology for information\nsecurity management, controls and risk analysis - based on the Confidentiality, Integrity and\nAvailability (CIA) of assets.\nThe definitions for CIA are:\n• Confidentiality - property that information is not made available or disclosed\nto unauthorised individuals, entities, or processes\n• Integrity - property of accuracy and\ncompleteness\nAsset\n• Availability - property of being accessible\nand usable upon demand by an\nauthorised entity\nThe standard risk assessment approach is risk scenario\nbased. Risk scenarios are built by considering three Threat Vulnerability\nelements:\n• Asset\n• Vulnerability (ease of exploitation)\n1 Verinice is a tool for managing information security and supports performing risk analysis based on ISO 27005;\nPROTECT Page 6 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 7 of 15\n• Threat (likelihood of threat occurrence)\nFor example: unauthorised access (threat) by a hacker on a web server (asset) that is not\nadequately patched (vulnerability). To support consistency of results and uniformity, the\nrisk scenario shall utilise a common set of vulnerabilities and threats adapted from ISO\n27005:2011 Information security risk management.\n4.3.2 Deriving the risk CIA score\nThe risk analysis within Verinice requires the following scoring:\n• Individual assets are scored for each CIA element, i.e. Low = 0, Medium = 1\nand High = 2.\n• Individual vulnerabilities are scored Very low = 0, Low = 1, Medium = 2 or\nHigh =3.\n• Individual threats are scored Rare = 0, Annual = 1, Monthly = 2 or Weekly =3.\nOnce a vulnerability and threat has been associated with an asset, a risk analysis can be run\nwithin Verinice to derive the risk score for an asset. Each asset will have a derived risk score\nfor CIA from adding the vulnerability and threat score to the original asset CIA score.\nFor example: Asset CIA is Low, High, Medium (0, 2, 1) and vulnerability is Medium (2) and\nthreat score is Weekly (3), then the derived risk CIA score for the asset is 5,7,6.\nWhen summed the derived risk score will provide a numerical score between 0 and 24. Risk\nacceptance criteria and associated risk decision options have been set for these scores.\nThese scores can then be aligned to the university risk management policy and scoring\nsystem for strategic risk reporting – and sitting behind these score are the CIST detailed\nscoring.\n4.3.3 Risk scenario treatment options\nThe next step is to cross reference the risk score against the risk score matrix to identify one\nof the following risk scenario treatment options:\n• Accept - a justifiable decision by the risk owner to accept and not implement\na risk treatment plan to mitigate the risk.\n• Avoid - typically involves either removing the asset, or changing or\nterminating the associated asset processes to avoid the risk.\n• Reduce - implementation of a risk treatment plan to lower the residual risk\nto an acceptable level.\nPROTECT Page 7 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 8 of 15\n• Transfer – the risk is shared with another party that can most effectively\nmanage the particular risk depending on risk evaluation.\nThe option to accept a risk shall be evaluated and periodically reviewed by the Cyber &\nInformation Security Team to ensure the original decision remains justifiable.\n4.3.4 Risk treatment plans and controls\nIf the risk scenario treatment option is to avoid, reduce or transfer, then a risk treatment\nplan (RTP) shall be documented and communicated to the appropriate risk owner for\napproval and, where applicable, implementation.\nThe mitigating controls identified within the RTP shall be based on controls stated in ISO\n27002 – Code of practice for information security, although where applicable, other security\ncontrols can be used.\n4.3.5 Risk owners\nFor each risk scenario a risk owner shall be identified and recorded in the information\nsecurity risk register. The risk owner shall be the person or entity with the accountability\nand authority to manage a risk. Risk owners are usually the asset or service owner, Heads of\nDepartment or Dean / Director. Additionally there may be more than one risk owner.\n4.3.6 Residual risks\nResidual risk is the risk that remains after the risk treatment. Where applicable, residual\nrisks shall be treated as a new risk scenario and be assessed accordingly.\n4.4 Third Party Security Assessment (TPSA)\nThe Third Party Security Assessment (TPSA) is used to assess the security controls of third\nparties who will be processing University information as part of a contractual service or\nformal agreement. The TPSA is aligned to the control areas within ISO 27002 – Code of\npractice for information security. The TPSA control areas map to the headings used in the\nSecurity Schedule Template. Where applicable the Security Schedule Template shall be\nnegotiated, agreed and included as an appendix within the overall contractual arrangement\nwith relevant third parties.\n4.5 Cloud Security Checklist\nThe Cloud Security Checklist is typically used to check whether a cloud service provider’s\nPROTECT Page 8 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 9 of 15\nstandard terms and conditions or service level agreements contain adequate security\ncontrols to protect University information.\n4.6 Data Protection Impact Assessment (DPIA)\nA Data Protection Impact Assessment (DPIA) is a process which helps the University to\nidentify and reduce privacy risks that may exist within an information processing activity,\ne.g. business process, project, technology or service. A DPIA enables the University to\nsystematically analyse how a particular information processing activity will impact personal\ninformation and ensure that any processing is compliant with the General Data Protection\nRegulation. (GDPR).\nThe University’s Governance, Information, and Legal Office provide services to enable\ncompliance with risks relating to the DPA, personal information and privacy.\n4.7 Business impact analysis (BIA)\nThe business impact analysis (BIA) is a process for assessing the impacts of disrupting\nactivities on University business processes, people, technologies and services. The BIA shall\ninclude the following:\n• identifying critical activities that support the day- to- day operations of the\nUniversity;\n• assessing the impacts over time of not performing these activities;;\n• setting prioritised timeframes for resuming these activities at a specified\nminimum acceptable level, taking into consideration the time within which\nthe impacts of not resuming them would become unacceptable;; and\n• identifying dependencies and supporting resources for these activities,\nincluding suppliers, outsource partners and other relevant interested parties.\nThe output from a BIA supports the development of business continuity plans.\nIndividual departments and colleges are responsible for the development and maintenance\nof fit for purpose business continuity plans.\n5. Scoring Tables\nAsset scoring tables and risk scoring tables can be seen at Annex A, alongside acceptance\ncriteria scoring and a list of ISO 27005 derived vulnerabilities.\n-End-\nPROTECT Page 9 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 10 of 15\nAnnex A\nScoring Tables\nAsset CIA scores and definitions\nConfidentiality Integrity Availability\n0 Low Information can be disclosed Information can be modified No requirement to have\nto any individual, entity, or by all individuals, entities continuous access to\nprocess. and processes. information.\n1 Medium Information is not public and Information can be modified Short periods of information\navailable to a group of by a set of authorised unavailability are tolerable\nauthorised individuals, individuals, entities and but normally authorised\nentities and processes. processes. individuals, entities and\nprocesses require access.\n2 High Information can only be Information can only be Information must be\ndisclosed to a privileged modified by the owner or a accessible to authorised\ngroup of authorised privileged group of individuals, entities and\nindividuals, entities and authorised individuals, processes at all times.\nprocesses. entities and processes.\nVulnerability level scores\nValue Explanation Example\n0 Very low Vulnerability nearly impossible to exploit\n1 Low Vulnerability difficult to exploit and requires high level knowledge of asset\n2 Medium Vulnerability can be exploited with moderate knowledge of asset\n3 High Vulnerability can be easily exploited by any one\nThreat likelihood scores\nValue Explanation Example\n0 Rare Has not previously occurred in the last 2 years\nPROTECT Page 10 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 11 of 15\n1 Annual Occurs once a year\n2 Monthly Occurs once a month\n3 Weekly Occurs once a week\nRisk scores for CIA\nVulnerability Threat C confidentiality Integrity Availabilityy\nlevel Likelihood\nL M H L M H L M H\nRare 0 1 2 0 1 2 0 1 2\nAnnual 1 2 3 1 2 3 1 2 3\nVery low\nMonthly 2 3 4 2 3 4 2 3 4\nWeekly 3 4 5 3 4 5 3 4 5\nRare 1 2 3 1 2 3 1 2 3\nAnnual 2 3 4 2 3 4 2 3 4\nLow\nMonthly 3 4 5 3 4 5 3 4 5\nWeekly 4 5 6 4 5 6 4 5 6\nRare 2 3 4 2 3 4 2 3 4\nAnnual 3 4 5 3 4 5 3 4 5\nMedium\nMonthly 4 5 6 4 5 6 4 5 6\nWeekly 5 6 7 5 6 7 5 6 7\nRare 3 4 5 3 4 5 3 4 5\nAnnual 4 5 6 4 5 6 4 5 6\nHigh\nMonthly 5 6 7 5 6 7 5 6 7\nWeekly 6 7 8 6 7 8 6 7 8\nAcceptance criteria for summed CIA scores\nRange Acceptance Criteria\nLow : Risk Score Within this range accepting the risk scenario without implementing controls may be\nbetween 0 and 8 considered. Before accepting a risk scenario, careful consideration shall be given to\nindividual asset CIA , scores. A decision to accept a risk scenario within this range\nshall be justifiable and recorded in the information security risk register.\nMedium : Risk Within this range it is advised the risk scenario is reduced by implementing applicable\nScore between 9 controls. If a decision is made to accept a risk scenario within this range then the\nand 12 reason shall be justifiable, recorded in the information security risk register and have a\ndesignated risk owner.\nHigh : Risk Score Within this range it is strongly advised the risk scenario is reduced by implementing\nbetween 13 and applicable controls. If a decision is made to accept a risk scenario within this range\n18 then the reason shall be justifiable, recorded in the information security risk register and\nhave a designated risk owner.\nCritical - Risk Within this range a risk scenario should not be accepted.\nScore between 19\nand 24\nPROTECT Page 11 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 12 of 15\nRisk decision option definitions\nAccept A justifiable decision by the asset/risk owner to accept and not implement a risk treatment plan\nto mitigate the risk.\nAvoid Typically involves either removing the asset, or changing or terminating the associated asset\nprocesses to avoid the risk.\nReduce Implementation of a risk treatment plan to lower the likelihood and/or impacts if a risk scenario\noccurred.\nTransfer The risk is shared with another party that can most effectively manage the particular risk\ndepending on risk evaluation.\nVulnerabilities and threats\nFrom ISO 27005: Information security risk management\nType Examples of vulnerabilities Examples of threats\nBreach of information system\nHardware Insufficient maintenance/faulty installation of storage media maintainability\nHardware Lack of periodic replacement schemes Destruction of equipment or\nmedia\nHardware Susceptibility to humidity, dust, soiling Dust, corrosion, freezing\nHardware Sensitivity to electromagnetic radiation Electromagnetic radiation\nHardware Lack of efficient configuration change control Error in use\nHardware Susceptibility to voltage variations Loss of power supply\nHardware Susceptibility to temperature variations Meteorological phenomenon\nHardware Unprotected storage Theft of media or documents\nHardware Lack of care at disposal Theft of media or documents\nHardware Uncontrolled copying Theft of media or documents\nSoftware No or insufficient software testing Abuse of rights\nSoftware Well- known flaws in the software Abuse of rights\nSoftware No 'logout' when leaving the workstation Abuse of rights\nSoftware Disposal or reuse of storage media without proper erasure Abuse of rights\nSoftware Lack of audit trail Abuse of rights\nSoftware Wrong allocation of access rights Abuse of rights\nSoftware Widely- distributed software Corruption of data\nSoftware Applying application programs to the wrong data in terms of Corruption of data\ntime\nSoftware Complicated user interface Error in use\nSoftware Lack of documentation Error in use\nPROTECT Page 12 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 13 of 15\nSoftware Incorrect parameter set up Error in use\nSoftware Incorrect dates Error in use\nLack of identification and authentication mechanisms like user\nNetwork authentication Forging of rights\nNetwork Unprotected password tables Forging of rights\nNetwork Poor password management Forging of rights\nNetwork Unnecessary services enabled Illegal processing of data\nNetwork Immature or new software Software malfunction\nNetwork Unclear or incomplete specifications for developers Software malfunction\nNetwork Lack of effective change control Software malfunction\nNetwork Uncontrolled downloading and use of software Tampering with software\nNetwork Lack of back- up copies Tampering with software\nNetwork Lack of physical protection of the building, doors and windows T heft of media or documents\nNetwork Failure to produce management reports Unauthorised use of\nequipment\nNetwork Lack of proof of sending or receiving a message Denial of actions\nNetwork Unprotected communication lines Eavesdropping\nNetwork Unprotected sensitive traffic Eavesdropping\nFailure of telecommunication\nNetwork Poor joint cabling equipment\nFailure of telecommunication\nNetwork Single point of failure equipment\nNetwork Lack of identification and authentication of sender and receiver F orging of rights\nNetwork Insecure network architecture Remote spying\nNetwork Transfer of passwords in clear Remote spying\nSaturation of the information\nNetwork Inadequate network management (resilience of routing) system\nNetwork Unprotected public network connections Unauthorised use of\nequipment\nPersonnel Absence of personnel Breach of personnel availability\nPersonnel Inadequate recruitment procedures Destruction of equipment or\nmedia\nPersonnel Insufficient security training Error in use\nPersonnel Incorrect use of software and hardware Error in use Error in use\nPersonnel Lack of security awareness Error in use Error in use\nPersonnel Lack of monitoring mechanisms Illegal processing of data\nPersonnel Unsupervised work by outside or cleaning Theft of media or documents\nLack of policies for the correct use of telecommunications Unauthorised use of\nPersonnel media and messaging equipment\nInadequate or careless use of physical access control to Destruction of equipment or\nSite buildings and rooms media\nSite Location in an area susceptible to flood Flood\nSite Unstable power grid Loss of power supply\nSite Lack of physical protection of the building, doors and windows Theft of equipment\nOrganisation Lack of formal procedure for user registration and de- Abuse of rights\nregistration\nPROTECT Page 13 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 14 of 15\nOrganisation Lack of formal process for access right review (supervision) Abuse of rights\nLack or insufficient provisions (concerning security) in contracts\nOrganisation with customers and/or third parties Abuse of rights\nOrganisation Lack of procedure of monitoring of information processing Abuse of rights\nfacilities\nOrganisation Lack of regular audits (supervision) Abuse of rights\nOrganisation Lack of procedures of risk identification and assessment Abuse of rights\nOrganisation Lack of fault reports recorded in administrator and operator Abuse of rights\nlogs\nBreach of information system\nOrganisation Inadequate service maintenance response maintainability\nBreach of information system\nOrganisation Lack or insufficient Service Level Agreement maintainability\nBreach of information system\nOrganisation Lack of change control procedure maintainability\nOrganisation Lack of formal procedure for ISMS documentation control Corruption of data\nOrganisation Lack of formal procedure for ISMS record supervision Corruption of data\nLack of formal process for authorisation of public available Data from untrustworthy\nOrganisation information sources\nOrganisation Lack of proper allocation of information security responsibilities Denial of actions\nOrganisation Lack of continuity plans Equipment failure\nOrganisation Lack of e- mail usage policy Error in use\nLack of procedures for introducing software into operational\nOrganisation systems Error in use\nOrganisation Lack of records in administrator and operator logs Error in use\nOrganisation Lack of procedures for classified information handling Error in use\nOrganisation Lack of information security responsibilities in job descriptions Error in use\nLack or insufficient provisions (concerning information security)\nOrganisation in contracts with employees Illegal processing of data\nLack of defined disciplinary process in case of information\nOrganisation security incident Theft of equipment\nOrganisation Lack of formal policy on mobile computer usage Theft of equipment\nOrganisation Lack of control of off- premise assets Theft of equipment\nOrganisation Lack or insufficient 'clear desk and clear screen' policy Theft of media or documents\nOrganisation Lack of information processing facilities authorisation Theft of media or documents\nOrganisation Lack of established monitoring mechanisms for security Theft of media or documents\nbreaches\nOrganisation Lack of regular management reviews Unauthorised use of\nequipment\nOrganisation Lack of procedures for reporting security weaknesses Unauthorised use of\nequipment\nLack of procedures of provisions compliance with intellectual Use of counterfeit or copied\nOrganisation rights software\nPROTECT Page 14 of 15\nDocument Control\nReference: BUL-POL-4.1\nIssue No: 2\nIssue Date: 09/12/17\nPage: 15 of 15\nPROTECT Page 15 of 15"
          },
          "011_BUL-POL-IRM01-Information-Risk-Management-Policy-v1.0.pdf": {
            "pages": 9,
            "text_length": 14378,
            "content": "Document Control\nReference: BUL-POL-IRM01\nIssue No: 4\nIssue Date: 26/01/2018\nPage: 1 of 9\nInformation Security\nRisk Management Policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nProtect Page 1 of 9\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\nIssue Date: 26/01/2018\nPage: 2 of 9\nDocument History\nVersion Author Comments Date\nV 0.1 Andrew Clarke Initial Draft 09/12/2016\nV 0.2 Mick Jenkins Re-Org Draft 09/08/2017\nV 1.0 Mick Jenkins First release\nV 1.1 Mick Jenkins Approved ISC 26/01/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compli...",
            "full_content": "Document Control\nReference: BUL-POL-IRM01\nIssue No: 4\nIssue Date: 26/01/2018\nPage: 1 of 9\nInformation Security\nRisk Management Policy\nBrunel University London\nAn ISO/IEC 27001:2013: Aligned Document - Implementing Cyber and\nInformation Security Best Practice\nInternal Use Only\nMick Jenkins\nChief Information Security Officer\nProtect Page 1 of 9\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\nIssue Date: 26/01/2018\nPage: 2 of 9\nDocument History\nVersion Author Comments Date\nV 0.1 Andrew Clarke Initial Draft 09/12/2016\nV 0.2 Mick Jenkins Re-Org Draft 09/08/2017\nV 1.0 Mick Jenkins First release\nV 1.1 Mick Jenkins Approved ISC 26/01/2018\nDocument Approval\nThe contents of this document are confidential to Brunel University London (BUL). Proprietary information\npresented in this document may not be used without written consent from BUL and remains the exclusive\nproperty of BUL unless otherwise agreed to in writing.\nThis document requires the approval from BUL as defined in the ISMS Compliance document.\nMG Jenkins\nDocument Owner: Michael Jenkins Document Approver: Pekka Kahkipuro\nChief Information Security Officer Chief Information Officer\nDocument Distribution\nName Title Version Date of Issue\nAll Directors for Cascade\nDCO’s / DRO\nCOO\nCIO\nCFO\nUniversity secretary\nProtect Page 2 of 9\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\nIssue Date: 26/01/2018\nPage: 3 of 9\nContents\n1 Introduction .................................................................................................................................... 4\n1.1 Purpose ................................................................................................................................... 4\n1.2 Policy scope ............................................................................................................................. 4\n1.3 University Risk Management Framework ............................................................................... 4\n2 Information Risk Management Policy ............................................................................................. 6\n3 Asset Risk Management .................................................................................................................. 7\n3.1 Information Asset Identification and Profiling ........................................................................ 7\n4 Risk Treatment ................................................................................................................................ 8\n4.1 Determination of Controls ...................................................................................................... 8\n4.2 Comparison with Annex A of ISO/IEC 27001:2013 ................................................................. 9\nProtect Page 3 of 9\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\n1 Introduction\nIssue Date: 26/01/2018\nPage: 4 of 9\nInformation is a vital university asset which requires an appropriate level of protection from\nunauthorised disclosure, access, modification or destruction. Information security risk management\nprovides this level of risk analysis to apply sensible and proportionate protection by applying the\ncorrect level of resource and safeguards – thus reducing risks to information to a level that is\nacceptable to the organisation and provides information assurance to the Executive Board.\nThe successful implementation of an information risk management framework across Brunel\nuniversity London (BUL) is essential to ensure that information, in whatever format, is provided the\ncorrect level of protection commensurate with its sensitivity and criticality to BUL business and\noperations.\nISO 27001 - Conformance\nThis section indicates the University Conformance to ISO27001:2013.\nUniversity ISMS Control Number Clause 4 – Context of the Organisation - Risk\nAssessment and Management\nISO 27001:2013 Conformance Control Information Classification Objective\nA.4.1 - Understanding the organisation and its context\nA.4.2 – Understanding the needs and expectations of\ninterested parties\nA.4.3 – Determining the scope of the Information\nSecurity Management System\n1.1 Purpose\nThe purpose of this Information Security Risk Management Policy is to provide assurance to the\nExecutive Board that risks to information assets managed by, or on behalf of BUL, are being\nmanaged effectively and consistently across the organisation.\n1.2 Policy scope\nThis policy applies to anyone who has access to BUL Information Systems whether they are\nemployed or under a term of contact, including third parties. In effect, this policy applies to anyone\nworking within BUL regardless of location. It also extends to University information held by third\nparties and partners.\nThis policy encompasses the people, processes and technology that process, transmit, or store BUL\ninformation, both physical and electronic.\n1.3 University Risk Management Framework\nPage 4 of 9\nUNCLASSIFIED\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\nThe University has a comprehensive risk management framework that describes the University’s\nIssue Date: 26/01/2018\napproach to risk management based on our collective experiences of managing risks and set against\nPage: 5 of 9\ngood practice drawn from the Office of Government Commerce’s (OGC) ‘Management of Risk:\nGuidance for Practitioners’, and BS ISO 31000 “Risk management - Principles and guidelines”\nstandard.\nThe risk management framework comprises the Risk Management Policy and Risk Management\nProcedure, supported by the Risk Management Guidelines.\nThis Information Risk Management Policy is supplemental to the existing University Risk\nManagement Framework policy and procedures, predicated on the requirement to operate a risk\nmanagement system and methodology, specific to information security, and operating within the\nuniversity Information Security Management System (ISMS).\nInformation security risk management has a number of differing industry wide models, specifically\ndesigned for the nuances of information security risk scoring and assessments. BUL will adopt the\ngood practice methodologies of ISO 27005 – Information Security Risk Management – The precise\nmethodology and scoring in set out in an accompanying BUL policy document – BUL IRM02 Risk\nManagement Methodology.\nPage 5 of 9\nUNCLASSIFIED\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\n2 Information Risk Management Policy\nIssue Date: 26/01/2018\nPage: 6 of 9\n2.1 Information Security Risk Management.\nThe BUL cyber & INFOSEC team will apply an intelligence led, risk managed approach to\norganisational information security controls developed in alignment with the university risk\nappetite for securing information assets.\nThe risk management model that will be applied is based upon ISO 270051, aligned to ISO\n27001 and 27002, and operates with other good practice drawn from COBIT2 and UCISA3.\nProcesses shall be implemented so that information risks are appropriately assessed,\nresponded to, accepted, monitored and communicated to the Executive Board.\n2.2 Information Security Risk Analysis\nA documented risk analysis process is used as the basis for the identification, definition and\nprioritisation of risks. The risk analysis process shall include the following:\n Identification and prioritisation of the threats to Information assets.\n Identification and prioritisation of the vulnerabilities of Information assets.\n Identification of a threat that may exploit a vulnerability documented as a cyber\nvulnerability assessment (CVA).\n Qualitative identification of the impact to the confidentiality, integrity and availability of\nInformation Resources if a threat exploits a specific vulnerability.\n Identification and definition of measures and/or controls used to protect the\nconfidentiality, integrity and availability of Information assets\nThe risk analysis process is documented through a cyber & information risk register, informed\nby:\n Cyber vulnerability assessments (CVA).\n Security Assessment Reports (SAR) – An annual ISMS assessment.\n Penetration testing results.\n Threat assessments.\n Threat trends.\n Intelligence reports.\nPage 6 of 9\nUNCLASSIFIED\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\nIssue Date: 26/01/2018\nPage: 7 of 9\nA strategic risk register is provided to executive board that provides an overall summary of\nstrategic risk, derived from the operation risk register and CVA’s. These are regularly updated\nwhen environmental, operational or technical changes arise that impact the confidentiality,\nintegrity or availability of Information assets such as incidents, lessons identified, and\ntechnical changes, or new threats.\n2.3 Information Risk Assessment\nA systematic and structured information risk assessment methodology has been established\nso that the BUL can appropriately assess and respond to risks to its information assets. This\nmethodology is shown in the accompanying paper ‘Information Security Risk Management\nMethodology’ BUL-POL-IRM02.\n2.4 Threat and vulnerability\nInformation assets shall be evaluated for threats and vulnerabilities on a regular basis or when\na significant change or incident occurs. Threat and vulnerability shall be actively monitored\nvia threat and intelligence reports received by the cyber & INFOSEC team from a variety of\nsources.\n2.5 Control Evaluation\nInformation security controls and countermeasures, which have been implemented in\nresponse to risks, shall be evaluated regularly for effectiveness and suitability. Controls will be\nemplaced via the risk management principles of intelligence led, risk based, with controls\naligned to the ISMS statement of applicability (SoA).\n2.6 Information Asset Responsibilities\nAll information assets shall be recorded and Information Asset Owners identified in\naccordance with the defined principles of the ISMS and ‘Role and Responsibilities’ Policy\nPaper. Information asset owners are responsible for the classification and risk management\nof the assets.\n3 Asset Risk Management\nThe asset risk management process determines the specific threats and risks which affect the\nconfidentiality, integrity and availability of all university information assets.\n3.1 Information Asset Identification and Profiling\n1 Information Security Risk Management\n2 Control Objectives for Information and Technology\n3 Universities and Colleges Information Systems Association\nPage 7 of 9\nUNCLASSIFIED\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\nAn information asset is essentially a distinct set of information which has some value to the\nIssue Date: 26/01/2018\norganisation.\nPage: 8 of 9\nWhen evaluating risk against an information asset, BUL information asset owners shall assess\nand document the assets to cover its profile entirety including:\n Exactly what the asset is\n Its requirements for confidentiality, integrity and availability\n The lifecycle of the asset\n The business processes which affect it\n The value of the asset to the organisation\n The expected value of the asset to an attacker\n Its classification (see Information Security Classification Policy)\n its expected lifespan.\n4 Risk Treatment\nRisk is treated by applying controls that modify the risk in such a way that it meets the specified\nRisk Acceptance Criteria. This is achieved through controls which either:\n Reduce the likelihood of the risk occurring by attempting to prevent the occurrence of\nthe event, or detect it in sufficient time for the organisation to deal with it or\n Reduce the severity of the risk by reacting to the consequence.\nThrough the use of controls it is planned that the likelihood or impact of the event can either be\neliminated or reduced greatly. The control may be performed by this organisation or another\nexternal organisation.\n4.1 Determination of Risk Treatment\nBUL shall adopt an information risk treatment methodology that provides an auditable trail of\ndecision making regarding each assessed risk. Aligned to the university risk treatment policy,\ninformation security risk treatment will be documented as one of four option in the risk\nregister:\n Avoidance – ceasing the activity due to it being unacceptable risk\n Reduction – placement of controls and contingency plans\n Transfer – where applicable to third parties or using insurance\n Tolerate – accepting the risk within risk appetite parameters\nCyber & Information security risk decision making shall be undertaken via the relevant\ncommittees assigned to review and monitor risk, with the Senior Information Risk Owner\n(SIRO) providing oversight to executive board.\nWhere reduction measures are emplaced, each risk event is analysed and documented to\ndetermine:\n Controls which are required to prevent the event\nPage 8 of 9\nUNCLASSIFIED\nDocument Control\nReference: BUL-POL-IRM01\nIssue No: 4\n Controls which are required to detect the event\nIssue Date: 26/01/2018\n Controls which are required to react to the associated consequences of the event\nPage: 9 of 9\n4.2 Monitoring and Reviewing Risks\nAll risks cyber & information security risks will be monitored and reviewed in accordance with\nthe arrangements specified in the University Risk Management Procedure. As a minimum,\noperational and strategic cyber & INFOSEC risks will be reviewed every six months.\nInformation Asset Owners, shall review the relevant risks to their own assets, on a 6 monthly\nbasis and provide reports and assessments to the SIRO, or asa required.\n4.3 Comparison with Annex A of ISO/IEC 27001:2013\nIn order to ensure that necessary controls have not been omitted from the Risk Treatment\nPlan they are compared with the controls in the statement of applicability (SoA) for ISO\n27001:2013 standard. Each control within the standard is considered and the following\ndetermined:\n Is it applicable to the university SoA.\n If it is a variant of an SoA control, or deemed as not being applicable, the reason for this\nshall be recorded.\n What is the implementation status (Implemented; In Progress or Not Started)\n If as a result of this process an SoA control is determined to be applicable, but isn’t\nalready covered - the Risk Treatment Plan is revised to include it.\n4.4 Risk owner approval\nThe Information Security team shall engage and support the asset and risk owners to review\nrisk assessments and risk treatment plans. The risk owners ultimately approve the risk\ntreatment plans.\n-End-\nPage 9 of 9\nUNCLASSIFIED"
          }
        }
      }
    ]
  },
  "iso27001_analysis": {
    "timestamp": "2025-08-17T18:20:24.152144",
    "documents_analyzed": 11,
    "control_coverage": {
      "total_controls": 12,
      "covered_controls": 12,
      "coverage_percentage": 100.0,
      "covered_list": [
        "A.15",
        "A.17",
        "A.13",
        "A.14",
        "A.6",
        "A.8",
        "A.16",
        "A.11",
        "A.10",
        "A.12",
        "A.5",
        "A.18"
      ]
    },
    "policy_mapping": {
      "001_BUL-POL-6.1.1-Brunel-ISMS-Roles-and-Responsibilities-v1.1.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "002_BUL-POL-6.2.1-Information-Security-Remote-Working-Policy-v1.1.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.15",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "003_BUL-POL-8.1-ISMS-Asset-owners-Roles-and-Responsibilities-v1.0.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "004_BUL-POL-10.1-Cryptographic-Policy-v1.1.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.10",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "005_POL-IT-Acceptable-Usage-Policy-v1.0.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.15",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "006_BUL-POL-IRM02-Information-Risk-Management-Methodology-v1.1.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.15",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "007_POL-05.1-POLICY-Information-Security-Policy.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.15",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "008_BUL-POL-6.1.2.1-ISMS-Information-Asset-Owners-Handbook.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "009_BUL-POL-08-02-Information-Classification-v1.1.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.15",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "010_BUL-POL-IRM02-Information-Risk-Management-Methodology-v1.1+(1).pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.15",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      },
      "011_BUL-POL-IRM01-Information-Risk-Management-Policy-v1.0.pdf": {
        "covered_controls": [
          "A.5",
          "A.6",
          "A.8",
          "A.11",
          "A.12",
          "A.13",
          "A.14",
          "A.16",
          "A.17",
          "A.18"
        ],
        "primary_focus": "A.5"
      }
    }
  }
}